[
    {
        "id": 47,
        "title": "david",
        "company_name": "david",
        "application_link": "https://davidcao.xyz",
        "application_details": "david",
        "job_description": "david",
        "status": {
            "name": "Applied and Waiting",
            "color": "yellow",
            "progression": 1
        }
    },
    {
        "title": "Software Developer",
        "company_name": "Gregg Distributors",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CDOE58Ln3I_71jCffxRJzPV_9TnPnV0nzgE7CgxEVcwzh2y6euQTnIq85ekp0zFJ_VZbAujOP7Bp6NKrCZ5jT0kJWObbNmH_OKbDB3O9BiQWwq7sJcS1qzzmpg0taxAlQTN0A2Fe42UWVqnbop46uTCvmNJzjegPJGUjWQ0vvp57DpZdGwlNCZ8upzgttsUMr9jaE2lMTuAB2lNAhrmq265dMBwKxaVVa-QHG-CvZUxvqJriAh72xFVJ1Ez5wGw1LOiG6P45P5dH9O5zdVbQc23zDICHDH_0s4k80JBgrhEGiLIekB1d_2Y8t6_QMX4gNFX72wyCeMtNRInC2hUHabKF7zISN38c5HiJrMnEaAizkSaoSarZ3Lz6b9azN507mF5RxTYqbJ2ji32VB6FW8Ka9mjufqisg9lLbZkKQaI9HZN_adEaVwglIdDhL4Uzz1Snvbb99NRVNS9gGpsL4_uBJLRmfT3VmQKbgnS7hhMeTt0OGjdjdren8Sk6Uj4hzympNs-H_na__xC-1FBQ4QSMBH8e9yjGFKGdqFlb5TwyA==&xkcb=SoAe-_M3TuKkhsQVa50LbzkdCdPP&p=0&fvj=1&vjs=3&tk=1gpe1aqqukp1e801&jsa=3054&oc=1&sal=0",
        "application_details": [
            "$4,500–$6,000 a month",
            "Full-time",
            "Permanent"
        ],
        "job_description": "Gregg Distributors is a well-established and growing industrial supplies company that has been serving Western Canadians for over 54 years.\nWe are looking for an experienced and mature individual to join our Information Technologies team with the primary role of e-commerce web and application development. This individual will work both independently and as part of a team in order to successfully achieve corporate initiatives and goals. This position will collaborate with both our Marketing and our I.T. team in order to complete various web based projects. This position also works to maintain web industry best practices with respect to data security and high performance systems.\n* The successful candidate will be working in person and on location with the rest of our dynamic I.T. team at our West Edmonton location.\nThe successful candidate will be a self-motivated individual with a creative mind and a strong work ethic. Candidates must have exceptional verbal and written communication skills with the ability to write clearly, accurately and concisely while using proper spelling and grammar. Candidates must be fluent in the English language and be able to provide examples of past work.\nWe offer a very attractive compensation package, benefits and bonus program as well as extensive perks and incentives.\nResponsibilities:\nMaintenance and further development of existing websites, website databases, and website related internal programs\nContinually enhancing and optimizing websites for SEO\nMaintaining web industry best practices with respect to data security and high performance systems\nCreating efficient, reusable and valid HTML/CSS\nAssist in providing support to internal & external users of the websites and software\nQualifications:\nCompletion of industry recognized training\nExperience with Microsoft Azure, Visual Studio 2015+, SQL, SSIS, .Net, C#, AngularJS, .Net Core, JSON\nStrong HTML, CSS, JavaScript and jQuery skills\nWorking knowledge of SQL and Ajax\nAble to work well in a team environment and be supportive, collaborative, cooperative & service oriented\nExcellent oral communication skills\nHigh level of attention to detail with the ability to multi-task\nExperience with Python or additional programming language an asset\nExperience with Search Engine Optimization an asset\nExperience with PIM systems an asset\nWhy Work For Gregg’s?\nWe offer many unique incentive programs that help to benefit not only the lives of our staff members, but their families as well. Here are just a few examples of what we include in our Gregg’s Employment Advantage:\nComprehensive benefits package\nR.R.S.P. Plan\nQuarterly Productivity Bonus\nInvestment/Equity opportunities\nHousing Assistance\nTravel Rewards\nScholarship opportunities for children of employees\nEmployee referral program\nOpportunity to enjoy extra time away from work\nWe thank all candidates who apply, however only those selected for an interview will be contacted.\nJob Types: Full-time, Permanent\nSalary: $4,500.00-$6,000.00 per month\nBenefits:\nCompany events\nDental care\nDisability insurance\nExtended health care\nLife insurance\nOn-site parking\nProfit sharing\nRRSP match\nVision care\nSchedule:\nDay shift\nMonday to Friday\nSupplemental pay types:\nBonus pay\nWork Location: One location",
        "status": {
            "name": "Applied and Waiting",
            "color": "yellow",
            "progression": 1
        },
        "id": 0
    },
    {
        "title": "Software Developer",
        "company_name": "The Organic Box",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Dyy32FiVUw_bVd-vo9BhNa_8grk_UB5nKe3serb11aLTygRI53CnCGQZsXhhPPkfrugRIi6jQC6rOsz8QDmGNiI3AY1H98WG627Y4XkRglOx3tB6sqCrMym7YfahPLSz41ZYcOjVMEq1M7tCW3-L7cQGF0nigu9Hkd93aJgE3765Hs9tqm_yl6dxPzAQSqd2AWNQpnsNKr4KwFKUb0PRjddlhoR9diSH2n8zecqGHXx8fdwEj0DBplELvhM1zmX_-bAJzdwvqT4dGfFoUhIdI1EtJ6nReDd8B8Bhb8bTV_eaMRZQxn9k8ePhDGQmnKiyvyI45WOz_0_oOMHH-SoDpKYAc6hOdZeYWzKXb4_JRnFT8AFB3rqXWJ4iDDYVZ2yZt_iWT025mQ_iI5MFY4zsq20YuR95u5Ja6sLjZ0333TQCKxB0rR0KcnYPt37dqMdc-S6ZSl0nVxWW4vvI5-qIdeYly8KqjCQbwoN9bzR2aRgWUwZr_VftMJwK7QyS9FtWpdqjpyg8ur27yWFMAZjLFXjpBfcsqBL7BWwv1nLdn3ng==&xkcb=SoCq-_M3TuKkhsQVa50KbzkdCdPP&p=1&fvj=1&vjs=3&tk=1gpe1aqqukp1e801&jsa=3054&oc=1&sal=0",
        "application_details": [
            "From $80,000 a year",
            "Full-time"
        ],
        "job_description": "Interested in accelerating your career with a growing company that’s committed to advancing Alberta’s local and organic food market? Together with our producers, partners, and members, our team makes up the heart and soul of our food family to bring the highest quality food to families throughout Alberta. The Organic Box is an equal opportunity employer, and has a diverse range of individuals who bring their own unique attributes to our team and make our company what it is! And we’re looking for a Software Developer to help our growing team!\nPURPOSE OF THIS POSITION:\nAs a Software Developer, you will assist with a wide variety of tasks including design, front-end and back-end development, and general support/ maintenance of Shopify plus projects. It’s a very dynamic role for the right candidate.\nPlease Note, this role does accommodate working remotely.\nRESPONSIBILITIES:\nSoftware architecture design and development\nDeploy changes to development servers frequently\nCreate and work with Django templates with compliant HTML5/CSS3\nModel and implement intricate data structures using relational databases, primarily PostgreSQL\nIdentify, prioritize and correct issues\nPlan, direct and implement new features and functionality\nCoordinate work across all our technology partners\nWrite complex Django apps following community development best practices\nImplement and maintain the use of common third-party APIs\nStay on top of the latest technologies\nHelp set up and run projects in production environments on Linux (Ubuntu-flavour) with Nginx, UWSGI, PostgreSQL, Celery, Redis and other tools frequently deployed alongside Django web apps\nHelp architect scalable solutions and performance-test applications to find and eliminate bot\nJOB QUALIFICATIONS/REQUIREMENTS:\nWhat you bring to the table:\n4+ years of web development experience\n2+ years experience with Shopify as a platform\nAWS setup, monitoring, and integration\nLanguages: JavaScript, HTML/CSS, Shopify Liquid (70%) and Python, Dart (30%)\nFramework: Django\nExperience with Linux systems, Ansible, Nginx, uWSGI\nAsynchronous task handling: Celery and redis/RabbitMQ\nDatabase: PostgreSQL\nServices: GitHub/git, AWS (EC2, RDS, S3, CloudFront, Route53)\nExcellent English oral and written communication skills and interpersonal skills\nHighly organized, solution-driven with strong team collaboration\nDesire to work cooperatively with others on a team; the ability to demonstrate interest, skill, and success in working towards a common business goal.\nStrong problem solving and decision making skills\nWHAT WE OFFER:\nCompetitive Compensation\nExtended health care\nRRSP Match\nVacation & paid time off\nLife insurance\nOn-site parking\nEmployee assistance programs\nCommuter benefits\nDiscounted/free food\nDental care\nWork from home opportunities\nWe thank all applicants for their interest in The Organic Box, however only those selected for an interview will be contacted.\nBenefits:\nCommuter benefits\nDental care\nDiscounted or free food\nEmployee assistance program\nExtended health care\nFlexible schedule\nLife insurance\nPaid time off\nRRSP match\nWellness program\nJob Type: Full-time\nSalary: From $80,000.00 per year\nBenefits:\nCommuter benefits\nDental care\nDiscounted or free food\nEmployee assistance program\nExtended health care\nFlexible schedule\nLife insurance\nPaid time off\nRRSP match\nWellness program\nSchedule:\n8 hour shift\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 1
    },
    {
        "title": "Software Developer",
        "company_name": "GoodMorning.com",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DJxCQ6jGvpmLk-EBJ5X0NXcM1dtFfBRGWPfcpRj2gRM1G-2IRxbYyPn00lrWfjjFxT7cdheZxKLvEZ24678Wu3WWjhpGBeZrZQWPqOa1pTxb1pxzh6Zis5JCzHA7lri2dswIHeW32-vw9sSVLqwTZ_NL65aU4MLUtC0nE6dxSZCf3GKiNUYiNIaayFR-E4Azri5FF0KD3uT4kg3PUnwXv8vSjSsI9PzqAwVsbVV47NeKhqQipzVpINnkZPOJfZRKqQp--zh_R03h4KwTP31TjmyF2ALfOFU2RONQD491pU26pAT7I7JpxNx5g3nZvRfuGoqvyrjotk1zAlimXpp_ncgEk9Kbo78_30KFNbwlpfQfWFgnlcs92qj4E68U1XBZ3E4ui0S19tuwDZ-yq6QPLM7y9IhLZkmclpF1UZ_tpab51WukETjz90vfCAO04uqbzxX1344pK-q63k1Nu0abpA5jUAs-AR8tC-7ADncn2NLwntTjF2iM-cPnypfk1u80vb3muaG33Kxkds3HjVlMpOblWggavyaxA=&xkcb=SoA3-_M3TuKkhsQVa50JbzkdCdPP&p=2&fvj=1&vjs=3&tk=1gpe1aqqukp1e801&jsa=3054&oc=1&sal=0",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Dear Future Teammate,\nThank you for considering joining our team.\nOur company is unique in Edmonton: we compete in a large North American market against some of the world’s smartest tacticians. Our scope goes well beyond the borders of our city, our province, and even our country. Because of this, we have built a local eCommerce powerhouse, with a culture and depth of knowledge not available anywhere else in Edmonton.\nWe believe that working with high-performers is the best office perk; that practicing radical honesty within our team makes us exponentially better; that paying great salaries with excellent benefits means we attract the best and the brightest; that giving freedom and responsibility brings out the best in people; and that being relentlessly customer-centric will drive phenomenal growth.\nIf you are an expert at your craft, have strong, fact-based opinions, and welcome the challenge of your life, then I personally invite you to join us.\n– Sam Prochazka, CEO of GoodMorning.com\nDescription\nA systematic, detail-oriented, forward-thinking software developer, responsible for designing and implementing software solutions along with the associated infrastructure in the realm of eCommerce.\nResponsibilities\nCoordinates with internal and external customers to establish requirements and objectives for deliverables.\nEnsures internal and external customer expectations are consistently met or exceeded.\nDevelops high level designs and associated work plans prior to implementation.\nDevelops fully defined minimal interface definitions prior to implementation.\nDelivers solutions that scale effectively in terms of both usage and future expansion.\nCollaborates with and supports digital designers on front-end development.\nOptimally draws from a large and continuously growing pool of tools and strategies to solve problems.\nMaintains and leverages infrastructure as part of the development process.\nContributes to the development of the development process itself, within the team.\nRequirements\nMinimum 4 year bachelor's degree in computing science or engineering.\nUnderstanding of object-oriented design principles, and an ability to apply them in practice.\nAbility to think strategically and design under constraints.\nFirm understanding of version control in both theory and practice.\nSolid grasp of the English language in terms of speaking, reading and writing.\nFamiliarity with the following computer languages: PHP, HTML, CSS, JavaScript, Python, Bash, C++, and SQL.\nFamiliarity with the following systems or applications:\nGNU/Linux and POSIX compliant environments in general\nBuild systems\nDevOps processes\nGit\nWeb servers (Apache, Nginx, lighttpd)\nPostgreSQL\nMySQL\nWordPress/WooCommerce\nJob Type: Full-time\nBenefits:\nCasual dress\nCommuter benefits\nDental care\nDiscounted or free food\nEmployee stock purchase plan\nExtended health care\nOn-site gym\nPaid time off\nRRSP match\nStore discount\nVision care\nSchedule:\n8 hour shift\nMonday to Friday\nAbility to commute/relocate:\nEdmonton, AB: reliably commute or plan to relocate before starting work (required)\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 2
    },
    {
        "title": "Software Developer Co-op",
        "company_name": "Intuit",
        "application_link": "https://ca.indeed.com/rc/clk?jk=65a66ce254c95e0b&fccid=9784ae78e9834539&vjs=3",
        "application_details": [
            "Internship / Co-op"
        ],
        "job_description": "Overview\n“Where's my tax refund?” “How’s my business doing?” “Can I afford to buy that?”\nEvery day, millions of people and businesses around the globe rely on Intuit’s products to answer these questions. The Globalization team at Intuit is at the forefront of building global capabilities to enable delightful user experiences in their local languages.\nJoin our team as a Software Developer Co-op to develop new capabilities for Intuit products that enable content to be seamlessly localized and delivered globally at scale, with speed and excellence. As part of the team, you will work with product managers, stakeholders, and developers to rapidly deliver tools, software components, and web services that serve both internal developers and end users. We will match you with a mentor to build your skills and grow your career. Bring your passion and be ready to learn fast and boldly innovate beyond the currently accepted normal. This opportunity is for you, if you are passionate about learning modern development technology stack.\nWhat you'll bring\nProgramming fundamentals with an object oriented programming language\nNice to have: familiarity with Python, Javascript and Typescript\nNot required, nice to have: Framework experience (NodeJS/Express/NextJS/FAST API/React). Previous work experience in software development\nHow you will lead\nWorking together with a small diverse team: Deeply understand customer problems and deliver specific features to delight them\nCollaborate with other engineers to share best practices and knowledge of emerging technologies\nImplement features, products, and enhancements that improve the user experience\nParticipate in the agile feature/product design process working with cross-functional teams including: Product Management, Design, QA and Operations",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 3
    },
    {
        "title": "Software Developer",
        "company_name": "Onlea Enterprises Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=345c8f59a5df430d&fccid=f9b5dfaee7bb9109&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Onlea, a global leader in digital learning experiences, is looking for someone to help us teach the world. We are looking for a technical developer with a passion for problem-solving, the mind of a teacher, the spirit of an artist, the heart of a designer and the soul of a lifelong learner. Do you long to bring your skills to content that’s more meaningful and has more impact on the world? Then come to Onlea and be a part of a team that creates great learning experiences for students the world over. Our courses have won awards, are ranked amongst the top MOOCs of all time, and have been taken by over a million people in over 170 countries around the world. If this sounds appealing, then get in touch and tell us about yourself.\n\nThis will be a remote position and our office is located in Edmonton, Alberta if you’d prefer to work in the office.\n\nYou must be legally entitled to work in Canada. Preference will be given to Alberta-based applicants.\n\nThis will be a Full Time Permanent Position\n\nArea of Focus: Software Development\n\nThe Hats You May Wear:\nFull Stack Developer, Application Developer, Platform Engineer, Researcher, UX Designer, Database Engineer\n\nResponsibilities and Accountabilities include:\nWorking with Onlea’s research team to design, architect, and implement a commercial product.\nBeing able to effectively mentor a small team of developers.\nParticipating in planning, code reviews, and brainstorming sessions.\nEnsuring cross-compatibility between supported browsers and devices.\nRunning user tests and analyzing feedback.\nResearching and evaluating new technologies.\nWorking collaboratively with non-programming members of Onlea (e.g., user experience experts, beta testers, sales/marketing).\nHelping prepare documentation for external users, grant applications, sales pitches, etc.\nHelping with internal budgeting for your projects.\nWork well in a multi-disciplinary collaborative environment.\n\nKnowledge, Skills, Abilities, and Attributes:\nThe Senior Software Developer is able to:\nArchitect a large software project.\nWrite maintainable, reusable, well-documented modular code.\nFollow established software engineering best practices.\nBring a unique perspective to planning and problem-solving.\nEnjoy researching, learning, and utilizing the latest technologies and tools available.\nBe a strong communicator.\n\nand has experience with:\nFull stack development.\nAdvanced knowledge of most of the following: JavaScript, NodeJS, React, Python, Docker, and REST APIs.\nUser interface and web design.\nFamiliarity with database design, security, cloud computing, and elastic search is beneficial.\nExperience with natural language processing, machine learning, and AI is an asset.\n\nOur Core Values\nWe Work Together from diverse points of view, all in service of developing engaging learning experiences;\nWe are Hungry for Knowledge; and,\nWe Add Value to each other, to our clients and to our communities.\n\nWhy Join Onlea?\nA comprehensive health and dental benefits for you and your family\nA subsidy that supports your Professional Development\nA day off to volunteer at you fave event or charity\nYou will be able to collaborate with a diverse, fun, and talented team as we build the future of eLearning together\nYou will be part of an outstanding team culture.\n\nOnlea is an equal opportunity employer and we welcome applications from all qualified persons. We do not discriminate based on race, ethnicity, colour, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.\n\nWe thank all applicants for their interest. However, only those individuals who are selected for an interview will be contacted.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 4
    },
    {
        "title": "Intermediate Software / Shopify Developer",
        "company_name": "The Organic Box",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Dyy32FiVUw_bVd-vo9BhNa_8grk_UB5nKe3serb11aLTygRI53CnCGurGFViKyA88VihjdaEYaZFIFZvKw8pytdVog9XrW3hcEil379CodTtVzP6vrkTu6kFnd0aJsF5pn4t26oKyT42RV0_5jGYiGtSTgna-chweSaCsJMhPO9Kbk67COcOoeq2loPaHyTC3AUqm9u3qOI7Kykq4maWnQr6Gjab-CGp7jv3KYtmOwqxWzHJOH1bed7WidD2wb8PwYFuTZcUdFZ8yPJiMOtaWr7GMVJ8oJmMAQoeRw3mFsdl7zR6YY69RxFB_QFdXXYpazSXJeSg4rWbxFbD4TAmSrjYPbqq8RmJvegBixsWrc45a9yBunnkuvQ7IsIL6xfLCli9SKjUiPHkUqYjqAUG-iYuRC2jud3IjurNEh1PdJyY0cUoq8ysGY8IpHTSUr1TcKaqdWEhyaFD3QlBhx7pcL_eJV0qVxny2ZszMQjPBwd3X3RT4_UyYhVkjYrrL5SITUSQn1k_vBsAF1rvrdmPtJ2eVYe48wfYBQaCXq4BtDpg==&xkcb=SoBb-_M3TuKkhswVa50LbzkdCdPP&p=5&fvj=1&vjs=3&tk=1gpe1aqqukp1e801&jsa=3054&oc=1&sal=0",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Interested in accelerating your career with a growing company that’s committed to advancing Alberta’s local and organic food market? Together with our producers, partners, and members, our team makes up the heart and soul of our food family to bring the highest quality food to families throughout Alberta. The Organic Box is an equal opportunity employer, and has a diverse range of individuals who bring their own unique attributes to our team and make our company what it is! And we’re looking for a rockstar Software Developer to join our team!\nWHY JOIN US?\nCompetitive Salary (commensurate based on your experience level)\nBenefits plan\nGroup RRSP plan with employer matching\nETS @ Work subsidized bus passes\nOpportunity to join an innovative start-up that is revolutionizing warehousing & logistics in the food industry\nStaff discounts for all our products\nUnique entrepreneurial culture\nPURPOSE OF THIS POSITION:\nAs a web developer, you will assist with a wide variety of tasks including design, front-end and back-end development, and general support/maintenance of Shopifyplus projects. Just to clarify this is a not a web designer role. It’s a very dynamic role for the right candidate.\nPlease Note, this role does accommodate working remotely.\nRESPONSIBILITIES:\nDeploy changes to development servers frequently\nCreate and work with Django templates with compliant HTML5/CSS3\nModel and implement intricate data structures using relational databases, primarily PostgreSQL\nIdentify, prioritize and correct issues\nPlan, direct and implement new features and functionality\nCo-ordinate work across all our technology partners\nWrite complex Django apps following community development best practices\nImplement and maintain the use of common third-party APIs\nStay on top of the latest technologies\nHelp setup and run projects in production environments on Linux (Ubuntu-flavour) with Nginx, UWSGI, PostgreSQL, Celery, Redis and other tools frequently deployed alongside Django web apps\nHelp architect scalable solutions and performance-test applications to find and eliminate bot\nJOB QUALIFICATIONS/REQUIREMENTS:\nWhat you bring to the table:\n2-3 years of web development experience\n1+ years experience with Shopify as a platform. We love fast learners but some platform experience is a must.\nLanguages: JavaScript, HTML/CSS, Shopify Liquid (70%) and Python, Dart (30%)\nFramework: Django\nExperience with Linux systems, Ansible, Nginx, uWSGI\nAsynchronous task handling: Celery and redis/rabbitmq\nDatabase: postgresql\nServices: Github/git, AWS (EC2, RDS, S3, Cloudfront, Route53)\nWe thank all applicants for their interest in The Organic Box, however only those selected for an interview will be contacted.\nBenefits:\nExtended health care\nRRSP Match\nVacation & paid time off\nLife insurance\nOn-site parking\nCompany events & social hours\nEmployee assistance programs\nCommuter benefits\nDiscounted/free food\nCompany pension\nDisability insurance\nCasual dress\nDental care\nWork from home opportunities\nJob Type: Full-time\nSchedule:\nMonday to Friday\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 5
    },
    {
        "title": "Software Developer (Python & Django)",
        "company_name": "Stantec",
        "application_link": "https://ca.indeed.com/rc/clk?jk=ef9ec62b17f41d64&fccid=f1582c464db8553b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer (Python & Django) - ( 230000A7 )\nDescription\nGrow with the best. Join a smart, creative, and inspired team that works behind the scenes to support operational excellence. Our functional services teams (FSTs) provide services to 22,000 employees in over 400 locations worldwide. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger.\nYour Opportunity\nWe are currently looking for a Software Developer to be focused primarily on developing Python & Django applications within our IT team.\nYour Key Responsibilities\nWrite well-designed, testable code following the coding standards\nRead and understand Java code and translate to Python & Django application\nParticipate in code reviews, document design and ability to identify areas for improvement and make recommendations\nIntegrate software components into a fully functional software system\nWork with team to develop software test plans and quality assurance procedures\nMaintenance of the existing application via enhancements and production defect support\nInteract with peers, help desk, and management personnel to resolve issues\nQualifications\nYour Capabilities and Credentials\nGreat interpersonal skills and team player\nExcellent problem solving and analytical skills\nDevelopment experience with Oracle and MS SQL Server\nFull stack development experience in Python, Django\nExperience with GIT\nSome experience in Agile methodologies and practices\nAutomated end-to-end test experience is highly valued\nWill be considered an asset:\nExperience of WebLogic/Fusion\nExperience using EJBs, Java Persistence API\nProven experience building web services and API\nEducation and Experience\nBachelor’s degree in Computing Science or equivalent required\n2 years of related work experience\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\nPrimary Location : Canada-Alberta-Edmonton\nOther Locations : Canada, Canada-Ontario-Toronto, Canada-Ontario-Markham\nOrganization : BC-1374 IT Services-Corporate-Canada\nEmployee Status : Regular\nJob Level : Individual Contributor\nTravel : No\nSchedule : Full-time\nJob Posting : Jan 20, 2023, 4:59:52 PM\nReq ID: 230000A7\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 6
    },
    {
        "title": "Software Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=3f9d65cdbe7adb6b&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nLooking to get your foot in the door at the most exciting technology firm in Edmonton? We’re searching for a Software Developer who values mastery, authenticity, and positivity to help build and grow our product. You'll get a chance to design, build, and improve on each part of our tech stack, with an initial emphasis on front end development. You’d work closely with members of the engineering, data science, product and sales teams in a collaborative environment to design and implement new products and features.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\nImproving our JavaScript platform\nLaunching new clients, including testing and troubleshooting installations\nBuilding the tools that millions of shoppers interact with daily\nParticipating in code reviews, sharing knowledge, feedback, and ideas\nLearning!\n\nABOUT YOU\nExperience with JavaScript, HTML and CSS\nUnderstanding of MVC and MVVM architectures\nUnderstanding of server-side web apps in any language\nBachelor’s degree in computer science, engineering, or equivalent degree / experience\nSomeone with a true engineering mindset, you build things to work and to last\nPassionate about finding elegant solutions to complex technical problems\nEager to work in an ever evolving code base and constantly strive to improve the domain\n\nBONUS EXPERIENCE\nSource control (Git) and familiarity with unix command line\nComfortable working in an Agile environment\nModern JS libraries and frameworks, such as jQuery, SASS, React, Gulp, Vue.js, WebPack, or others\nTag Management Systems such as Google Tag Manager, Tealium, Adobe Experience and Signal\nIntegrating with analytics packages such as Google Analytics and Omniture\nCloud Technologies such as Amazon Web Services\nRuby / Ruby on Rails, SQL, Redis, Python, Hadoop, and/or Spark\nUnderstanding of machine learning\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 7
    },
    {
        "title": "Software Developer 1 - Edmonton",
        "company_name": "Computronix",
        "application_link": "https://ca.indeed.com/rc/clk?jk=edc1141c9502db86&fccid=eb819c9dd1c4141b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Our low turnover rate, challenging work, great client relationships, and teamwork create a high morale environment with plenty of opportunities to innovate, grow in your career, and never get bored! Work/life balance is something we are really committed to, not something we just talk about. We believe you should love your work and your play.\nWe focus on database management built on an Oracle platform and are looking for full-time developers that want to innovate, collaborate, learn, develop, and find solutions to varying programming challenges.\nIn this role, you will...\nDevelop, test, and debug customized software for specific applications, using modern technologies such as Python, SQL, and PL/SQL.\nConfigure workflows within our proprietary software product.\nCode, test, and debug programs, with mentoring and guidance from senior IT staff.\nMaintain and document programs in accordance with company best-practice standards.\nProvide accurate project work estimates.\nDevelop solutions from detailed business and technical specifications.\nAssist with the preparation of software deployments.\nHave a desire for continuous growth and improvement.\nYou're perfect for this job if you have...\nDiploma or bachelor’s degree in computer science/software development.\nExperience working with SQL, Python, .NET, Oracle, and PL/SQL.\nBe familiar with normalization, database links, stored procedures, triggers, views, queries, and joins.\nExperience in relational database management/design, back-end software development\nAbility to write in English fluently.\nAbility to learn other coding languages as needed.\nYou will receive\nA competitive pay scale commensurate with your skills and expertise.\nAn opportunity to grow both personally and professionally through our CX Academy.\nA generous medical, dental, and vision benefits plan along with retirement plans.\nA commitment to corporate transparency with quarterly all-company meetings.\nThe opportunity to be a part of a company that makes it their mission to respect, trust, and serve our clients and each other.\nThe ability to work on a product that improves the lives of others.\nLearn more about us\nWebsite: https://www.computronix.com/\nGlassdoor: https://www.glassdoor.ca/Reviews/Computronix-Reviews-E315632.htm\nYouTube: https://www.youtube.com/c/ComputronixEdmonton\nFollow us on LinkedIn\nYbd3kbxa8G",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 8
    },
    {
        "title": "Machine Learning Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=a113cfa7ecf6b34d&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Machine Learning Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for an experienced Machine Learning Developer who values mastery, authenticity, and positivity to help build and grow our product. As an engineer, your strong foundation in productionizing machine learning models will be essential in making long lasting improvements to our product. If you are a highly technical, hands-on, and mission-driven engineer, who has a passion for solving problems in the area of recommendation, search and e-commerce optimization then this is the role for you.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES:\nResearch, design and prototype intelligent systems with the aim of enhancing online shopper experience.\nOversee research prototypes and develop them into fully-fledged AI software that are ready to be delivered to our clients.\nParticipate in active maintenance and code reviews in a large codebase, suggesting and implementing changes as appropriate.\nKeep up-to-date with the latest papers in artificial intelligence and machine learning to propose solutions for real problems in e-commerce.\nBuild infrastructure to support the evolution of our shopper interaction toolset.\nMentor other engineers, participate in code reviews, and share knowledge.\nTroubleshoot, test, and debug to your heart’s content.\n\nABOUT YOU:\nAt least 2 years of real-world experience implementing Machine Learning software.\nProficient in Python and/or C/C++, with an interest in learning new languages\nBSc (MSc or PhD preferred) in Computer Science, Machine Learning, Artificial Intelligence, Statistics, Mathematics, Engineering, Physics, or a related discipline, with (at minimum) graduate-level courses in machine learning, or equivalent practical experience.\nStrong research experience in machine learning, preferably in one or more of the following (in no particular order): reinforcement learning, natural language processing, recommendation and/or ranking systems, deep generative models, representation learning, AI interpretability, domain generalization, meta-learning, computer vision, deep neural network architectures.\nProficient in deep learning frameworks like Tensorflow, PyTorch, etc. and scientific computing packages like NumPy. Able to implement an algorithm as described in an academic paper using these frameworks in quality code.\nStrong computer science background, with experience in object-oriented programming, systems design, data structures and algorithms.\nFamiliarity with source control (Git) and Unix systems, including shell scripting.\nGood intuition for applying AI theory to make business-oriented products with minimal guidance.\nCommunicate to introduce honesty and clarity (avoiding buzzwords and jargon) to experts in multiple disciplines. Demonstrate a mature understanding of the current possibilities and limitations of AI research.\nCurious, constantly looking for better ways to build things and excited to learn about emerging technologies.\n\nBONUS EXPERIENCE:\nOnline advertising and/or marketing analytics, behavioural targeting and/or web analytics.\nWorking in an Agile software development environment.\nUsing cloud solutions, preferably AWS.\nDistributed and/or parallel programming.\nAn active GitHub repository.\n\nABOUT GRANIFY:\nYou’ll work closely with an incredible group of the smartest, most interesting, genuinely good people around. You’ll work hard, learn quickly, and have plenty of excitement. You’ll also get a first hand view into the rapidly evolving, exciting intersection of e-commerce, machine intelligence and psychology.\n\nWith our continued growth as a company, you’ll find limitless opportunities for growth, development, and career progression.\n\nDid you know? Granify is backed by early investors in Facebook, Uber, Twitter, Airbnb, Paypal, Pinterest, Palantir and Yelp. Wouldn’t it have been great to get in at one of those companies as they were taking off...",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 9
    },
    {
        "title": "HMI Developer",
        "company_name": "Dexcent Inc",
        "application_link": "https://ca.indeed.com/company/Dexcent/jobs/Hmi-Developer-ef61eec7c1abdbda?fccid=2106499f949cae92&vjs=3",
        "application_details": [
            "Full-time",
            "Permanent"
        ],
        "job_description": "We are looking for HMI Developers to join our growing team at Dexcent. If you are skilled with developing operating screens using AVEVA’s OASyS XE, VB.Net and enjoy assisting clients with SCADA system migrations/implementations, this could be the right career move for you!\nAbout Dexcent\nFounded in 2006, Dexcent Inc. (Dexcent) is an engineering consulting firm that provides a range of specialized solutions for clients in a variety of industries throughout the world. Our professionals have modernized IT and OT engineering methodologies into comprehensive solutions, specializing in information analytics, cyber-security, infrastructure, and control systems engineering. As such, we pride ourselves on truly transforming industrial operations to optimize business performance and deliver bottom-line results.\nAbout the Candidate\nOur ideal candidate has:\n3+ years of industrial graphics design experience\nExperienced in graphics design for icon and bitmap creation\nVB.NET language knowledge, both in writing and debugging\nWindows Forms .NET or Java Swing experience\nKnowledge of scripting languages such as PERL, C#, Python\nKnowledge of SQL database interaction\nDiploma or Bachelor’s degree in Computer Science, graphic design, or equivalent combination of education and experience\nCompetent with MS Office tools and MS Office 365\nThe following would be preferred skills and experience, but not required:\n3+ years of related SCADA experience, AVEVA’s OASyS preferred\nKnowledge of interactive tools (Teams, Sharepoint, Outlook, Slack, One Drive, Remote Desktop)\nTechnical writing/documentation talents (end-user documentation, reports, flow diagrams, as-built drawings, etc.)\nPowershell and Command Line skills\nKnowledge of Windows abilities (working with Services, Active Directory, File Structure permissions, and shares)\nAbout the Role\nThe HMI Developer creates custom High Performance user interfaces aligned with client specifications. They work collaboratively with the client and Dexcent team members to meet project scope and timelines.\nDesign and develop High Performance HMI displays for SCADA systems (OASyS)\nLiaise with clients to develop and improve HMI display specifications and design guides\nDesign, create and edit custom bitmaps/images to be used in High Performance Interfaces\nConduct testing and participate in all testing phases (FAT, SAT, CAT)\nReport on project testing progress and resolve or escalate issues promptly\nInvestigate, troubleshoot, and resolve issues with design/code\nMaintain appearance and back-end code of all interfaces to comply with defined standards\nMigrate displays from one SCADA system to another, following the client/project design guide\nPrepare and maintain documentation as per project requirements, Dexcent and client standards\nComply with all relevant change management procedures\nAt Dexcent we recognize that people are our most important asset. We appreciate the diverse experience, knowledge, creativity, and personality that each person brings to our organization, our culture, and our success. If this sounds like the right career opportunity for you, apply today!\nJob Types: Full-time, Permanent\nBenefits:\nCasual dress\nCompany events\nDental care\nDisability insurance\nEmployee assistance program\nExtended health care\nLife insurance\nPaid time off\nProfit sharing\nWellness program\nWork from home\nSchedule:\n8 hour shift\nMonday to Friday\nExperience:\nWindows Forms: 1 year (preferred)\nVB.Net: 1 year (preferred)\nHMI development: 3 years (preferred)\nWork Location: Hybrid remote in Edmonton, AB T5S 1K6",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 10
    },
    {
        "title": "Software Developer",
        "company_name": "Stantec",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1acc83bf469b2c34&fccid=f1582c464db8553b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer - ( 230000A5 )\nDescription\nGrow with the best. Join a smart, creative, and inspired team that works behind the scenes to support operational excellence. Our functional services teams (FSTs) provide services to 22,000 employees in over 400 locations worldwide. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger.\nYour Opportunity\nWe are currently looking for a Software Developer with strong experience developing windows applications to join our IT team within Stantec.\nYour Key Responsibilities\nUse interpersonal skills to positively contribute to team\nWrite well-designed, testable code following the coding standards\nParticipate in code reviews, document design\nIntegrate software components into a fully functional software system\nWork with team to develop software test plans and quality assurance procedures\nMaintenance of the existing application via enhancements and production defect support\nTroubleshoot and debug existing systems\nInteract with end users, peers, help desk, and management personnel to resolve issues\nQualifications\nYour Capabilities and Credentials\nExperience in C# .NET Framework 4.5 or higher\nDevelopment experience with MS SQL Server and T-SQL\nGreat communication, interpersonal skills and team player\nExcellent problem solving and analytical skills\nExperience in the following areas is preferred:\nSome exposure on Oracle database and PL SQL or PostgresSQL\nExperience of TypeScript and any modern JavaScript frameworks (Angular, React, Vue)\nExperience of Unit testing using NUnit or XUnit\nSome experience in Agile methodologies and practices\nExposure with Python, Angular, ASP .Net Core, .NET Core, and Docker is preferred\nAutomated end-to-end test experience is highly valued\nExperience of WinForms application\nEducation and Experience\nBachelor’s degree in Computing Science or equivalent required\n2 years of related work experience\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nPrimary Location : Canada-Ontario-Markham\nOther Locations : Canada-British Columbia-Victoria, Canada-Alberta-Calgary, Canada-British Columbia-Vancouver, Canada-Alberta-Edmonton, Canada-Ontario-Toronto\nOrganization : BC-1374 IT Services-Corporate-Canada\nEmployee Status : Regular\nJob Level : Individual Contributor\nTravel : No\nSchedule : Full-time\nJob Posting : Jan 20, 2023, 4:54:45 PM\nReq ID: 230000A5\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 11
    },
    {
        "title": "Senior Software Developer",
        "company_name": "The Organic Box",
        "application_link": "https://ca.indeed.com/company/FreshPath-Logistic-Solutions/jobs/Senior-Software-Developer-752b4735a59f8baa?fccid=186c88af11d1b1fa&vjs=3",
        "application_details": [
            "From $80,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Interested in accelerating your career with a growing company that’s committed to advancing Alberta’s local and organic food market? Together with our producers, partners, and members, our team makes up the heart and soul of our food family to bring the highest quality food to families throughout Alberta. The Organic Box is an equal opportunity employer, and has a diverse range of individuals who bring their own unique attributes to our team and make our company what it is! And we’re looking for a Senior Developer to help lead and mentor our growing team!\nPURPOSE OF THIS POSITION:\nAs a Senior developer, you will assist with a wide variety of tasks including design, front-end and back-end development, and general support/ maintenance of Shopify plus projects. It’s a very dynamic role for the right candidate.\nPlease Note, this role does accommodate working remotely.\nRESPONSIBILITIES:\nSoftware architecture design and development\nApplication development experience with android devices\nDeploy changes to development servers frequently\nCreate and work with Django templates with compliant HTML5/CSS3\nModel and implement intricate data structures using relational databases, primarily PostgreSQL\nIdentify, prioritize and correct issues\nPlan, direct and implement new features and functionality\nCoordinate work across all our technology partners\nWrite complex Django apps following community development best practices\nImplement and maintain the use of common third-party APIs\nStay on top of the latest technologies\nHelp set up and run projects in production environments on Linux (Ubuntu-flavour) with Nginx, UWSGI, PostgreSQL, Celery, Redis and other tools frequently deployed alongside Django web apps\nHelp architect scalable solutions and performance-test applications to find and eliminate bot\nJOB QUALIFICATIONS/REQUIREMENTS:\nWhat you bring to the table:\n4+ years of web development experience\n2+ years experience with Shopify as a platform\nAWS setup, monitoring, and integration\nLanguages: JavaScript, HTML/CSS, Shopify Liquid (70%) and Python, Dart (30%)\nFramework: Django\nExperience with Linux systems, Ansible, Nginx, uWSGI\nAsynchronous task handling: Celery and redis/RabbitMQ\nDatabase: PostgreSQL\nServices: GitHub/git, AWS (EC2, RDS, S3, CloudFront, Route53)\nExcellent English oral and written communication skills and interpersonal skills\nHighly organized, solution-driven with strong team collaboration\nDesire to work cooperatively with others on a team; the ability to demonstrate interest, skill, and success in working towards a common business goal.\nStrong problem solving and decision making skills\nWHAT WE OFFER:\nCompetitive Compensation\nExtended health care\nRRSP Match\nVacation & paid time off\nLife insurance\nOn-site parking\nEmployee assistance programs\nCommuter benefits\nDiscounted/free food\nDental care\nWork from home opportunities\nWe thank all applicants for their interest in The Organic Box, however only those selected for an interview will be contacted.\nJob Type: Full-time\nSalary: From $80,000.00 per year\nFlexible Language Requirement:\nFrench not required\nSchedule:\nMonday to Friday\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 12
    },
    {
        "title": "Web Analyst / Developer",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1cb2bac06e1f5914&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract",
            "Remote"
        ],
        "job_description": "Description\nOur Client is looking for an experienced Systems Analyst to support multiple projects. The successful candidate will be responsible for supporting the existing code base, providing operational support, and developing enhancements to the system. The resource be a fast learner with an aptitude for understanding and maintaining complex systems\n\n\nSkills\n.NET, SQL, API, Agile\n\nType\nContract\n\nExperience Required/Mandatory Skills\nCompletion of a 4-year Computer Science or Engineering degree, or a 2-year Computer Engineering/System Technology diploma.\nFive (5) years of professional experience in application analysis, design, development, and optimization.\nFour (4) years of experience working with web front end languages, IE Javascript/Typescript, HTML, CSS, and at least one popular JS framework (React, Angular, Vue).\nFour (4) years of experience working with web back end object oriented languages such as Python, .NET, nodeJS, Java, etc.\nFour (4) years of experience working with SQL and/or NoSQL databases.\nDemonstrated experience building performant web APIs and a delightful UX.\nStrong communication skills. The ability to explain complex technical issues to both your peers and your stakeholders.\n\n\nNice To Have Skills\nExperience with Agile product delivery.\nExperience with cloud hosting providers (eg. Azure, AWS).\nExperience working with CI/CD Pipelines.\nExperience with TDD methodologies a plus.\n\n\nLocation\nEdmonton/Remote\n\nWork Environment\n6 months with optional extensions\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 13
    },
    {
        "title": "Data Visualization Developer",
        "company_name": "Fusion Analytics",
        "application_link": "https://ca.indeed.com/company/Fusion-Retail-Analytics/jobs/Data-Visualization-Developer-7f2b2301b30adede?fccid=6b1e25fdd1b8883a&vjs=3",
        "application_details": [
            "$80,000 a year",
            "Full-time"
        ],
        "job_description": "Apply directly for this position at: https://form.jotform.com/fusionretailanalytics/data-visualization-developer\nAbout Fusion Analytics\nOur vision is to build the world’s best decision-making platform. For over 13 years, we have been helping Canada’s largest retail organizations make better decisions by consolidating complex data and insights into compelling stories. With our ability to generate unique perspectives and drive clear actions, Fusion is the secret weapon for our clients. With our analytics products firmly in place, we are looking to expand our online data portal to enhance how we distribute these insights to our clients. To make this vision happen we are looking for extraordinarily intelligent people to join us. We love what we do and know you will too. Our values are to hire the best, make something we are proud of, celebrate success together and give back to our community.\nWhat You Will Do in This Role:\nWork closely with our Data Science teams to understand and interpret the various data products, metrics, and frameworks that the teams are producing\nWork closely with our Client Strategy teams to understand and design how those data products and stories are used and consumed by Fusion’s end clients\nDefine our analytics product designs, workflows, and to vet technical feasibility to bridge the gap between end customer needs and design development\nBased on the above, design and build graphics, reports and dashboards that serve both internal and external client needs (primarily using JavaScript) on Fusion’s online analytics / BI portal (powered by YellowFin)\nMaintain report and dashboard fidelity by performing quality control procedures\nWork as part of the team to solve issues and bugs with timely and creative solutions\nThinking beyond immediate issues and identify potential underlying bottlenecks and opportunities to improve within our existing workflows and processes\nWork as part of the team to create and manage data and table structures to enable optimal dashboard and display performance\nOpportunity to work and learn as part of the wider Data Visualization team to help develop both front-end and back-end data portal infrastructure\nRequirements for This Role:\nAn undergraduate degree (bonus in a quantitative discipline but not required)\n1+ years of relevant work experience\nStrong sense of curiosity, with demonstrated critical and analytical thinking\nCreative problem-solver who rises to any challenge\nPassionate about doing excellent work\nDetail oriented individual who holds their work to the highest standards\nExperience performing analysis on large data sets (bonus if business-related contexts)\nExperience working with YellowFin (preferred), Tableau, PowerBI, Domo or other BI tools\nExperience in UI/UX design\nExperience in JavaScript, particularly familiarity with Plotly library preferred\nProficiency in front-end HTML and CSS development preferred\nExperience with R, Python, SQL preferred\nCompensation\n$80,000+\nHiring and retaining the best people is very important to us. Accelerated promotions and compensation adjustments are available for high performers.\nStart Date\nFlexible (within the next 3 months)\nApplication Deadline\nFriday, February 10, 2023\nHow to Apply\nMust apply at: https://www.fusionanalytics.com/careers.html\nApply with a PDF copy of your resume and undergraduate transcript\nPlease name all files ((applicant name)) - ((document)) for example John Doe - Transcript.pdf.\nYour resume should highlight the following: your education, applicable experience to this role, and past projects, demos or portfolios you may wish to showcase.\nFusion is an equal opportunity employer. Accommodations will be made upon request. We value the safety of each member of our community.\nJob Type: Full-time\nSalary: $80,000.00 per year\nBenefits:\nCasual dress\nCompany events\nDental care\nExtended health care\nLife insurance\nPaid time off\nVision care\nSchedule:\nMonday to Friday\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 14
    },
    {
        "title": "Senior Software Solutions Developer",
        "company_name": "Enbridge",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DXkh61CBKLAbWGthCj1ez4QfJvZu0_FGYLh-4zLvFOdTUcajp-3BY_W7IEARQAFza4dDwCeerjfXQPxoQtuJ6aMjjk9rB_Nl1X_0DDDPBUkNTXXpOUsDjZwWH4BkBnRgYEyEyOcFeaHGhlboJyGD0Wztz1KEk6thiaxwOlsOgyuZetznCBZSE5TghF3ExDyedakgUIUzOhR1qix1rMMKgRAdgNo4RWRwlF9HHFHqjkcd84QyDigDOHsCwc09liLlHSCfFqmnKvnuwTYIk1naIelAUaXsG_ZPCdw-iAoKjg5d2DxsN56x4jcZYEncq4BKjsL2GLAc56lJGX1wg7HMfNPgONwUIUpmtgXTLRlKaB2xeAAJjIt9GyAHSUjqwYUJ71A5g23WxcOc5_PgvSpENIQOewI2B_iAbi9g0o9rdpcq6-5EZfFkaChEBT5UlsEFPGGaLZx1c6piNx2fdDRFaV8-Rzgu7uZSBWcMHPxxFMNXduXY2Hdzng5JAGEb3i-S6hFop1zAFhg_AHJTVP8t1uS5b7HW3G9hRWDABxPCT_CCSTBfIMi44JVz67-rMUuJGYlxwayE3QRQIPji_2Al1D6ZFGRTMZcVxXF0TVgNmjHRuBHoiYbaDs9FHflOEyrQU=&xkcb=SoA0-_M3TuK-Gyxe350LbzkdCdPP&p=0&fvj=0&vjs=3&tk=1gpe1cdtpk56s801&jsa=5369&oc=1&sal=0",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Posting End Date:\nFebruary 24, 2023\nEmployee Type:\nRegular-Full time\nUnion/Non:\nThis is a non-union position\nAre you someone who thrives in a fast-paced, innovative environment? If so, we are seeking a Senior Software Solutions Developer to develop and enhance Enbridge Liquids Pipeline (LP) Operational Technology (OT) systems in support of Control Centre Operations (CCO) and related business areas.\nWe are looking to add an individual to our diverse team who shares in our core values of safety, integrity, respect, and inclusion! In return, we offer opportunities to grow and increase your knowledge and skills, and an exciting career filled with a competitive benefits and pension package including generous time off.\nWhat You Will Do:\nPerform or participate in the research, design, development, risk assessment, and testing of new products and/or functional enhancements to existing products, and their implementation into the SCADA and/or Leak Detection systems in accordance with Enbridge policies, processes, and procedures.\nProvide technical support, troubleshooting, problem diagnosis, application testing, and configuration changes of custom-developed SCADA and Leak Detection software products.\nSupport SCADA Operations through the 24x7 call-out rotation during transition of Software Solutions projects, and any critical priority development support work.\nDemonstrate an understanding of software development best practices, standards, and operating procedures as applicable to mission critical, SCADA and Leak Detection software development.\nPerform code reviews on developers of all experience levels, with the ability to give and take constructive feedback.\nWho You Are:\nRelevant degree / diploma in Computer Science, Computer Engineering, or related discipline.\nMinimum of four continuous years of work experience.\nStrong industry expertise in C#, Python, and/or Java with an excellent track record of designing and implementing complex system software.\nWorking knowledge of Unix and/or Linux and Windows operating systems.\nSome knowledge and experience in SCADA, communication protocols, PLC/RTU/DCS data driver development and both historical and real-time data access methodologies.\nStrong analytical, communications, and problems solving skills.\nSound organizational skills. Able to handle multiple tasks and multiple projects simultaneously in a fast-paced, priority-changing environment.\nWork Schedule:\nEnbridge provides competitive workplace programs that differentiate us and offer flexibility to our team members. Enbridge’s FlexWork (Hybrid Work Model) offers eligible employees the opportunity to work variable daily schedules with a flexible start and end time, to opt for a compressed workweek schedule, and the option to work from home on Wednesdays and Fridays. Role requirements determine your eligibility for each option or combination of options.\n#LI-Hybrid\n#joinourteam\n#topemployer\nDiversity and inclusion are important to us. Enbridge is an\nEqual Opportunity and Affirmative Action Employer\n. We are committed to providing employment opportunities to all qualified individuals, without regard to age, race, color, national or ethnic origin, religion, sex, sexual orientation, gender identity or expression, marital status, family status, veteran status, Indigenous/Native American status, or disability. Applicants with disabilities can request accessible formats, communication supports, or other accessibility assistance by contacting\ncareers@enbridge.com\n.\nInformation For Applicants:\nApplications can be submitted via our online recruiting system only.\nWe appreciate your interest in working with us; however, only those applicants selected for interviews will be contacted.\nFinal candidates for this position may be required to undergo a security screening, including a criminal records check.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 15
    },
    {
        "title": "Quantitative Software Developer",
        "company_name": "Recruiting From Scratch",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4e29dfeff789f608&fccid=09e02654c2f26bbd&vjs=3",
        "application_details": [
            "$200,000–$350,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Quantitative Software Developer\nOur client is a financial sciences company, combining data analysis, invention, and rigorous inquiry to help solve the toughest challenges in investment management, insurance technology, securities, private equity, and venture capital.\nTheir team of scientists, technologists, and academics looks beyond the traditional to develop creative solutions to some of the world’s most complex economic problems.\nThey are seeking outstanding technologists with advanced mathematical and statistical abilities to join our team. Equal parts code specialists and mathematical problem solvers, our quantitative software engineers bring together technical and analytical expertise to grapple with difficult computational and data-related problems directly and implement efficient and innovative solutions. Entailing a sophisticated knowledge of algorithms, statistics, and high-performance computing, this effort has attracted ACM programming competition finalists, Top Coder contenders, and other highly technical, competitive problem solvers.\nQuantitative software engineers are responsible for bringing our wealth of ideas to fruition by:\nDesigning and implementing trading strategies;\nBuilding the tools and engines that bring our platforms and models to life!\nRequirements Include:\nAt a minimum, a bachelor's degree in computer science, applied mathematics, or another technical field from a top university.\nStrong programming skills utilizing technologies such as numpy, scipy, or scikit learn.\nExperience with scientific computing and algorithm development.\nA background or interest in building large-scale, real-time, and distributed applications is desired.\nExperience developing high-performance, multi-threaded applications using several programming languages including C++.\nKnowledge of scripting languages such as Python.\nWhile we analyze the data-rich domain of finance, financial experience is not a requirement.\nYou will enjoy the following benefits:\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\nSalary: Base: $200-500k\nWho is Recruiting from Scratch:\n\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 16
    },
    {
        "title": "Full Stack Web Developer",
        "company_name": "Arcurve Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=065cbbf5e8d39f2d&fccid=2e61090d2aaf2b15&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Arcurve is one of North America’s leading full-service technology, advisory and software development companies. In 2006, we began with a belief that there was a better way to deliver professional services in the technology industry. Since then, we have completed more than 800 projects for clients ranging from start-ups to Fortune 500 companies. From our office in Calgary and hubs in Halifax, Houston and Vancouver we deliver exceptional results for our clients in a diverse range of industries including telecommunications, oil and gas, transportation, private equity, gaming, infrastructure, software, financial and hospitality.\n\nAt Arcurve, we believe that work should be an enjoyable experience, and that the best “aha” moments come through team learning and continuous motivation. We know the key to success is collaboration, and that you can’t put a value on accountable, transparent, and authentic interactions. We strive to deliver exceptional service while creating lasting relationships with our employees, our students, our clients, and our community.\n\nWe’re looking for an authentic, collaborative, accountable and skilled Full Stack Web Developer to join the Arcurve team.\n\nYOU ARE\nPassionate about technology\nAn authentic and creative human\nDriven to succeed\nA believer in the importance of teamwork\nCommunity-minded\nAn expert problem solver\nSomeone who thrives on challenge\nMotivated by exceptional results\nSomeone who cares about your clients\nTHE GOAL\n\nTo deliver best in class JavaScript, CSS, HTML5, ASP.NET MVC code across a broad array of interactive web applications with a strong eye to create a rich user experience for our clients.\n\nTHE RESPONSIBILITIES\n\nDesign, develop and implement business functionality into web based solutions\nIdentify performance improvement areas for clients, present recommendations and perform rapid mock ups that you can translate into front-end code\nUse your familiarity with API creation and RESTful services along with your solid foundation in data structures, algorithms and system design to develop modern responsive web sites that work across multiple browsers and platforms\nCollaborate with our multidisciplinary client services team and manage your time across multiple projects in a results driven environment\nReact to shifting priorities in a productive manner with a client services focus\nTHE REQUIREMENTS\n\nPrevious experience as a Full Stack Web Developer in a client-facing role\nExperience integrating front end and back end aspects of web application while considering issues such as scalability and security (C#. .NET, PHP, Python, Ruby, JavaScript, tooling including React, Angular, Node, SQL and Azure)\nCollaborative team player\nTHE PERKS\nA fun work atmosphere that values equity, diversity and inclusion\nCompetitive salary plus flexible health & wellness benefits\nHybrid work environment and flexible scheduling\nContract or permanent employment agreements – your choice!\nA convenient, central location in Calgary but open to remote from anywhere in Canada\nCheck out this video from Charlotte to learn more about what it’s like to work as a Full Stack Web Developer at Arcurve.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 17
    },
    {
        "title": "Senior Software Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fed6effb04dc492a&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Senior Software Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for a Senior Software Developer who values mastery, authenticity, and positivity to help build and grow our product. While focusing on backend development, with our small, agile team you'll get a chance to design, build, and improve each part of our tech stack, while providing guidance and technical direction.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\n\nImproving our backend infrastructure\nExpanding the capabilities of our system\nEvolve our core platform including our data collection and decision engine, which collects and processes terabytes of shopper behavioral data of tens of millions of online shoppers each month.\nHelp shape the architecture and infrastructure decisions and operations that drive our applications and allows batch and streaming data pipelines that move data around our ecosystem as we continue to scale.\nBuild infrastructure to support the evolution of our shopper interaction toolset.\nMentor other engineers, participate in code reviews, and share knowledge.\n\nABOUT YOU\nExperience building distributed and scalable client-server architectures.\nUnderstanding of scalable client-server architectures.\nStrong SQL experience and experience with ETL methodologies\nExperience with enterprise server-side web apps\nBachelor's degree in computer science, engineering, or equivalent degree / experience.\nSource control (Git) and familiarity with Unix command line\nExperience with championing Agile principles within a dev team\nPassionate about mentoring junior engineers\nTeam-focused and people-centric, able to give feedback as well as receive it.\nCurious, constantly looking for better ways to build things and excited to learn about emerging technologies.\n\nBONUS\niOS and Android app or library development experience (ideally in Swift and Kotlin)\nIntegrating with analytics packages such as Google Analytics and Omniture\nCloud Technologies such as Amazon Web Services\nRuby / Ruby on Rails, SQL, Redis, Python, Hadoop, and/or Spark\nUnderstanding of machine learning\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 18
    },
    {
        "title": "Mobile Software Developer",
        "company_name": "Drivewyze",
        "application_link": "https://ca.indeed.com/rc/clk?jk=be3eef73f3cf8c3f&fccid=517d18bf98b63690&vjs=3",
        "application_details": [],
        "job_description": "Kick your career into high gear at Drivewyze!\n\nwho we are:\nWe are an innovative technology service provider to the transportation industry across North America. Drivewyze disrupting the commercial trucking industry by delivering unsurpassed time-saving and cost-effective technology solutions to commercial vehicle operators and carriers throughout the United States and Canada. We are on a mission to revolutionize highway safety and efficiency and we are looking for great talent to be part of our success story!\n\nWho you are:\nYou love working with a broad scope of technologies and platforms and crave to apply your skills towards something that will have real-world impact. You find fulfilment in solving for the big picture. “What will this platform/app need to do in five years” is a key part of your though process. You’re at the top of your game when you are supporting apps at a scaling capacity, being involved in all parts of the lifecycle, continuously building on, improving, and expanding our platforms. Your depth of experience in different environments allows you to easily break down complex tech/business/ system problems and transform into maintainable solutions.\n\nWhat you'll be doing\nYour mission will be to create and enhance Drivewyze applications to meet the needs of our customers as part of a talented team of Software Developers, QA, Product Managers, and other internal partners.\n\nAs a Mobile Developer, you will help lead the design and development of projects targeting mobile devices, as well as building on and expanding the Drivewyze platform. You will also be working on initiatives that directly impact/serve the mobile application. These include the development of back-end services (APIs), continuous integration and deployment (CI/CD), portal applications, monitoring, security improvements and architectural changes.\n\nReporting to: Software Development Manager\nLocation: Head Office, Edmonton, Alberta (open to remote within Canada)\n\nKey responsibilities include, but not limited to:\nWork with various internal stakeholders (product owner + UX) to identify and refine user stories that meet business requirements as part of a scrum team\nWorking with a broad scope of technologies and platforms to develop and maintain various native mobile applications written for Android and/or iOS, back-end APIs that directly serve the mobile applications, and CI/CD pipeline. This includes development using Flutter and/or ReactNative, Rx, Combine (iOS) and/or Coroutines (Android) and Python-based framework Django.\nConduct acceptance-testing monitoring of field exceptions and/or logs.\nContribute to and guide the technical roadmap and solutions as a Developer scum team.\n**A note about \"Job Requirements\"\nWe value great talent that comes from a variety of workplace experiences and backgrounds. A better future depends on diverse perspectives at the table. Not sure if you meet all requirements? Consider applying anyways - we would love to hear from you!\n\nJob requirements:\n5 years previous experience in software development, with a focus on mobile and cross-platform development using Flutter and/or ReactNative.\nPrevious experience concurrent programming experience using Rx, Combine (iOS), and/or Coroutines (Android) combined with backend development experience with a Python-based framework (preferably Django)\nPrevious experience with CI/CD pipelines to build and deploy apps (plus points for experience with Fastlane and Firebase App Distribution) and working with embedded user analytics tools (e.g. Segment, MixPanel, etc.)\nAs a member of our team, you will enjoy:\nOpen vacation program with unlimited vacation days.\nInclusive, collaborative culture.\nComprehensive compensation including benefits and employee stock options\nWorking alongside brilliant and humble tech talent\nMaking your mark – creating software solutions that have never been seen in our industry!\nEmployee recognition & employee referral programs\nSocial initiatives onsite and virtual - pickle ball, basketball, ping pong, foosball, darts, you name your game!\nOrganized fun time – debate a book in the book club, go for a jog with the running club or join in a lunchtime game of soccer, baseball, hockey, even golf!\nWork with us because you believe in what we do.\nAlthough technically, we have been in business for almost 20 years, we are proud to have maintained a start-up feel with each team member acting like owners modeling our values:\nCreate Exceptional Experiences. Think like a customer, colleague, partner, and stakeholder. Strive to go above and beyond and have a positive impact on others.\nDrive to Succeed. Be purposeful and accountable. Persevere through challenges and seek ways to enable success. Operate with speed, agility, and excellence.\nEmpower and Lead. Take the initiative and be proactive. Identify problems quickly and help tackle them. Have a voice, share ideas and give constructive feedback. Encourage others to do the same.\nDisrupt Creatively. Be curious, explore ideas without bias, and fearlessly try new thing. Foster innovation with a diversity of thought. Merit ideas, not titles, and learn from failure.\nCultivate Relationships. Build credibility and influence with integrity, honesty, and commitment. Seek win-win outcomes and lead with transparency and high ethical standards.\nRaise the Bar. Continually improve and grow. Build for the future, develop capability, and help others to learn. Take risks and aim high. Don’t iterate when you can change the game.\nPlay as a Team. Navigate with genuine care, respect, and inclusiveness. Create momentum through timesaving, pushing collaborative partnerships. Celebrate successes and have fun.\nOur Journey and Culture\nAs an organization, our innovative and collaborative culture is woven into the fabric of our DNA and seen through our interactions with one another. Our teams work together to solve problems that have a real-world impact, with all voices being heard at the table, and we believe respectful and inclusive idea-sharing is fundamental to our ability to continue to push into uncharted territories. Our roots are deep with almost 20 years of cultivating relationships and expertise, and our footprint across North America is a testimony of our ability to disrupt the industry and change the game. Our incredible journey has been built with teamwork, creativity, and humbly brilliant people ready and willing to explore new possibilities together.\n\nDrivewyze is an equal opportunity employer. All qualified applicants will be considered for employment regardless of race, color, religion, sex, national origin, disability, or protected veteran status.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 19
    },
    {
        "title": "Job No. 22 – Developer/Software Engineer",
        "company_name": "Invenit Engineering Inc.",
        "application_link": "https://ca.indeed.com/company/Invenit-Engineering-Inc./jobs/No-Developer-Software-Engineer-dcd9d3e2adafa186?fccid=e1ec119ec41701ad&vjs=3",
        "application_details": [
            "$50,000–$90,000 a year",
            "Full-time"
        ],
        "job_description": "The ideal candidate will have a passion for building world-class software and a track record of success creating highly scalable software systems. You will need strong software development skills, excellent interpersonal communication, and can quickly iterate through versions of software to optimize solutions.\nEducation and Experience\nB. Sc. or M.Sc. in Computing Science or Engineering disciplinesOr equivalent experience and evidence of exceptional ability.\n3-5 years of relevant experience\nAPEGA Membership (if applicable)\nRequirements\nMust have:\nFull-stack and Desktop Developer\nExperience in .NET Framework, package management, and dependency injection\nGood unit testing and integration testing practices\nExperience in Software Architecture\nExperience with Visual Studio development in .NET\nFluent in GIT source code control (experience with GitLab preferred)\nBasic understanding of mechanical concepts\nExcellent interpersonal communication skills\nFamiliarity with embedded systems\nOwning assignments and taking full accountability for overall team success\nFull-stack and Desktop Developer\nExperience in .NET Framework, package management, and dependency injection\nGood unit testing and integration testing practices\nExperience in Software Architecture\nExperience with Visual Studio development in .NET\nFluent in GIT source code control (experience with GitLab preferred)\nBasic understanding of mechanical concepts\nExcellent interpersonal communication skills\nFamiliarity with embedded systems\nOwning assignments and taking full accountability for overall team success\nNice to have:\nDatabase experience (MySQL, SQL Server) and good knowledge in query optimization\n.NET Core Blazor, angular, python\nPCB design and Firmware / embedded system development\nResponsibilities\nDevelopment of data processing/display and customer interface software, custom UI component creation\nAssist with development of firmware to collect and store data from embedded sensors\nCreate documentation and product training materials\nPromote software engineering best practices via code reviews, building tools and documentation\nLeverage your existing skills while learning and implementing new, open-source technologies as the company grows\nJob Type: Full-time\nSalary: $50,000.00-$90,000.00 per year\nBenefits:\nDental care\nDisability insurance\nExtended health care\nLife insurance\nOn-site parking\nPaid time off\nProfit sharing\nVision care\nFlexible Language Requirement:\nFrench not required\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nEdmonton, AB T6E 5P3: reliably commute or plan to relocate before starting work (required)\nWork Location: Hybrid remote in Edmonton, AB T6E 5P3",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 20
    },
    {
        "title": "Senior Software Developer",
        "company_name": "HonestDoor",
        "application_link": "https://ca.indeed.com/company/HonestDoor/jobs/Senior-Software-Developer-4ad1cbb6ebeec6fb?fccid=2daec9aa4462d4b7&vjs=3",
        "application_details": [
            "$90,000–$140,000 a year",
            "Full-time",
            "Permanent"
        ],
        "job_description": "Summary\nHonestDoor.com is a VC backed real estate tech company disrupting Canadian real estate! We collect, clean, and display real estate data across Canada, and then apply machine learning methods to generate estimated home values. We build products for the real estate industry.\nWe are looking for an experienced software developer to help us continue building our platform (honestdoor.com). You’ll be part of the core team, planning and building out new features for honestdoor.com\nWho you are:\n· Maybe you are university educated, maybe you aren’t. We don’t care as long as you’re outstanding at problem-solving and analytical.\n· You are open to learning and feel confident that you can figure things out if you don’t know them.\n· You’re okay to work on your own but like being part of the team.\n· You have your own opinions (and express them respectfully).\n· You’ve had some experience working at a start-up and know that you will likely have to manage multiple tasks.\n· You’re comfortable wearing many hats and working in an environment where everyone pitches in to help when needed.\nSkills & Qualifications:\n· This is not an entry-level job. We’re looking for an experienced (5+ years) developer who wants to build and be part of a growing team.\n· Proven ability developing software using TypeScript.\n· Knowledge of web frameworks including React, NextJS and more.\n· Proficiency in cloud services including AWS (S3, Lambdas, ECS (Docker), API Gateway and AWS CDK)\n· Adept at working with databases such as MySQL, MongoDB, and PostgreSQL.\n· Proficient understanding of code versioning tools, such as Git\n· Understanding of npm packages & semantic versioning\n· Backend development experience with NodeJS & GraphQL.\n· Moderate experience with the ELK Stack (Elasticsearch, Logstash, Kibana)\nPeople with these additional qualifications are preferred:\n· You live in Edmonton (or surrounding area)\n· Some real estate experience\n· Experience with AWS Glue\n· Experience with Python, Spark\n· Experience with Monorepos\n· Experience with Github Actions\nJob Types: Full-time, Permanent\nSalary: $90,000.00-$140,000.00 per year\nSchedule:\nMonday to Friday\nWork Location: Hybrid remote in Edmonton, AB\nApplication deadline: 2023-02-03",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 21
    },
    {
        "title": "Fullstack Dev",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=e1b12c5bd930092f&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Description\nOur Client is seeking up to 17 Full Stack developers to join product teams for service innovation and digital transformation projects. Duties include leading technical discovery, collaborating with frontend designers, advising product owners, solution development and supporting ongoing documentation / maintenance / QA efforts.\n\nSkills\nJavascript, Python, C#, Laravel, Angular, React\n\nType\nContract\n\nExperience Required/Mandatory Skills\nExperience working as a Full Stack Developer in a cross-functional team delivering products/assignment deliverables.\nExperience working on production applications using modern application frameworks and frontend JavaScript frameworks with one or more of the following:\nPython/Django\nC#/ASP.NET core\nPHP/Laravel\nRuby on Rails\nExpressJS\nFrontend frameworks (Vue.js, Angular and/or React)\n\nNice To Have Skills\nExperience adapting to developing on unfamiliar technology stacks and contributing to projects with active codebases.\nExperience creating digital products using human-centred, service design and user research.\nExperience incrementally transforming existing legacy systems into modern digital services across multiple releases.\n\nLocation\nEdmonton\n\nWork Environment\n1 year with 1 possible 2-year extension\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 22
    },
    {
        "title": "Software Engineer",
        "company_name": "University of Alberta",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fac20f8727915379&fccid=09ac3ce4d9d271d1&vjs=3",
        "application_details": [
            "$54,702–$74,295 a year",
            "Cover letter",
            "Full-time"
        ],
        "job_description": "SCI Computing Science\nCompetition No. -\nS113945967D3\n\nPosting Date -\nJan 27, 2022\n\nClosing Date -\nWill remain open until filled.\n\n\nPosition Type -\nFull Time - Grant Funded\n\nSalary Range -\n$54,702 to $74,295 per year\n\nGrade -\n08\n\nHours -\n37.5\n\n\nThis competition is open to all applicants however internal candidates and applicants who were former employees of the University of Alberta in the past 18 months will be given priority consideration before external candidates. Please indicate your internal status using the \"Advertisement\" drop down menu when applying.\nThis one year plus a day position with the possibility of extension offers a comprehensive benefits package which can be viewed at: Faculty & Staff Benefits.\nThe Chatbot research team lead by Dr. Osmar R. Zaïane at the Alberta Machine Intelligence Institute at the University of Alberta is seeking a full-time software developer to join an exciting project in order to build an end-to-end AI open-ended chatbot system for the elderly. The project titled ANA (Automated Nursing Agent) will require implementing state-of-the-art natural language understanding (NLU), natural language generation (NLG), and rule-based systems to cater to specific tasks the chatbot system is targeting. The successful candidate will mainly work in collaboration with graduate students in the research team implementing and incorporating their algorithms within the chatbot. This project is funded by the Alberta Machine Intelligence Institute (AMII). Our lab has a track record of publishing multiple papers at reputed NLP conferences like ACL, NAACL, and EMNLP.\nJob Description\nWe are looking for a talented and motivated software developer, willing to learn and preferably with an understanding of AI and chatbots to help us build an end-to-end AI chatbot system that will be released in production as a web server and an android application. The successful candidate will be responsible for implementing various machine learning and AI models for NLP response generation and general classification, integrating them in a web-server, and deploying them to production. We are using a Django web framework, MySQL database, python for server-side programming, and Pytorch for NLU and NLG models. Several AI models are needed to be integrated at the back-end that caters to different tasks like natural language understanding and generation, open-ended dialogue systems, and task-oriented rule-based systems. There is a need to efficiently and concurrently run these AI models during inference to improve the response time of the chatbot. Users will speak to the chatbot via a speech-to-text module or type questions, comments, and requests to the chatbot via the web interface. The ideal candidate will be passionate about artificial intelligence and system building and stay up-to-date with the latest developments in the field.\nDuties:\nWork with the research team to implement different AI models\nIntegrate different AI models together in the back-end\nImprove response time of chatbot system by implementing multiprocessing techniques at the back end\nImprove upon the existing web-interface by implementing user-centered design techniques\nWrite high quality, production code adhering to the principles of software design and development\nBuild a MySQL database on the server for storing the knowledge base and interactive sessions with users\nWrite tests and documentation for different components of the chatbot system and fix bugs wherever necessary\nImprove and optimize server-side processing of the application\nDeploy an application to production via Continuous integration and continuous deployment\nCommunicate about issues in the application with the research team\nQualifications:\nMinimum Bachelor’s Degree in Computer Science, Computer Engineering; Master’s Degree Preferred\nMust have experience with Python and Javascript. C++ is a bonus\nMust have experience with web-server frameworks like Django\nMust have experience with Linux servers, and MySQL and SparQL Databases\nMust have experience with Pytorch\nMust have knowledge of Machine learning and NLP concepts\nMust have knowledge of containarization (how to dockerize applications)\nExperience with Chatbots particularly with RASA is a plus\nExperience developing graphical user interfaces (GUI) preferred\nMust have experience with auxiliary development tools such as modern IDEs, code repositories, and Unix command line\nSalary: Will be commensurate with experience and based on a standard scale from the University of Alberta.\nPlease submit a cover letter, CV, and 2-5 references to chenyangh+programmer@ualberta.ca\nWe are looking for someone to start as soon as possible. The review of applications will continue until a suitable candidate is found.\nWe thank all applicants for their interest; however, only those individuals selected for an interview will be contacted.\nThe University of Alberta is committed to an equitable, diverse, and inclusive workforce. We welcome applications from all qualified persons. We encourage women; First Nations, Métis and Inuit persons; members of visible minority groups; persons with disabilities; persons of any sexual orientation or gender identity and expression; and all those who may contribute to the further diversification of ideas and the University to apply.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 23
    },
    {
        "title": "Intermediate Full Stack Developer",
        "company_name": "48Hour Discovery",
        "application_link": "https://ca.indeed.com/company/48Hour-Discovery/jobs/Intermediate-Full-Stack-Developer-b723ee0105ac8885?fccid=bdc3a61227558668&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Founded in 2017, 48Hour Discovery (48HD) is a Canadian biotechnology company with headquarters in Edmonton, AB and satellite sites in San Diego, California and Seoul, South Korea. The 48HD genetically-encoded platform technology offers rapid discovery of pharmaceutical leads in the peptide / macrocycle therapeutic space to major pharmaceutical companies (example: https://tinyurl.com/yyvv626v). We are seeking an entry level Full Stack Web Developer to become a contributor to our data and project management platform.\nAs the Full Stack Web Developer, your responsibilities include, but are not limited to, database development and maintenance, creation of data management, analytics and visualization applications, and maintenance of existing web applications.\nDuties & Responsibilities:\n● Design, develop and maintain user-friendly website\n● Confer with teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions\n● Direct input and feedback on user experience and design interactions, and help inform technical decisions\n● Build, test and deploy new features for modern web applications\n● Clear communication with stakeholders on expectations and timelines\n● Write clean and well documented code\n● Evaluate code to ensure it meets industry standards, is valid, is properly structured and is compatible with browsers, devices, or operating systems\n● Adhere to security policies to encrypt all data on electronic devices, such as laptops, desktops, and USB drives, to prevent unauthorized access, data loss or confidentiality breaches\n● Identify problems uncovered by testing or customer feedback and correct problems or refer problems to appropriate personnel for correction\nRequired Skills & Experience\nYou will need to be highly proficient with the following technologies and practices.\n● Hands-on full stack web development experience\n● Experience with Python web frameworks, such as Django and Flask\n● Proficiency with object oriented programming and design such as Python\n● Solid database skills in a relational database (MySQL)\n● Experience and in-depth knowledge with Linux-based development\n● Experience with AWS environment is a must\n● Experience using git for version control\n● Ability to balance competing priorities in a dynamic and fast-paced environment\n● Proficiency with fundamental front-end languages such as HTML, CSS, etc\n● Proficiency with JavaScript frameworks such as jQuery\n● Efficient written and verbal communication skills with the ability to present to a wide range of audiences\n● Excellent attention to detail, analytical and organizational skills\nJob Type: Full-time\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nEdmonton, AB: reliably commute or plan to relocate before starting work (required)\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 24
    },
    {
        "title": "Software QA Manager",
        "company_name": "Willowglen Systems Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=5d83c5dd3fcf3694&fccid=39acf37d544c82a2&vjs=3",
        "application_details": [],
        "job_description": "Location: Edmonton AB / Calgary AB\nOur Company\nWillowglen Systems is an innovative company delivering industrial automation solutions for the last 50 years. Our products are developed and supported by our team of developers, data scientists, mathematicians, and engineers. Willowglen Systems has a global customer base and is chiefly involved in the metro-rail, oil and gas, pipelines, electricity distribution, and water distribution sectors – in locations including North America, South America, Asia, and the Middle East.\nAt Willowglen Systems, we pride ourselves on our innovative solutions and the meaningful impact we have on mission-critical industries.\nAbout the Role\nWillowglen Systems is looking for a Software QA Manager to join our talented team. As a member of the Quality Assurance Team, the QA Manager is involved in aligning long-term solutions for testing/testability including road maps, tools, framework & approach. The QA Manager interacts with the software team to structure solutions that result in the solution being efficient and that can be easily tested. They take ownership of each product solution from a testing perspective and recommend best practices or adjustments to proposed product architecture while applying good engineering methodologies and practices.\nThe QA Manager will be responsible for contributing to the design of solutions and establishing testing parameters and methodology in delivering integrated enterprise SCADA solutions for Willowglen System clients implementing our SCADA product in key market segments such as MetroRail, Oil and Gas, Pipelines, and Power. The ideal candidate will have the ability to understand the customer perspective with respect to their operational business use-needs within their industrial technical system implementation environment.\nScope\nQA team management and administration\nTechnical lead for the QA team\nDeveloping and implementing the technical QA roadmap\nIncreasing testing efficiencies, developing processes and methodologies, and enhancing test processes to test web applications\nMentoring and assisting your colleagues\nEnsure processes and standards are followed\nHelp maintain a focus on producing high-quality products in an innovative culture. QA is a full partner in the software development process.\nKey Responsibilities\nTeam management including performance management, hiring, training and development, etc.\nCollaboration with project teams to align long term solutions for testing/testability including road maps, tools, framework and approach\nAnalyze and define testing processes to fill the gaps between current processes and industry-standard best practices\nProvide guidance, training, and mentoring to colleagues regarding the implementation of testing automation processes and best practices as needed\nDevelop automatic test tools and formulate KPIs to highlight automation\nDevelop and implement testing strategies for cybersecurity and machine learning applications\nPerform additional testing activities as required based on customer deliverables\nRequired Qualifications\nTeam management experience\n5+ years of experience using GitLab, Maven, Jenkins, Docker\n5+ years of experience working with automation tools and frameworks, such as Selenium, Cucumber, IntelliJ, Karate, Appium,\nExperience with developing test plans and tools for new software products\nBachelor's Degree and at least 5 years of experience in QA\nObject-oriented programming experience required.\nExperience in Java, Python, CSS, JavaScript, C++, PHP, etc.\nAdvanced knowledge of MySQL or similar\nExperience with bug tracking/workflow management tools (preferably JIRA)\nExperience in testing cyber security and machine learning applications is considered an asset\nAre you up for the challenge? Join Our Team https://www.youtube.com/watch?v=_JWHLsToaxE\nOur Mission\nWillowglen’s mission is to be a global leader in delivering visionary, customer-driven industrial automation solutions.\nOur Values\nRespectful - We take the time to listen and understand each other, and this fosters feelings of mutual trust, safety, camaraderie, and well-being.\nAgile - We are a customer-centric, responsive, and collaborative organization. We are quick to learn, adapt and respond to changing circumstances.\nInnovative - We value and support innovation thereby allowing people to be innovative. We are always striving to deliver superior solutions.\nOur Benefits\nExtended Health and Dental Benefits\nEmployee Assistance Program\nRRSP matching\nHealth Spending Account\nPaid Volunteering Time\nRemote/Hybrid work policy\nFlexible schedule options\nMonthly corporate lunches\nGreat Place to Work Certified\nOpportunities for training and career growth\nContinuing education and professional certification reimbursement\nOpen and inclusive work environment\nWillowglen Systems Inc. is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills, and experiences within our workforce. We thank all the applicants for their interest in this position; however, only those selected for an interview will be contacted by our recruitment team.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 25
    },
    {
        "title": "Intermediate.NET Developer",
        "company_name": "CGI",
        "application_link": "https://ca.indeed.com/rc/clk?jk=2cce5db24e859e12&fccid=43a69183767d4301&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "CGI is more than just an IT consulting company; we are a global organization offering a world of opportunities. Become part of an outstanding culture that gives you the freedom to innovate, influence decisions, achieve your full potential, and chart your own career. Our benefits include a share purchase program, profit sharing, wellness credits, training and development programs and flexible work schedules and locations.\n\nAre you motivated by the opportunity to delight your clients by providing them with innovative solutions to sophisticated technical problems? These are exciting times for CGI, and we are looking for hardworking individuals to innovate with us. If you thrive on innovation where you can influence the direction of technical strategy, come and join our team!\n\nThis is a fantastic opportunity to become a Member of our CGI-Edmonton team providing leading information technology services to our clients. We are seeking a .NET Developer with at least 3 years' experience in large enterprise environments.\n\nAs a .NET Developer, you'll have a combination of maintenance and development experience and be working with a diverse portfolio of technologies while contributing to several projects. As part of a larger team, you will work with and learn from our experienced and hardworking developers and architects and have numerous opportunities to leverage your expertise to become a key part of large client engagements.\n\nIf you are looking to advance your career while gaining experience in an exciting and diverse development environment, this is the opportunity you've been looking for!\nInsights you can act on\n\nWhile technology is at the heart of our clients’ digital transformation, we understand that people are at the heart of business success.\n\nWhen you join CGI, you become a trusted advisor, collaborating with colleagues and clients to bring forward actionable insights that deliver meaningful and sustainable outcomes. We call our employees \"members\" because they are CGI shareholders and owners and owners who enjoy working and growing together to build a company we are proud of. This has been our Dream since 1976, and it has brought us to where we are today — one of the world’s largest independent providers of IT and business consulting services.\n\nAt CGI, we recognize the richness that diversity brings. We strive to create a work culture where all belong and collaborate with clients in building more inclusive communities. As an equal-opportunity employer, we want to empower all our members to succeed and grow. If you require an accommodation at any point during the recruitment process, please let us know. We will be happy to assist.\n\nReady to become part of our success story? Join CGI — where your ideas and actions make a difference.\nYour future duties and responsibilities\nDesigning, estimating, coding and testing complex programs within an Enterprise Solution.\nPreparing detailed specifications for programs.\nInteracting with clients from all levels.\nParticipating in multiple assignments at the same time.\nDevelops and/or contributes to user manuals, training materials, etc.\nUpdating required documentation.\nExperience with various ticketing or workflow tools, like ServiceNow, JIRA, TFS, etc.\nRequired qualifications to be successful in this role\nA minimum of 3 to 5 years related IT experience in a role of .NET analyst.\nExperience in analysis, design and maintenance or development of application systems using the technologies described.\no Visual Studio 2017 and Visual Studio Data Tools.\no C#.NET, VB.NET, ASP.NET, .NET 4.5+\no Entity Framework.\no SQL (MSSQL & Transact SQL) 2005/2008R2, 2012R2\no Oracle RDBMS and tools 12c/g.\no SQL Server Management Studio.\no SQL Server Reporting Services (SSRS).\no Programming languages such as C#, PowerShell, JavaScript, and/or Python.\no Microsoft Enterprise Library.\no IIS (8.5, 10).\no Team Foundation Server 2013.\nExperience with enterprise relational databases.\nDeep experience of .NET and corresponding implementations using common software design patterns.\nUnit Testing.\nTest Driven Development and Continuous Integration techniques.\nGood interpersonal skills.\nGood verbal and written communication skills.\nThe ability to work under pressure with multiple priorities.\nThe ability to work in a team environment.\nThe ability to perform successfully under limited supervision.\nStrong problem solving and decision-making skills.\nOverall Information Technology industry experience.\nGovernment industry experience in a development or analyst role.\nDesirable Qualifications:\nWeb Service experience such as SOAP-XML, REST-JSON.\nArcGIS Enterprise, ArcGIS Pro.\nCold Fusion (2021).\nOracle Exadata.\nMS Power BI\nOWASP Security Testing.\nMS Office 2003/2007/2010.\nXML.\nITIL certification.\nRequired Level of Education:\nThe ideal candidate should possess a university degree or college diploma in Computer Science.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 26
    },
    {
        "title": "GIS Full stack developer",
        "company_name": "Fujitsu",
        "application_link": "https://ca.indeed.com/rc/clk?jk=17df0485402a2651&fccid=0d771a787e6e10bd&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "As a leader in digital transformation and a pioneer in innovation, Fujitsu Canada offers a complete portfolio of IT services to support our customers in their journey to create value, improve their customer experience or increase operational efficiency, including helping them on their journey to cloud computing. At Fujitsu, you are part of our family and culture. We offer you:\n\nLocal, personalized career support with the kind of advancement opportunities and projects that only a global company can provide\nA training program tailored to your career plan and goals\nWork-life balance, because we believe that your success depends on balance\nThe opportunity to work remotely with distributed, multicultural teams working for some of our local customers, our North American remote delivery center or our internal projects\nRespect and equality: Fujitsu has been selected for the third year in a row by the Human Rights Campaign as one of the best companies to work for LGBTQ equity.\nFujitsu's organizational model includes several North American centers of excellence, including the Geomatics Center of Excellence (GCE). The latter covers all of Fujitsu's North American offices and carries out projects around the world, largely from Quebec. With more than 30 years of history, our GCE now has close to 100 geomatics specialists working exclusively on geomatics development projects, and we are still growing. For those interested, some opportunities even allow you to relocate at our expense, or to travel and experience other languages and cultures.\nThe following full-time, permanent position within CEG is open to any candidate located in Canada. Are you passionate about geomatics solutions? Are you willing to share your geomatics knowledge with other geomatics enthusiasts? Do you enjoy learning about new geomatics technologies? Do you envy people who have the opportunity to participate in different types of innovative geomatics projects? If so, then this position may be for you.\nHere, CEG is helping its client make several important transformations to achieve its goal of becoming \"the most efficient Class 1 railroad on the continent.\" Over the past sev\neral years, approximately 20 Fujitsu professionals have been actively involved in the development and implementation of several large-scale strategic geomatics projects.\nUnder the supervision of the Project Manager, the Full Stack GIS Developer designs and develops applications to support the business needs of various internal projects, in particular applications available in connected and disconnected mode.\nRequirements\nBachelor’s degree in computer science\n3-5 years of experience\nStrong expertise in JavaScript\nExperience in JavaScript frameworks such as Angular JS, React or Amber\nExperience in Server-side languages such as Python, Ruby, Java, PHP, or .Net\nKnowledge of SQL, Oracle, PostgreSQL\nKnowledge of Python\nFamiliarity with DevOps tools\nExperience in API Building and API integration\n#LI-KP1",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 27
    },
    {
        "title": "Data Quality & Integration Analyst",
        "company_name": "Effortless Admin Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fd0da5b55e4dad95&fccid=86324db8ad149a2f&vjs=3",
        "application_details": [
            "Cover letter",
            "Full-time",
            "Permanent"
        ],
        "job_description": "Data Quality & Integration Analyst\n\nEffortless Admin Profile\nEffortless Admin is Canada’s leading benefits administration software and service company. Our platform is fully web-based and provides employers an elegant way of managing employee benefits. We are an expanding organization looking for motivated individuals who want to be part of our growth trajectory.\n\nFull Time | On Site\nThe Data Quality & Integration Analyst position is a full-time permanent position with a competitive compensation and benefits package, based on-site in Edmonton, AB.\n\nThis Role Is Important\nThis role requires taking ownership of a large and diverse number of complex data integrations. The successful candidate will join a high-performing team of experts in a dynamic and growing company. This role offers crucial support to our internal developers, client service team, and a wide range of integrated partner platforms, including insurance carriers, specialty benefit providers, and HRIS/Payroll platforms.\n\nIdeal Candidates\nThe ideal candidates must: (1) love technology, (2) be keen to immerse themselves in the data and the details of our business and (3) enjoy working with others on proactive problem solving and solution building. Written and verbal communication skills are a must to ensure efficient issue resolution and because this role will necessarily support non-technical team members and partner representatives.\n\nWhat’s in it For You\nJoin a collaborative team with over a century of collective experience in data quality management and analysis\nWork in a leading technology company during its major growth phase\nSolve complicated and challenging data problems while learning from the best minds in employee benefits\nSupport a wide variety of clients and stakeholders across Canada\nBe part of ushering in the future of employee benefits technology\nA flexible company with personality and heart\nCompetitive compensation and robust benefits package\n\nJob Description | (Some of) What You’ll be Doing\nDeveloping transferable skills in data integration implementation and data quality analysis\nHaving customer facing conversations independently on a regular basis, and be able to articulate data quality nuances and issues to the customer so that the customer can understand the root cause and any resolution necessary\nTaking ownership of all integration tasks with employers and insurance carriers\nLearning new tools and technologies as Effortless Admin evolves its technology stack and adopts the latest methodologies and practices in the cloud\nCreating value for Effortless Admin’s customers by ensuring high quality, high trust data\nFurthering your abilities as a subject matter expert in employee benefits data\nWorking independently in completing data quality and data integration tasks\nContributing meaningfully to process improvements for the team\n\nApplicant Requirements\nEagerness to learn, a detail-oriented mindset\nExperience with the principles of data analysis and data quality\nAbility to query and manipulate relational databases with SQL\nEffective written and verbal communication skills\nA passion for creative and collaborative problem solving\nAbility to share data quality analysis results with customers (via Excel and other tools)\nAbility to adapt to changing technology and employee benefits environments\nPreferred Qualifications\nBachelor’s degree in a STEM or quantitative field, or equivalent technical experience\nExperience with value-based care models\nExperience in an agile environment\nAdvanced SQL skills or familiarity with other languages such as Python\nExperience using collaboration tools such as Asana and Jira\nExperience analyzing employee benefits data (claims and/or employee records)\n\nApply Now!\nWe welcome anyone eager to contribute to the best benefits administration solution in the industry. If this position interests you and you meet the above requirements, please submit your resume and cover letter to: careers@effortlessadmin.com.\n\nFor more information, please contact:\nMelanie Ross, Human Resources Advisor\nEffortless Admin\n#240, 4936 - 87 Street\nEdmonton, AB\nT6E 5W3\n1.780.920.5683",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 28
    },
    {
        "title": "#2023-D-0001 Software Developer - Edmonton",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/rc/clk?jk=984ccd9db34a3dec&fccid=fcb062bb2c1e5a23&vjs=3",
        "application_details": [],
        "job_description": "Please apply on Isarta.com\nhttps://isarta.com/jobs/?utm_source=IND&job=89429\n\nSoftware Developer\nLocation: Edmonton, AB\nWho we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you're watching, how you're watching, or whether you're in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\nINVIDI's world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\nThe goal of developing a unified video ad tech platform is a big one and the right Associate Software Developers-like you-flourish in INVIDI's creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI's developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\nAbout the role:\nAre you passionate about technology? Do you want to be part of the team that is revolutionizing TV advertising across millions of homes worldwide? If so, don't miss this opportunity to co-author software artifacts with technology experts that disrupt the advertising world by working on our industry-leading addressable advertisement solution.\nYou'll be contributing to INVIDI's SaaS solution that provides targeted advertising for online streaming platforms. In addition to this core service, you will help shape the technology powering INVIDI's overall monitoring solution that allows customers to gain insights into their campaigns.\nWe're agile, with a dedicated Scrum Master, whose only job is to make sure we have everything we need to keep focused on our tasks. We strive to choose the best tool for the job and we're looking for people who love to learn fast and get things done. We are supported by a great SRE team and prefer to use shared common tooling.\nKey Responsibilities:\nWe are a DevOps organization, so our core responsibility is the development and operation of the services making up INVIDI's SaaS platform.\nFull software development lifecycle\nDeployment and operation of services\nTeam on-call rotation required\nTroubleshoot incidents and implement adequate solutions to restore and maintain system function, supported by automated monitoring, incident managers and our support team.\nWriting and maintaining documentation\nActively participate in our Agile process, including sprint planning, backlog refinement, etc.\nActively participate in implementing continuous integration/delivery, static code analysis, and test automation.\nWork with our Talent Development Managers to build and follow a personalized skills development plan.\nYou will design, develop, deploy and operate backend services in Kotlin or Java that are scalable, durable and performant.\nYou will collaborate closely with peers and product owners in an autonomous, cross-functional team.\nYou will help other team members grow as engineers through code review, pairing, and mentoring.\nAs a part of the DevOps team, you will be on-call for the services that the team owns. You are on-call for one week, approximately once per month. While on call, you are required to be reachable by telephone and able to act upon alarm using your laptop.\nOur Requirements:\nBachelor's Degree in Computer Science or equivalent.\n5+ years of backend engineering experience\nYou are an outstanding Java/Kotlin developer who loves to develop distributed high-volume systems.\nYou care about the craft and cherish the opportunity to work with smart, supportive, and highly motivated colleagues.\nYou like to learn new things, mentor, and share knowledge with team members.\nDeep understanding of object-oriented design, data structures and analytics, and algorithms.\nDeep understanding and experience of working with database technologies such as PostgreSQL, TSQL, DynamoDB, Redis as well as Protocol Buffers.\nHighly preferred candidates also have\nWorking experience in an Agile environment: Scrum, Kanban\nIndustry knowledge of big data and distributed systems.\nExperience building RESTful web services.\nWorking experience in a DevOps environment.\nSoftware design and systems architecture experience.\nExperience with security in software development and architecture.\nExperience with the tools we use:\nInfrastructure as code: Terraform, Ansible\nAnsible\nSource control: Git, GitHub/BitBucket\nCI/CD: Jenkins, BitBucket Pipelines\nPub/Sub: Kafka, AWS Kinesis\nContainerization/Orchestration: Docker, Kubernetes, AWS ECS/EKS\nDeveloper security platforms: snyk, veracode\nObservability/Monitoring: Datadog, AWS CloudWatch, PagerDuty\nExperience building and deploying cloud-based software using AWS or GCP.\nCable or Satellite industry knowledge is a plus.\nExcellent oral and written communication skills.\nBuild tools such as Maven.\nContainerization with Docker and Kubernetes.\nDeveloping and deploying RESTful web services.\nCloud experience with GCP and AWS and their services.\nDeep understanding of:\nObject-oriented design, data structures, algorithms\nExperience writing code that adheres to a style guide.\nExperience performing peer code reviews to ensure code quality.\nStrong development skills in one or more of the following languages:\nJava/Kotlin (Highly preferred)\nPython\nBash\nGo\nJavaScript\nC#\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We're proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at via Isarta at least one week in advance of your interview.\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.\nReady to join our team? Apply today!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 29
    },
    {
        "title": "ETL Analyst / Developer",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=9a77282c4b80c057&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Description\nOur client requires an experienced and versatile Senior ETL Analyst / Developer to support a strategic Enterprise Resource Planning (ERP) program to replace its legacy Records Management System (RMS). Responsibilities will focus on development of a data pipeline to extract, load, and transform (ELT) legacy data from NicheRMS version 5 to NicheRMS UA. Additional responsibilities include cleansing of the legacy data and transformation of structured and unstructured data which has been customized in the legacy RMS.\nThe successful candidate must have prior experience developing a data pipeline to migrate data, including implementation planning and post-implementation support, with a strong track record of successful delivery working with minimal direction in an ambiguous environment.\nLocation is HYBRID. 1 day per week on site in Edmonton, Alberta.\n\n\nSkills\nETL, .NET\n\nType\nContract\n\nExperience Required/Mandatory Skills\nDegree in Information Technology, Management Information Systems, Computer Science or similar post-secondary education\n10+ Years of experience as a Data Engineer, Software Developer, and/or Database Administrator (DBA)\nExpert knowledge of data types, data objects, and Entity Relationship Diagrams\nExpert knowledge of SQL\nExperience developing data pipelines\nExperience with data migration, data transformation, and data cleansing of structured and unstructured data\nExcellent written and verbal communication skills\n\n\nNice To Have Skills\nExpert knowledge of programming and scripting languages such as C#, Java, Python, R, Ruby, and Scala\nKnowledge of data security is an asset\nExperience in large ERP implementations with a focus on records management and/or financial software\nExperience with NicheRMS is an asset\n\n\nLocation\nEdmonton\n\nWork Environment\n1 Year plus option years\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 30
    },
    {
        "title": "Talend API Developer",
        "company_name": "CGI",
        "application_link": "https://ca.indeed.com/rc/clk?jk=8611f20835313209&fccid=43a69183767d4301&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Ready to join an outstanding culture that cares about diversity and inclusion, and corporate social responsibility, with the freedom to innovate, influence decisions, and chart an exciting career? CGI is more than just an IT company; be part of a team that supports the local community with the ability to draw on global outstanding talent. Benefits include a share purchase program, profit sharing, wellness credits, training and development programs, and flexible work schedules and locations!\n\nCGI-Edmonton is experiencing strong client demand for data integration between clouds and on-premise. Specifically in the technology sector of data integration with Talend, there is an excellent opportunity for the candidate to contribute to the growth and take on responsibilities as a developer, analyst, or technical team leader.\nInsights you can act on\n\nWhile technology is at the heart of our clients’ digital transformation, we understand that people are at the heart of business success.\n\nWhen you join CGI, you become a trusted advisor, collaborating with colleagues and clients to bring forward actionable insights that deliver meaningful and sustainable outcomes. We call our employees \"members\" because they are CGI shareholders and owners and owners who enjoy working and growing together to build a company we are proud of. This has been our Dream since 1976, and it has brought us to where we are today — one of the world’s largest independent providers of IT and business consulting services.\n\nAt CGI, we recognize the richness that diversity brings. We strive to create a work culture where all belong and collaborate with clients in building more inclusive communities. As an equal-opportunity employer, we want to empower all our members to succeed and grow. If you require an accommodation at any point during the recruitment process, please let us know. We will be happy to assist.\n\nReady to become part of our success story? Join CGI — where your ideas and actions make a difference.\nYour future duties and responsibilities\nWith the Talend tool, develop and document robust Application Programming Interfaces (APIs)\nContribute expertise to support other team members in their delivery and evolution\nValidate the functional and technical specifications provided regarding data processing\nDiscover and solve data quality or data integration problems with thoroughness and creativity\nDefine and create integration and data pipeline processes to meet quality requirements\nPerform the design and integration of all the required components of a complete environment: scheduling, performance, history, etc.\nDesign and apply integrated testing and acceptance strategies\nOccasionally, write functional analyses\nDocument processes\nCollaborate in estimating operational and project efforts\nContribute to creating and applying the standards and procedures established by the team\nCarry out follow-ups with the Lead Project Manager\nRequired qualifications to be successful in this role\nCollege or university degree in computer science or related field\nLevels of expertise sought: intermediate (3 years and +) and senior (10 years and +)\n2+ years experience with Talend\nRelevant experience in the development and evolution of APIs\nWeb services such as REST-JSON and/or SOAP-XML\nKnowledge of SQL, JAVA, or Python\nSkills in performance optimization (tuning), both in the tool and the DBMS\nSuperb communication skills, both oral and written\nDesirable Skills:\nExperience working with cloud services (e.g. developing for Azure or AWS PaaS environments)\nAPI and backend services development using Java\nGitLab and GitHub\nApplication deployment automation using (Jenkins, GitHub Actions, and/or Azure DevOps)\nEducational Requirement\n\nBachelors Degree in Computer Science or Diploma in IT with equivalent IT experience\nTalend Professional Certification\n#LI-ST3",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 31
    },
    {
        "title": "#2022-D-0071 Software Development Lead",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/rc/clk?jk=ca41b44ffa48c053&fccid=fcb062bb2c1e5a23&vjs=3",
        "application_details": [],
        "job_description": "Who we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you’re watching, how you're watching, or whether you’re in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\n\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\n\nINVIDI’s world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\n\nThe goal of developing a unified video ad tech platform is a big one and the right developers-like you-flourish in INVIDI’s creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI’s developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\n\nThe Opportunity:\nWe are seeking a Senior Software Delivery Lead, who is responsible for providing technical leadership, vision, direction, and mentoring of the software development team. This individual will also be hands-on with technical development and design. This position is on the software development leadership track that is designed for someone who has deep and practical software development skills and career leadership aspirations.\n\nKey Responsibilities:\nDevelop strategies and implementation plans that support both short and long-term objectives of the company.\nLead the software development teams and initiatives to ensure delivery of high-quality software or Software-as-a-Service offerings that meets the customer's needs while incorporating best practices.\nContinually motivate strong engineering teams comprised of onsite and remote employees.\nActively participate in the overall technical product/solution design, delivery and ongoing production support.\nWork closely with the leaders of various INVDI departments and geographies to deliver against product and technical roadmaps as well as ensure strong operational strategic alignment.\nWork to constantly challenge and improve existing application platforms and processes\nFoster innovation and creativity.\nFacilitate decision-making, impediment resolution, and consensus among team members.\nParticipate, and lead as required, in departmental administrative oversight processes such as budget preparation and implementation, personnel supervision and performance management, value alignment, and other areas as required.\nDetermine and design application architecture.\nOur Requirements:\nBachelor’s Degree in Computer Science or related technical discipline or equivalent practical experience.\nHigh-caliber, energetic leader with 7 plus years’ experience, including extensive hands-on software engineering experience.\nExperience leading software development teams, managing priorities, setting expectations, and delivering on commitments.\nTrack record of leading high performance software development teams.\nExtensive experience with design and development of complex distributed systems.\n\nSkills and Qualifications:\nExcellent interpersonal skills and judgement.\nStrategic thinker that can also execute on tactics.\nPractical knowledge of agile methodology and DevOps.\nAbility to handle multiple tasks under tight deadlines in a fast-changing environment.\nProven ability to develop a deep understanding of software in assigned stacks, interactions between and across systems, and rapid assessment of business processes that affect technology solutions.\nSoftware development skills in Java, Kotlin, C++, C# or Python, database design, and experience with cloud technologies (AWS/GCP)\nGood understanding of Architectural principles in Software Development\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\n\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at HR@INVIDI.com at least one week in advance of your interview.\n\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 32
    },
    {
        "title": "Data Quality & Integration Analyst (FT)",
        "company_name": "Effortless Admin Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=dfed6636519bf8be&fccid=86324db8ad149a2f&vjs=3",
        "application_details": [
            "Cover letter",
            "Full-time"
        ],
        "job_description": "Data Quality & Integration Analyst\nEffortless Admin Profile:\nEffortless Admin is Canada’s leading benefits administration software and service company. Our platform is fully web-based and provides employers with an elegant way of managing employee benefits. We are an expanding organization looking for motivated individuals who want to be part of our growth trajectory.\nFull-Time, On-Site:\nThe Data Quality & Integration Analyst position is a full-time permanent position with a competitive compensation and benefits package, based on-site in Edmonton, AB.\nThis Role Is Important:\nThis role requires taking ownership of a large and diverse number of complex data integrations. The successful candidate will join a high-performing team of experts in a dynamic and growing company. This role offers crucial support to our internal developers, client service team, and a wide range of integrated partner platforms, including insurance carriers, specialty benefit providers, and HRIS/Payroll platforms.\nIdeal Candidates:\nThe ideal candidates must:\nMust love technology\nMust be keen to immerse themselves in the data and the details of our business\nMust enjoy working with others on proactive problem-solving and solution-building.\nWritten and verbal communication skills are a must to ensure efficient issue resolution and because this role will necessarily support non-technical team members and partner representatives.\n\nWhat’s in it For You:\nJoin a collaborative team with over a century of collective experience in data quality management and analysis\nWork in a leading technology company during its major growth phase\nSolve complicated and challenging data problems while learning from the best minds in employee benefits\nSupport a wide variety of clients and stakeholders across Canada\nBe part of ushering in the future of employee benefits technology\nA flexible company with personality and heart\nCompetitive compensation and robust benefits package\n\nJob Description | (Some of) What You’ll be Doing:\nDeveloping transferable skills in data integration implementation and data quality analysis\nHaving customer-facing conversations independently on a regular basis, and being able to articulate data quality nuances and issues to the customer so that the customer can understand the root cause and any resolution necessary\nTaking ownership of all integration tasks with employers and insurance carriers\nLearning new tools and technologies as Effortless Admin evolves its technology stack and adopts the latest methodologies and practices in the cloud\nCreating value for Effortless Admin’s customers by ensuring high-quality, high-trust data\nFurthering your abilities as a subject matter expert in employee benefits data\nWorking independently in completing data quality and data integration tasks\nContributing meaningfully to process improvements for the team\n\nApplicant Requirements:\nEagerness to learn, a detail-oriented mindset\nExperience with the principles of data analysis and data quality\nAbility to query and manipulate relational databases with SQL\nEffective written and verbal communication skills\nA passion for creative and collaborative problem solving\nAbility to share data quality analysis results with customers (via Excel and other tools)\nAbility to adapt to changing technology and employee benefits environments\n\nPreferred Qualifications:\nBachelor’s degree in a STEM or quantitative field, or equivalent technical experience\nExperience with value-based care models\nExperience in an agile environment\nAdvanced SQL skills or familiarity with other languages such as Python\nExperience using collaboration tools such as Asana and Jira\nExperience analyzing employee benefits data (claims and/or employee records)\n\nApply Now!\nWe welcome anyone eager to contribute to the best benefits administration solution in the industry. If this position interests you and you meet the above requirements, please submit your resume and cover letter to: careers@effortlessadmin.com.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 33
    },
    {
        "title": "Enterprise Application Software Developer - Optik TV",
        "company_name": "TELUS",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4bed66200d0bd7b1&fccid=1a93caa31afcad42&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Location: Edmonton, AB, CA Vancouver, British Columbia, CA Toronto, ON, CA Halifax, Nova Scotia, CA Calgary, AB, CA Regina, SK, CA Victoria, British Columbia, CA\nReq ID: 30143\nJobs by Category: Technology Solutions\nJob Function: Engineering & Development\nStatus: Full Time\nSchedule: Regular\nDescription\n\nReady to create innovative solutions and best practices?\n\nJoin our team\n\nAt TELUS we are shaping the future of video content delivery, developing consistent, reliable and high quality applications to support our quality entertainment services. Our goal is excellence, simplicity and reliability. We are constantly iterating, solving problems, and working together to maintain a best in class TV experience.\n\nHere’s the impact you’ll make and what we’ll accomplish together\n\nThe successful candidate will join the Content Management DevOps team, to play a key role as a developer and provide operational support for applications supporting various middlewares and platforms. In this position you will be challenged to bring an operational mindset to product development, and drive process improvements. Your insight will be critical to driving architecture and design decisions, for continued improvement of our in house developed application. We are a fast-paced job in an evolving environment, so flexibility, strong work ethic and ability to adapt will be the key to your success.\n\nHere's how\n\nPlay a key role as a developer, to support the continued development of our video provisioning application.\nCollaborate with architects, designers, business system analysts, application analysts, operation teams and testing specialists to deliver fully automated Application Lifecycle Management system\nDeploys, configures, manages, and performs ongoing maintenance of technical infrastructure including all DevOps tooling used by Application Services\nAssists the development team with the preparation of releases for production. This may include assisting in the automation of performance tests, validation of infrastructure requirements, and guiding the team with respect to system decisions.\nProvide superior technical consultation to members of Content Management Team as well as other TELUS business units, on complex and critical service troubles to manage the restoration of our application on a 24x7 basis.\n\nQualifications\n\nYou're the missing piece of the puzzle\n\nRequired knowledge and experience with the following:\n\nFull stack development experience with good object oriented programming experience. Must have experience with Java stack and JavaScript frameworks.\nExperience working with both relational and non-relational database management systems.\nExperience in creating and leveraging APIs, that are both in-house or 3rd party provided.\nExperience with popular DevOps tools such as Ansible, Puppet or Chef.\nHands-on familiarity with testing methodologies and quality control.\nAbility to translate business requirements into technical implementations.\nAble to work within an existing framework and improve it wherever it is required as well as code optimization where applicable.\nExperience with virtualization, storage and basic networking understanding.\nStrong Troubleshooting Methodology\nExcellent interpersonal skills, talented at developing and fostering positive relationships with other team members\nBachelors Computer Science or Computer/Electrical Engineering Degree\n\nGreat-to-haves\n\nAdditional experience with any of the following will be considered an asset:\n\nExperience with cloud-native tools and cloud environments (GCP, AWS, etc.)\nAdvanced virtualization experience with VMware, KVM, Xen, Hyper\nIntermediate level Windows/Linux admin\nC/C#, .NET Core, Python, PHP\nGit, TFS, or equivalent\nFFHJOBS",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 34
    },
    {
        "title": "Senior Data Scientist",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=3d7bb83a45d01c9c&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Senior Data Scientist\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for an experienced Senior Data Scientist (5+ years of experience) who values mastery, authenticity, and positivity to help build and grow our product. As a key member of our Data Science team, you will work with and analyze vast amounts of behaviour and transaction data, and design and implement algorithms which predict e-commerce shopper actions and needs. This includes - but goes well beyond - recommendations. This is an amazing opportunity to design algorithms which will be responsible for helping and influencing real shoppers across the world in real-time! We have access to and act on millions of shopper sessions per day. If you are a highly technical, hands-on, and mission-driven person who has a passion for solving problems in the area of ML/AI and e-commerce optimization, then this is the role for you.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\nDevelop new and improve existing ML models that guide our interactions with shoppers\nHelp design and create ML/AI based tools to interact with shoppers\nEvaluate performance statistics at an extremely detailed level and present insights and recommendations to teammates.\nAnalyze, interpret and use machine learning and data mining algorithms on the enormous amount of behavioural and transactional data\nRecommend new experiments supported by your findings and research\nDissect online stores’ shoppers data to identify opportunities to increase conversion, order value, lifetime value, and customer delight\nWrite code to implement your experiments\nWork closely with our developers and engineers to bring your new experiments to life\nSolve a wide variety of complex problems as they arise that will often require significant analysis of our data, research and deep thinking\nParticipate in brainstorming sessions with your teammates to determine opportunities for improvement and experiments\nResearch, design and prototype intelligent systems with the aim of enhancing online shopper experience.\nKeep up-to-date with the latest papers in artificial intelligence and machine learning to propose solutions for real problems in e-commerce.\nHelp to build infrastructure to support the evolution of our shopper interaction toolset\nCollaborate with other DS team members, mentor junior DS, participate in code reviews, and share knowledge.\nParticipate in active maintenance and code reviews in a large codebase, suggesting and implementing changes as appropriate.\nTroubleshoot, test, and debug to your heart’s content.\n\nABOUT YOU\nBSc (Msc/Phd preferred) in Computer Science, Machine Learning, Artificial Intelligence, Statistics, Mathematics, Engineering, Physics, or a related discipline, with (at minimum) graduate-level courses in machine learning, or equivalent practical experience.\nAt least 5+ years of real-world experience implementing Machine Learning models\nComfortable jumping into an existing ML modelling code base\nProficient in at least one programming language, preferably Python (focus on ML)\nDemonstrated ability to apply statistical or data mining techniques to solve real problems\nAbility to organize, interpret, and analyze large amounts of data\nAdvanced skills and experience in machine learning and data mining\nStrong research experience in machine learning, preferably in one or more of the following (in no particular order):\nUnsupervised and Supervised Learning\nReinforcement learning\nRecommender and/or ranking systems\nDeep learning and deep generative models\nComputer vision\nNLP\nIntimately familiarity with the DS workflow:\nData gathering and cleaning\nFeature engineering\nModel design, coding, hyperparameter tuning and validations\nProficient in deep learning frameworks like Tensorflow, PyTorch, etc. and scientific computing packages like NumPy. Able to implement an algorithm as described in an academic paper using these frameworks in quality code.\nKnowledge of various ML and statistical tools and libraries (e.g. TensorFlow, sciPy, R, and similar)\nGood intuition for applying ML/AI theory to make business-oriented products with minimal guidance.\n\nBONUS EXPERIENCE\nExperienced using shopper data\nWorked with ‘Big data’\nHands-on Knowledge of distributed computing frameworks (e.g. Spark, AWS, Flink)\nExperience in online advertising/marketing analytics, behavioral targeting or web analytics\nExperience with distributed databases\n\nOUR TECH STACK\nWe are using AWS cloud and the ML stack includes Python, TensorFlow, Spark, DataBricks and Hadoop. We have dedicated Data Engineers and Software Developers who provide support and tools needed for research and help with implementation of research outcomes.\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 35
    },
    {
        "title": "#2023-D-0002 Senior Software Developer",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/rc/clk?jk=5acf8ac640995371&fccid=fcb062bb2c1e5a23&vjs=3",
        "application_details": [],
        "job_description": "Senior Software Developer\nLocation: Edmonton, AB\n\nWho we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you’re watching, how you're watching, or whether you’re in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\n\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\n\nINVIDI’s world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\n\nThe goal of developing a unified video ad tech platform is a big one and the right Associate Software Developers-like you-flourish in INVIDI’s creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI’s developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\n\nAbout the role:\nAre you passionate about technology? Do you want to be part of the team that is revolutionizing TV advertising across millions of homes worldwide? If so, don't miss this opportunity to co-author software artifacts with technology experts that disrupt the advertising world by working on our industry-leading addressable advertisement solution.\n\nYou’ll be contributing to INVIDI’s SaaS solution that provides targeted advertising for online streaming platforms. In addition to this core service, you will help shape the technology powering INVIDI’s overall monitoring solution that allows customers to gain insights into their campaigns.\n\nWe’re agile, with a dedicated Scrum Master, whose only job is to make sure we have everything we need to keep focused on our tasks. We strive to choose the best tool for the job and we're looking for people who love to learn fast and get things done. We are supported by a great SRE team and prefer to use shared common tooling.\n\nKey Responsibilities:\nWe are a DevOps organization, so our core responsibility is the development and operation of the services making up INVIDI's SaaS platform.\nFull software development lifecycle\nDeployment and operation of services\nTeam on-call rotation required\nTroubleshoot incidents and implement adequate solutions to restore and maintain system function, supported by automated monitoring, incident managers and our support team.\nWriting and maintaining documentation\nActively participate in our Agile process, including sprint planning, backlog refinement, etc.\nActively participate in implementing continuous integration/delivery, static code analysis, and test automation.\nWork with our Talent Development Managers to build and follow a personalized skills development plan.\nYou will design, develop, deploy and operate backend services in Kotlin or Java that are scalable, durable and performant.\nYou will collaborate closely with peers and product owners in an autonomous, cross-functional team.\nYou will help other team members grow as engineers through code review, pairing, and mentoring.\nAs a part of the DevOps team, you will be on-call for the services that the team owns. You are on-call for one week, approximately once per month. While on call, you are required to be reachable by telephone and able to act upon alarm using your laptop.\n\nOur Requirements:\nBachelor's Degree in Computer Science or equivalent.\n5+ years of backend engineering experience\nYou are an outstanding Java/Kotlin developer who loves to develop distributed high-volume systems.\nYou care about the craft and cherish the opportunity to work with smart, supportive, and highly motivated colleagues.\nYou like to learn new things, mentor, and share knowledge with team members.\nDeep understanding of object-oriented design, data structures and analytics, and algorithms.\nDeep understanding and experience of working with database technologies such as PostgreSQL, TSQL, DynamoDB, Redis as well as Protocol Buffers.\n\nHighly preferred candidates also have\nWorking experience in an Agile environment: Scrum, Kanban\nIndustry knowledge of big data and distributed systems.\nExperience building RESTful web services.\nWorking experience in a DevOps environment.\nSoftware design and systems architecture experience.\nExperience with security in software development and architecture.\nExperience with the tools we use:\nInfrastructure as code: Terraform, Ansible\nAnsible\nSource control: Git, GitHub/BitBucket\nCI/CD: Jenkins, BitBucket Pipelines\nPub/Sub: Kafka, AWS Kinesis\nContainerization/Orchestration: Docker, Kubernetes, AWS ECS/EKS\nDeveloper security platforms: snyk, veracode\nObservability/Monitoring: Datadog, AWS CloudWatch, PagerDuty\nExperience building and deploying cloud-based software using AWS or GCP.\nCable or Satellite industry knowledge is a plus.\nExcellent oral and written communication skills.\nBuild tools such as Maven.\nContainerization with Docker and Kubernetes.\nDeveloping and deploying RESTful web services.\nCloud experience with GCP and AWS and their services.\nDeep understanding of:\nObject-oriented design, data structures, algorithms\nExperience writing code that adheres to a style guide.\nExperience performing peer code reviews to ensure code quality.\nStrong development skills in one or more of the following languages:\nJava/Kotlin (Highly preferred)\nPython\nBash\nGo\nJavaScript\nC#\n\n\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\n\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\n\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\n\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at HR@INVIDI.com at least one week in advance of your interview.\n\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.\n\nReady to join our team? Apply today!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 36
    },
    {
        "title": "Senior Software Engineer 3D",
        "company_name": "Recruiting From Scratch",
        "application_link": "https://ca.indeed.com/rc/clk?jk=2e411bd1aef32ee3&fccid=09e02654c2f26bbd&vjs=3",
        "application_details": [
            "$150,000–$200,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Who is Recruiting from Scratch:\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.\nIf you are a fit, the team will reach out to you about this role or any others that may be a fit for our clients.\nOur Client\nOur client is a stealth-mode metal 3D printing startup founded on the belief that transforming the way things are made is essential to making the world a better place. Their advanced technology stack lies at the intersection of hardware, software, and data science, creating the foundation for the world’s first fully autonomous and scalable manufacturing system. Their core team hails from several of the world’s most innovative companies such as SpaceX, Hyperloop, and Blue Origin, and they have secured significant funding from several of Silicon Valley’s top venture capital firms.\nWe are actively looking for a highly passionate and self-motivated individual that can excel in a dynamic work environment and will play a critical role in developing software for a variety of functions within our advanced metal 3D printing systems. XX. Ultimately, your solutions will enable the first production scale, high quality, and fully automated metal 3D printing factory. As a crucial member of the engineering team, you will be responsible for driving the pace of innovation, maximizing development speed, and maintain a standard of excellence within the entire engineering team.\nResponsibilities :\nDesign and develop the print preparation software pipeline for an advanced production-scale metal 3D printing system, including automating CAD import, geometry processing, slicing, and toolpath planning.\nWork with back-end software developers to architect the software interface to the metal 3D printing hardware layer.\nDevelop software required to implement production automation solutions in the front-end geometry processing pipeline.\nDevelop software to implement algorithms for geometry deformation, procedural geometry generation, and space-filling operations.\nWork with computational geometry engineers and simulation engineers to integrate physics-based and data-driven models into the software simulation pipeline.\nIntegrate 2D and 3D meshing techniques into the physical simulation software pipeline.\nDevelop, unit test, and deploy functional, scalable, robust, and maintainable software.\nBasic Qualifications:\n5+ years of professional experience in software development using C++, Rust, Java, Python, or similar.\n1+ years of experience developing software for geometry processing such as but not limited to visual effects, animation, video games, or graphics industries.\nAble to provide legal proof of identity and authorization to work in the United States, which applies to U.S. citizens and non-U.S. citizens alike.\nPreferred Skills and Experience:\nBS, MS or PhD in computer science, applied mathematics, or related field highly preferred.\nExperience interfacing with CAD and CAM software APIs.\nExperience with 2D and 3D meshing techniques.\nKnowledge of MATLAB.\nExperience with cloud computing.\nExperience with optimization techniques.\nCreative thinker able to apply first-principles reasoning to solve complex problems.\nExcellent verbal and written communication skills.\nLocation\nWe are now located in Hawthorne in a 20,000 square foot, state of the art facility featuring large open spaces for team collaboration, R&D, and production, as well as easy access to the 405, 105, and 110 freeways. Our facility is in the heart of LA’s vibrant emerging tech eco-system alongside many other high growth start-ups and enterprises.\nBenefits/Salary\nWe have an inclusive and diverse culture that values collaboration, learning, and making deliberate data-driven decisions.\nWe offer a competitive compensation package that includes significant equity in the company, as well as a full suite of additional benefits including premium health care (medical, dental, and vision) and life insurance, paid vacation, and holidays.\nOur work environment includes casual dress, flexible work hours, a fully stocked kitchenette, free parking, daily paid-for lunches, and regular catered team-building events.\nFreeform is an Equal Opportunity Employer that values diversity; employment with Freeform is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.\nBase salary: $150-200k",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 37
    },
    {
        "title": "Lead Software Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4093668606c68d06&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Lead Software Developer – Parallels Core Team\n\nPush the boundaries of tech. In your sweatpants.\n\nWe’re looking for an experienced Lead Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll prepare the design and architecture of components for the Parallels Desktop family of software, including the world’s best desktop virtualization solution, Parallels Desktop for Mac. You’ll be on the Core team, responsible for virtual processors, guest memory, and interrupt and time services.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nPrepare the design and architecture of components for the Parallels virtualization platform.\nResearch and apply innovative technologies for new features development.\nInvestigate sophisticated issues and virtualization platform maintenance.\nCoordinate cross-team implementation of complex features.\nSupport education for yourself and your teammates; proactively share knowledge.\nYOU:\n5+ years of experience with and deep knowledge of Virtualization technology, e.g., hypervisors and emulators.\n5+ years of experience in modern computer architectures, e.g., x86 and ARM.\n5+ years of experience with device emulation technology.\nIntermediate experience with low-level system programming, e.g., kernel modules and drivers for Windows, Linux, and MacOS.\nExperience and knowledge of Virtualization technology, e.g., hypervisors and emulators.\nHigh analytical, reverse engineering, and software profiling skills.\nKnowledge of JIRA and GIT tools.\nKnowledge of C and C++ programming languages.\nBasic knowledge of scripting, automation, and software testing.\nAbility and willingness to both learn and teach.\nThe following are not required, but definitely nice to have:\nKnowledge of Python.\nPrevious exposure to compilator, binary translator and JIT technology.\nFamiliarity with networking and client server software development.\nUS:\nParallels is an award-winning productivity solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 38
    },
    {
        "title": "Senior Software Engineer (Computational Geometry)",
        "company_name": "Recruiting From Scratch",
        "application_link": "https://ca.indeed.com/rc/clk?jk=eb7b4aa6c32da3f0&fccid=09e02654c2f26bbd&vjs=3",
        "application_details": [
            "$150,000–$200,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Who is Recruiting from Scratch:\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.\nIf you are a fit, the team will reach out to you about this role or any others that may be a fit for our clients.\nOur Client\nOur client is a stealth-mode metal 3D printing startup founded on the belief that transforming the way things are made is essential to making the world a better place. Their advanced technology stack lies at the intersection of hardware, software, and data science, creating the foundation for the world’s first fully autonomous and scalable manufacturing system. Their core team hails from several of the world’s most innovative companies such as SpaceX, Hyperloop, and Blue Origin, and they have secured significant funding from several of Silicon Valley’s top venture capital firms.\nWe are actively looking for a highly passionate and self-motivated individual that can excel in a dynamic work environment and will play a critical role in developing software for a variety of functions within our advanced metal 3D printing systems. XX. Ultimately, your solutions will enable the first production scale, high quality, and fully automated metal 3D printing factory. As a crucial member of the engineering team, you will be responsible for driving the pace of innovation, maximizing development speed, and maintain a standard of excellence within the entire engineering team.\nResponsibilities:\nDevelop algorithms for geometry deformation, procedural geometry generation, and space-filling operations.\nWork with simulation engineers to integrate physics-based and data-driven models into the software simulation pipeline.\nIntegrate 2D and 3D meshing techniques into the physical simulation software pipeline.\nWork with data scientists to develop and deploy machine learning algorithms.\nDesign and develop the print preparation software pipeline for an advanced production-scale metal 3D printing system.\nDevelop software to automate the CAD import, geometry processing, slicing, and toolpath planning of an advanced laser melting printing system.\nWork with back-end software developers to architect the software interface to the metal 3D printing hardware layer.\nDevelop software required to implement production automation solutions in the front-end geometry processing pipeline.\nCreate software to interface with third-party CAD and CAM software.\nDevelop, unit test, and deploy functional, scalable, robust, and maintainable software.\nGenerate and maintain documentation of designed software and integrated systems.\nIntegrate third-party software packages into proprietary software.\nQualifications:\n5+ years of experience in software development using C++ (C++ 11 / 14 / 17).\nExtensive background in object-oriented programming and design.\nProficient in computational geometry.\nBS, MS or PhD in computer science, applied mathematics, or related field highly preferred.\nExperience developing advanced software for 3D visual effects, animation, or graphics industries.\nExperience interfacing with CAD and CAM software APIs.\nExperience with 2D and 3D meshing techniques.\nKnowledge of MATLAB and Python is a plus.\nExperience with cloud computing is a plus.\nProficient with software configuration management tools.\nExperience with optimization techniques.\nCreative thinker able to apply first-principles reasoning to solve complex problems.\nExcellent verbal and written communication skills.\nLocation\nWe are now located in Hawthorne in a 20,000 square foot, state of the art facility featuring large open spaces for team collaboration, R&D, and production, as well as easy access to the 405, 105, and 110 freeways. Our facility is in the heart of LA’s vibrant emerging tech eco-system alongside many other high growth start-ups and enterprises.\nBenefits/Salary\nWe have an inclusive and diverse culture that values collaboration, learning, and making deliberate data-driven decisions.\nWe offer a competitive compensation package that includes significant equity in the company, as well as a full suite of additional benefits including premium health care (medical, dental, and vision) and life insurance, paid vacation, and holidays.\nOur work environment includes casual dress, flexible work hours, a fully stocked kitchenette, free parking, daily paid-for lunches, and regular catered team-building events.\nFreeform is an Equal Opportunity Employer that values diversity; employment with Freeform is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.\nBase salary: $150-200k",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 39
    },
    {
        "title": "Lead OS Integration Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=9459e5cdcfad45c7&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Push the boundaries of tech. In your sweatpants.\n\nWe’re looking for an experienced Lead OS Integration Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll design and develop cross-platform integration solutions for the Parallels products family.\nOS Integration is the department that drives Parallels Desktop exciting and innovative features like Coherence, Shared Clipboard, Drag-and-drop, Shared Folders, Shared Profile, and many smaller features. Most of our efforts are put into Windows on Mac scenarios, we dig deep into those operating systems, providing the most user-experience facing features. However, there are many other essential features we provide for Linux and other operating system integration scenarios as well.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDesign and develop cross-platform integration solutions for Parallels products family\nHelp support existing features and improve legacy code base\nWork with different teams driving new features\n\nYOU:\n\n4+ years of programming in modern C++\nExperience creating Windows/Linux/macOS drivers and services for custom devices\nUnderstanding OS architecture principles, frameworks, internals\nUnderstanding of OOP, design patterns\nStrong experience with multithreaded programming aspects\nDesire to research and develop cross-platform and platform-tight, cross-architecture, cross-team solutions\nResponsible, self-driven, proactive, result oriented, team player\nGood written and spoken English\n\nThe following are not required, but definitely nice to have:\n\nObjective-C and macOS frameworks (AppKit/Foundation/etc.)\nLinux kernel device drivers\nLinux low-level GUI (X11, Wayland)\nWin32 low-level API (User/GDI/Shell/Winsock/Services/MSI/etc.)\nWindows kernel driver development (Installable File Systems)\nQt framework: Core, Network, XML, Widgets\nExperience of basic automatic with Python/shell scripts\nExperience in client-server application development\n\nUS:\n\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\n\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\n\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 40
    },
    {
        "title": "Enterprise Senior Application Software Developer - Optik TV",
        "company_name": "TELUS",
        "application_link": "https://ca.indeed.com/rc/clk?jk=d44db30abcfdbb08&fccid=1a93caa31afcad42&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Location: Edmonton, AB, CA Halifax, Nova Scotia, CA Winnipeg, MB, CA Calgary, AB, CA Toronto, ON, CA Regina, SK, CA\nReq ID: 32327\nJobs by Category: Technology Solutions\nJob Function: Engineering & Development\nStatus: Full Time\nSchedule: Regular\nDescription\n\nJoin our team and what we'll accomplish together\n\nWith the convergence of innovative home and mobile networking technologies including fibre and 5G, smart home solutions, mobile devices, automation, cloud computing, and over-the-top capabilities, our customers’ homes look very different in today’s digital world. Every day, TELUS’ engineering and development teams are envisioning what the future holds and building the technologies to simplify our customers’ lives, provide services at the touch of a button, and create immersive entertainment experiences.\n\nAs a software developer on the Cloud PVR and Live Software development team, you will play a key role as a developer and provide operational support for applications supporting various middlewares and platforms. In this position you will be challenged to bring an operational mindset to product development, and drive process improvements. Your insight will be critical to driving architecture and design decisions, for continued improvement of our in house developed application. We are a fast-paced job in an evolving environment, so flexibility, strong work ethic and ability to adapt will be the key to your success.\nHere's How\n\nPlaying a key role as a developer to support the continued development of our microservices-based architecture and cloud native applications you will:\nCollaborate with architects, designers, business system analysts, application analysts, operation teams and testing specialists to deliver fully automated Application Lifecycle Management system\nDeploy, configure, manage, and perform ongoing maintenance of technical infrastructure including all DevOps tooling used by Application Services\nAssist the development team with the preparation of releases for production. This may include assisting in the automation of performance tests, validation of infrastructure requirements, and guiding the team with respect to system decisions.\nProvide superior technical consultation to members of Cloud PVR and Live Software development team as well as other TELUS business units, on complex and critical service troubles to manage the restoration of our application on a 24x7 basis.\n\nQualifications\n\nWhat you bring\n\nExcellent knowledge and experience with Java stack, Spring Boot, server-side languages - specifically Java (8+ years) Experience working with both relational and non-relational database management systems\nExperience in creating and leveraging APIs and RESTful services, that are both in-house and/or 3rd party provided\nExperience with Kubernetes, docker and cloud architectures(GCP/AWS/Azure) and DevOps tools such as Cloudbuild, Jenkins, Harness\nStrong troubleshooting skills with hands-on familiarity with testing methodologies and quality control\nAbility to translate business requirements into technical implementations\nExperience with virtualization, storage and basic networking understanding\nExcellent interpersonal skills, talented at developing and fostering positive relationships with other team members\nBachelors Computer Science or Computer/Electrical Engineering Degree\n\nGreat-to-haves\n\nAdditional experience with any of the following will be considered an asset:\nIntermediate level Windows/Linux admin\nJava, C/C#, .NET Core, Python, PHP\nGit, TFS, or equivalent\nFFHJOBS",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 41
    },
    {
        "title": "Senior Embedded Systems Architect _ Engineer",
        "company_name": "Titan Logix Corp.",
        "application_link": "https://ca.indeed.com/company/Titan-Logix-Corp./jobs/Senior-Embedded-System-Architect-Engineer-3d49e92ed559305b?fccid=30908a476fc217b0&vjs=3",
        "application_details": [
            "Full-time",
            "Permanent"
        ],
        "job_description": "Senior Embedded Systems Architect_Engineer\nMajor responsibilities include:\nmaintaining and extending our current IIOT solution set by designing, implementing, and testing.\nwork closely with other developers, engineers, and technical teams in determining the system architecture and constraints of projects.\nWrite unit test procedures and integration and system-level test procedures in both real and simulated vehicles, to demonstrate that new features meet design requirements.\nConduct comprehensive testing and code reviews to ensure that industry coding standards are followed.\nDebug firmware issues and identify areas for code improvements.\nKeep up-to-date documentation for all areas of responsibility.\nUnderstand and remain current with the various industry standards (SAE, ISO) and regulatory standards (CMVSS/FMVSS, FCC, IC) affecting ECU designs.\nDefining software architecture of embedded systems in close collaboration with a multidisciplinary team of system engineers.\nBringing subject matter expertise in embedded software systems, applied to telecom, radio, Industrial IoT, and B2B related products.\nProviding technical consultations to the Business Development team on new projects and customer engagements.\nCollaborating with colleagues from engineering team on requirements definition, clarification, and decomposition.\nSupporting design teams during project implementation by providing consultations on system architecture, participating in design and code reviews.\nProviding consultation and support to test teams during test strategy definition, reviewing test procedures, ensuring availability of proper software infrastructure for test team execution.\nYou Possess:\n10+ years of software architecture, design, and development experience with embedded systems\nExperience in one or more of the areas: wireless networking (4g/5g), Wi-Fi, and Bluetooth/BLE, wired networking/telecommunications such as TCP-IP, Modbus and Hart, Industrial IoT systems.\nExperience in software development using one or more programming languages: C, C++, C#, .Net.\nHands-on with scripting languages, such as Python or shell scripts.\nExperience in full project development cycle from requirements definition to successful delivery\nKnowledge of various hardware communication and control interfaces (I2C, SPI, UART, PCI, USB, CANBus, etc.)\nUnderstanding of Linux kernel and user space concepts and experience designing on both levels.\nExperience designing multithreaded distributed systems, using IPC, sockets.\nExperience in preparing Linux BSP, including bootloader, device tree, drivers, storage partitioning, etc. Knowledge of secure boots is a plus.\nKnowledge of modern build systems, i.e., Yocto project, buildroot.\nExperience architecting and designing RTOS-based and bare-metal software solutions.\nExperience in low-level interface drivers interrupts handling, scheduling, power management, etc.\nGood understanding of networking concepts (topologies, switching, routing) and network protocols (ETH, UDP, TCP, HTTP, TLS).\nAbility to work in a fast-paced environment, quickly learn new technologies, and managing tasks of multiple priorities.\nFamiliar with cross compilation concepts and tool-chains (specifically for ARM)\nUnderstanding of underlying electronics to the point where it influences firmware development and debugging is an asset\nHighly organized and able to manage multiple tasks and projects simultaneously\nAbility to work well under pressure and respond to multiple fast changing priorities\nStrong team-player with the ability to engage with all levels of the organization\nEntrepreneurial mindset and comfortable in a flat organization\nSolid interpersonal skills that allow one to work effectively in a diverse working environment\nWhat will make us REALLY love you:\nExposure to AWS and other cloud architecture.\nExperience with virtualization, containers, Kubernetes, microservices architecture.\nExposure to full stack and/or enterprise applications development.\nOrganized, goal-oriented, self-starter, with a team focused mentality\nExperience in project management and coordination\nExcellent written and oral communication skills with the ability to produce clear documentation for both colleagues and customers\nGreat team player\nA friendly willingness to collaborate and play nice with others\nWe can see that you have a love for project-based work and staying at the top of your technical game\nWhat you’ll love about us\nCompany Culture – outstanding people and a flexible work environment with lots of after work activities/groups!\nWork/Life Balance – 4 weeks holidays to start and work that stays at work!\nCareer Growth Opportunities – being a technology company with many great projects in the future keeps variety in your work. New opportunities happening all the time!\nGreat Benefits – and, they start the same day you do… and, they include your family… and, the company matches your RRSP contributions!\nJob Types: Full-time, Permanent\nSchedule:\n8 hour shift\nExperience:\nsoftware architecture with embedded systems: 10 years (preferred)\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 42
    },
    {
        "title": "Senior Direct3D Software Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=e88082e30fe6225f&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "We’re looking for an experienced 3D Graphics Direct3D Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll develop cutting edge graphics virtualization technology with our Parallels team.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDevelop graphics virtualization technology with primary focus on Direct3D API\nDevelop and support graphics drivers for Windows platform\nDevelop and support Direct3D API mediation/translation layer\nInvestigate third-party applications issues to find graphics emulation deficiencies\nAnalyze performance of third-party applications with respect to graphics API usage\nYOU:\n5+ years of experience in C/C++ development with basic Objective-C knowledge and familiarity with Python is ideal\nDeep knowledge of Direct3D 9/10/11/12 and Apple Metal graphics APIs\n4+ years of experience developing graphics application for Windows and MacOS platforms\n4+ years of experience in 3D Graphics debugging using tools like PIX, RenderDoc or the like\nWilling and able to take over existing code base, including legacy code\nWilling and able to routinely investigate third-party applications issues\nThe following are not required, but definitely nice to have:\nGraphics virtualization or Graphics API translation experience\nBlackbox debugging skills for 3D graphics applications\nSome practice of using Git and/or Jira\nUS:\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 43
    },
    {
        "title": "Software Technical Lead - SafeTrace Tx",
        "company_name": "Haemonetics Corp.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=c1a476ebe44942c9&fccid=932481fa2e1b1ff5&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "We are constantly looking to add to our core talent. If you are seeking a career that is challenging and rewarding, a work environment that is diverse and dynamic, look no further — Haemonetics is your employer of choice.\nJob Details\nResponsibilities/Essential Duties\n\nDuties are listed in order of greatest importance:\nResponsibility: Responsible for all technical aspects of the product (technical debts, features/improvements, architecture.)\nTechnical Stack: Keeps team and product up to date with technology and trends.\nInnovation: Research new tools and technologies to further innovation. Works with Sales, Marketing and R&D to generate future pipeline plans and drive technologies to support.\nDesign and Code Reviews: Reviews design and code for team which will include both internal and external partnerships. Especially focuses on high value changes based on impact or significant scope.\nDevelopment: Chief architect and designer for the platform and may coding and prototyping large and/or complex features. Works closely with other technical leaders across Haemonetics to drive new interconnected features as well as advancing the foundational technology across multiple platforms.\nTalent Management: Mentors developers through example and direct feedback to develop future technical leadership for Haemonetics.\nCybersecurity: Designs to ensure robust and protected applications especially for systems including PHI and PII. Works closely with various cybersecurity leaders across Haemonetics to drive best practices into products.\nRelease and Support: Manages a CI/CD pipeline for major and minor releases and patches.\nSupervisory: Position requires leading internal and external developers directly and indirectly.\nTravel: If not Boston-based, then 10 - 25%. If Boston-based, 10-20% to Boston HQ, 5-10% to customer and/or partner sites, etc.\n\nRequired Knowledge, Skills, & Capabilities\nExperience in design/architecture (Strong)\nExperience with multiple technologies and platforms at both the enterprise and consumer level (Strong)\nTechnical skills (Strong) across the platforms include:\nCoding in Java, C#, .NET, JavaScript/TypeScript, web frameworks (Angular-preferred), scripting languages (Lua, Python).\nDatabase skills (Oracle, SQL Server)\nCloud technologies (Amazon AWS)\nInfrastructure (cloud platforms, networking, cybersecurity, high-availability, scalability)\nBuilding/managing a CI/CD pipeline and DevOps (Intermediate)\nExperience in HL7 (Preferred)\n\nQualifications/Education\nBachelor's Degree: BA/BS in Computer Science or a relevant discipline (Required)\nMaster’s Degree: MS in Computer Science or a relevant discipline (Preferred)\n9+ Years: Software development / testing / support experience (Required)\n4+ years: Regulated Healthcare or Medical Device Experience (Preferred)\nAmazon AWS Training/Certification (Preferred)\nEEO Policy Statement",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 44
    },
    {
        "title": "Lead Direct3D Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=7fe679513838d8e9&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Remote"
        ],
        "job_description": "3D Graphics Developer - Direct3D\nWe’re looking for an experienced 3D Graphics (Direct3D) Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll develop cutting edge graphics virtualization technology with our Parallels team.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDevelop graphics virtualization technology with primary focus on Direct3D API\nDevelop and support graphics drivers for Windows platform\nDevelop and support Direct3D API mediation/translation layer\nInvestigate third-party applications issues to find graphics emulation deficiencies\nAnalyze performance of third-party applications with respect to graphics API usage\nYOU:\n5+ years of experience in C/C++ development with basic Objective-C knowledge and familiarity with Python is ideal\nDeep knowledge of Direct3D 9/10/11/12 and Apple Metal graphics APIs\n4+ years of experience developing graphics application for Windows and MacOS platforms\n4+ years of experience in 3D Graphics debugging using tools like PIX, RenderDoc or the like\nWilling and able to take over existing code base, including legacy code\nWilling and able to routinely investigate third-party applications issues\nThe following are not required, but definitely nice to have:\nGraphics virtualization or Graphics API translation experience\nBlackbox debugging skills for 3D graphics applications\nSome practice of using Git and/or Jira\nUS:\nParallels is an award-winning productivity solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 45
    },
    {
        "title": "Senior OS Integration Developer",
        "company_name": "Alludo",
        "application_link": "https://ca.indeed.com/rc/clk?jk=5cc4bc3f5efe07ba&fccid=ddc31b1b98dec63b&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Senior C++ Developer : OS Integration - Parallels\nWe’re looking for an experienced C++ Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll design and develop cross-platform integration solutions for the Parallels products family.\nOS Integration is the department that drives Parallels Desktop exciting and innovative features like Coherence, Shared Clipboard, Drag-and-drop, Shared Folders, Shared Profile, and many smaller features. Most of our efforts are put into Windows on Mac scenarios, we dig deep into those operating systems, providing the most user-experience facing features. However, there are many other essential features we provide for Linux and other operating system integration scenarios as well.\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDesign and develop cross-platform integration solutions for Parallels products family\nHelp support existing features and improve legacy code base\nYOU:\n2+ years of programming in modern C++\nUnderstanding OS architecture principles, frameworks, internals\nUnderstanding of OOP, design patterns\nGood experience with multithreaded programming aspects\nDesire to research and develop cross-platform and platform-tight, cross-architecture, cross-team solutions\nResponsible, self-driven, proactive, result oriented, team player\nGood written English as minimum, spoken English as a plus\nThe following are not required, but definitely nice to have:\nObjective-C and macOS frameworks (AppKit/Foundation/etc.)\nLinux kernel device drivers\nLinux low-level GUI (X11, Wayland)\nWin32 low-level API (User/GDI/Shell/Winsock/Services/MSI/etc.)\nWindows kernel driver development (Installable File Systems)\nQt framework: Core, Network, XML, Widgets\nExperience of basic automatic with Python/shell scripts\nExperience in client-server application development\nUS:\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 46
    }
]