[
    {
        "title": "Software Developer Co-op",
        "company_name": "Intuit",
        "application_link": "https://ca.indeed.com/rc/clk?jk=65a66ce254c95e0b&fccid=9784ae78e9834539&vjs=3",
        "application_details": [
            "Internship / Co-op"
        ],
        "job_description": "Overview\n“Where's my tax refund?” “How’s my business doing?” “Can I afford to buy that?”\nEvery day, millions of people and businesses around the globe rely on Intuit’s products to answer these questions. The Globalization team at Intuit is at the forefront of building global capabilities to enable delightful user experiences in their local languages.\nJoin our team as a Software Developer Co-op to develop new capabilities for Intuit products that enable content to be seamlessly localized and delivered globally at scale, with speed and excellence. As part of the team, you will work with product managers, stakeholders, and developers to rapidly deliver tools, software components, and web services that serve both internal developers and end users. We will match you with a mentor to build your skills and grow your career. Bring your passion and be ready to learn fast and boldly innovate beyond the currently accepted normal. This opportunity is for you, if you are passionate about learning modern development technology stack.\nWhat you'll bring\nProgramming fundamentals with an object oriented programming language\nNice to have: familiarity with Python, Javascript and Typescript\nNot required, nice to have: Framework experience (NodeJS/Express/NextJS/FAST API/React). Previous work experience in software development\nHow you will lead\nWorking together with a small diverse team: Deeply understand customer problems and deliver specific features to delight them\nCollaborate with other engineers to share best practices and knowledge of emerging technologies\nImplement features, products, and enhancements that improve the user experience\nParticipate in the agile feature/product design process working with cross-functional teams including: Product Management, Design, QA and Operations",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 0
    },
    {
        "title": "Software Developer (Python & Django)",
        "company_name": "Stantec",
        "application_link": "https://ca.indeed.com/rc/clk?jk=ef9ec62b17f41d64&fccid=f1582c464db8553b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer (Python & Django) - ( 230000A7 )\nDescription\nGrow with the best. Join a smart, creative, and inspired team that works behind the scenes to support operational excellence. Our functional services teams (FSTs) provide services to 22,000 employees in over 400 locations worldwide. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger.\nYour Opportunity\nWe are currently looking for a Software Developer to be focused primarily on developing Python & Django applications within our IT team.\nYour Key Responsibilities\nWrite well-designed, testable code following the coding standards\nRead and understand Java code and translate to Python & Django application\nParticipate in code reviews, document design and ability to identify areas for improvement and make recommendations\nIntegrate software components into a fully functional software system\nWork with team to develop software test plans and quality assurance procedures\nMaintenance of the existing application via enhancements and production defect support\nInteract with peers, help desk, and management personnel to resolve issues\nQualifications\nYour Capabilities and Credentials\nGreat interpersonal skills and team player\nExcellent problem solving and analytical skills\nDevelopment experience with Oracle and MS SQL Server\nFull stack development experience in Python, Django\nExperience with GIT\nSome experience in Agile methodologies and practices\nAutomated end-to-end test experience is highly valued\nWill be considered an asset:\nExperience of WebLogic/Fusion\nExperience using EJBs, Java Persistence API\nProven experience building web services and API\nEducation and Experience\nBachelor’s degree in Computing Science or equivalent required\n2 years of related work experience\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\nPrimary Location : Canada-Alberta-Edmonton\nOther Locations : Canada, Canada-Ontario-Toronto, Canada-Ontario-Markham\nOrganization : BC-1374 IT Services-Corporate-Canada\nEmployee Status : Regular\nJob Level : Individual Contributor\nTravel : No\nSchedule : Full-time\nJob Posting : Jan 20, 2023, 4:59:52 PM\nReq ID: 230000A7\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 1
    },
    {
        "title": "Software Developer",
        "company_name": "Onlea Enterprises Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=19443034eeddfff3&fccid=f9b5dfaee7bb9109&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Onlea, a global leader in digital learning experiences, is looking for someone to help us teach the world. We are looking for a technical developer with a passion for problem-solving, the mind of a teacher, the spirit of an artist, the heart of a designer and the soul of a lifelong learner. Do you long to bring your skills to content that’s more meaningful and has more impact on the world? Then come to Onlea and be a part of a team that creates great learning experiences for students the world over. Our courses have won awards, are ranked amongst the top MOOCs of all time, and have been taken by over a million people in over 170 countries around the world. If this sounds appealing, then get in touch and tell us about yourself.\n\nThis will be a remote position and our office is located in Edmonton, Alberta if you’d prefer to work in the office.\n\nYou must be legally entitled to work in Canada. Preference will be given to Alberta-based applicants.\n\nThis will be a Full Time Permanent Position\n\nArea of Focus: Software Development\n\nThe Hats You May Wear:\nFull Stack Developer, Application Developer, Platform Engineer, Researcher, UX Designer, Database Engineer\n\nResponsibilities and Accountabilities include:\nWorking with Onlea’s research team to design, architect, and implement a commercial product.\nBeing able to effectively mentor a small team of developers.\nParticipating in planning, code reviews, and brainstorming sessions.\nEnsuring cross-compatibility between supported browsers and devices.\nRunning user tests and analyzing feedback.\nResearching and evaluating new technologies.\nWorking collaboratively with non-programming members of Onlea (e.g., user experience experts, beta testers, sales/marketing).\nHelping prepare documentation for external users, grant applications, sales pitches, etc.\nHelping with internal budgeting for your projects.\nWork well in a multi-disciplinary collaborative environment.\n\nKnowledge, Skills, Abilities, and Attributes:\nThe Senior Software Developer is able to:\nArchitect a large software project.\nWrite maintainable, reusable, well-documented modular code.\nFollow established software engineering best practices.\nBring a unique perspective to planning and problem-solving.\nEnjoy researching, learning, and utilizing the latest technologies and tools available.\nBe a strong communicator.\n\nand has experience with:\nFull stack development.\nAdvanced knowledge of most of the following: JavaScript, NodeJS, React, Python, Docker, and REST APIs.\nUser interface and web design.\nFamiliarity with database design, security, cloud computing, and elastic search is beneficial.\nExperience with natural language processing, machine learning, and AI is an asset.\n\nOur Core Values\nWe Work Together from diverse points of view, all in service of developing engaging learning experiences;\nWe are Hungry for Knowledge; and,\nWe Add Value to each other, to our clients and to our communities.\n\nWhy Join Onlea?\nA comprehensive health and dental benefits for you and your family\nA subsidy that supports your Professional Development\nA day off to volunteer at you fave event or charity\nYou will be able to collaborate with a diverse, fun, and talented team as we build the future of eLearning together\nYou will be part of an outstanding team culture.\n\nOnlea is an equal opportunity employer and we welcome applications from all qualified persons. We do not discriminate based on race, ethnicity, colour, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.\n\nWe thank all applicants for their interest. However, only those individuals who are selected for an interview will be contacted.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 2
    },
    {
        "title": "Software Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fefa112ad6210ecc&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nLooking to get your foot in the door at the most exciting technology firm in Edmonton? We’re searching for a Software Developer who values mastery, authenticity, and positivity to help build and grow our product. You'll get a chance to design, build, and improve on each part of our tech stack, with an initial emphasis on front end development. You’d work closely with members of the engineering, data science, product and sales teams in a collaborative environment to design and implement new products and features.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\nImproving our JavaScript platform\nLaunching new clients, including testing and troubleshooting installations\nBuilding the tools that millions of shoppers interact with daily\nParticipating in code reviews, sharing knowledge, feedback, and ideas\nLearning!\n\nABOUT YOU\nExperience with JavaScript, HTML and CSS\nUnderstanding of MVC and MVVM architectures\nUnderstanding of server-side web apps in any language\nBachelor’s degree in computer science, engineering, or equivalent degree / experience\nSomeone with a true engineering mindset, you build things to work and to last\nPassionate about finding elegant solutions to complex technical problems\nEager to work in an ever evolving code base and constantly strive to improve the domain\n\nBONUS EXPERIENCE\nSource control (Git) and familiarity with unix command line\nComfortable working in an Agile environment\nModern JS libraries and frameworks, such as jQuery, SASS, React, Gulp, Vue.js, WebPack, or others\nTag Management Systems such as Google Tag Manager, Tealium, Adobe Experience and Signal\nIntegrating with analytics packages such as Google Analytics and Omniture\nCloud Technologies such as Amazon Web Services\nRuby / Ruby on Rails, SQL, Redis, Python, Hadoop, and/or Spark\nUnderstanding of machine learning\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 3
    },
    {
        "title": "Software Developer 1 - Edmonton",
        "company_name": "Computronix",
        "application_link": "https://ca.indeed.com/rc/clk?jk=edc1141c9502db86&fccid=eb819c9dd1c4141b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Our low turnover rate, challenging work, great client relationships, and teamwork create a high morale environment with plenty of opportunities to innovate, grow in your career, and never get bored! Work/life balance is something we are really committed to, not something we just talk about. We believe you should love your work and your play.\nWe focus on database management built on an Oracle platform and are looking for full-time developers that want to innovate, collaborate, learn, develop, and find solutions to varying programming challenges.\nIn this role, you will...\nDevelop, test, and debug customized software for specific applications, using modern technologies such as Python, SQL, and PL/SQL.\nConfigure workflows within our proprietary software product.\nCode, test, and debug programs, with mentoring and guidance from senior IT staff.\nMaintain and document programs in accordance with company best-practice standards.\nProvide accurate project work estimates.\nDevelop solutions from detailed business and technical specifications.\nAssist with the preparation of software deployments.\nHave a desire for continuous growth and improvement.\nYou're perfect for this job if you have...\nDiploma or bachelor’s degree in computer science/software development.\nExperience working with SQL, Python, .NET, Oracle, and PL/SQL.\nBe familiar with normalization, database links, stored procedures, triggers, views, queries, and joins.\nExperience in relational database management/design, back-end software development\nAbility to write in English fluently.\nAbility to learn other coding languages as needed.\nYou will receive\nA competitive pay scale commensurate with your skills and expertise.\nAn opportunity to grow both personally and professionally through our CX Academy.\nA generous medical, dental, and vision benefits plan along with retirement plans.\nA commitment to corporate transparency with quarterly all-company meetings.\nThe opportunity to be a part of a company that makes it their mission to respect, trust, and serve our clients and each other.\nThe ability to work on a product that improves the lives of others.\nLearn more about us\nWebsite: https://www.computronix.com/\nGlassdoor: https://www.glassdoor.ca/Reviews/Computronix-Reviews-E315632.htm\nYouTube: https://www.youtube.com/c/ComputronixEdmonton\nFollow us on LinkedIn\nYbd3kbxa8G",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 4
    },
    {
        "title": "Full Stack Web Developer",
        "company_name": "Arcurve Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=03921ea8091c6603&fccid=2e61090d2aaf2b15&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Arcurve is one of North America’s leading full-service technology, advisory and software development companies. In 2006, we began with a belief that there was a better way to deliver professional services in the technology industry. Since then, we have completed more than 800 projects for clients ranging from start-ups to Fortune 500 companies. From our office in Calgary and hubs in Halifax, Houston and Vancouver we deliver exceptional results for our clients in a diverse range of industries including telecommunications, oil and gas, transportation, private equity, gaming, infrastructure, software, financial and hospitality.\n\nAt Arcurve, we believe that work should be an enjoyable experience, and that the best “aha” moments come through team learning and continuous motivation. We know the key to success is collaboration, and that you can’t put a value on accountable, transparent, and authentic interactions. We strive to deliver exceptional service while creating lasting relationships with our employees, our students, our clients, and our community.\n\nWe’re looking for an authentic, collaborative, accountable and skilled Full Stack Web Developer to join the Arcurve team.\n\nYOU ARE\nPassionate about technology\nAn authentic and creative human\nDriven to succeed\nA believer in the importance of teamwork\nCommunity-minded\nAn expert problem solver\nSomeone who thrives on challenge\nMotivated by exceptional results\nSomeone who cares about your clients\nTHE GOAL\n\nTo deliver best in class JavaScript, CSS, HTML5, ASP.NET MVC code across a broad array of interactive web applications with a strong eye to create a rich user experience for our clients.\n\nTHE RESPONSIBILITIES\n\nDesign, develop and implement business functionality into web based solutions\nIdentify performance improvement areas for clients, present recommendations and perform rapid mock ups that you can translate into front-end code\nUse your familiarity with API creation and RESTful services along with your solid foundation in data structures, algorithms and system design to develop modern responsive web sites that work across multiple browsers and platforms\nCollaborate with our multidisciplinary client services team and manage your time across multiple projects in a results driven environment\nReact to shifting priorities in a productive manner with a client services focus\nTHE REQUIREMENTS\n\nPrevious experience as a Full Stack Web Developer in a client-facing role\nExperience integrating front end and back end aspects of web application while considering issues such as scalability and security (C#. .NET, PHP, Python, Ruby, JavaScript, tooling including React, Angular, Node, SQL and Azure)\nCollaborative team player\nTHE PERKS\nA fun work atmosphere that values equity, diversity and inclusion\nCompetitive salary plus flexible health & wellness benefits\nHybrid work environment and flexible scheduling\nContract or permanent employment agreements – your choice!\nA convenient, central location in Calgary but open to remote from anywhere in Canada\nCheck out this video from Charlotte to learn more about what it’s like to work as a Full Stack Web Developer at Arcurve.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 5
    },
    {
        "title": "Software Developer",
        "company_name": "The Little Potato Company",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1ee9fe5634294b36&fccid=ad2539d8a8e8d505&vjs=3",
        "application_details": [],
        "job_description": "PRIMARY FOCUS:\nThe primary focus of this position is to work with a high degree of collaboration with the key stakeholders at The Little Potato Company to contribute to the development and sustainment of the organization's business systems. Reporting to the Senior Business Systems Manager, this role is responsible for improving LPC's backend services and frontend products to support the next phase of the company's growth.\nThis position will be expected to manage various projects concurrently and provides ongoing stakeholder support during the software development lifecycle. The Software Developer will interpret requirements and identify solutions to potentially non-standard issues/requests and ensures LPC's values, goals, and principles are implemented and integrated in the delivery of services/solutions to internal-client groups.\nThe role will also have responsibility for guiding best practices and high standards in software development and data management.\nDUTIES AND RESPONSIBILITIES:\nWork with business analysts, process owners, and other LPC stakeholders to scope and build new features to existing products that will bring measured value to the organization.\nSolve complex business problems by proposing technical solutions that align with business, functional, and non-functional requirements.\nCollaborate with cross-functional teams to ensure LPC's critical services are sustained and maintained.\nPrototype and deploy new functionality across both backend and frontend services and applications.\nAssist in planning for scale and deploy built-in monitoring and observability up front so that LPC's software products can keep up as the organization grows.\nProvide detailed specifications that contribute to traceability requisites in software deployments.\nExecute unit testing on prototyped builds.\nCollaborate with business analyst resources in proof-of-concepts, reviewing potential software solutions, and related.\nAdherence to the modified waterfall software process in LPC IT and ensuring it is applied.\nDESIRED QUALIFICATIONS:\n7+ years' experience as a software developer\nDegree or diploma in computer science/engineering or relevant discipline or equivalent education and experience\nFamiliarity with Microsoft Stack\nObject-oriented design and programming\nWorking with CSS, HTML, JavaScript, and similar to develop client-facing programs\nManaging databases and servers\nUnit and integration testing and debugging\nCoding across multiple languages and platforms\nData querying experience\nAPI development\nFamiliarity with data structures and algorithms\nFamiliarity with UI/IX design/management\nTest-driven development (software development process)\nKeeping up with emerging technology\nHold a valid driver's license and passport (periodic travel may be required)\nMust be able to travel within Canada and the US.\nKEY COMPETENCIES:\nA diverse mix of technical competencies such as:\n.NET (ASP, C, etc…)\nC++; C#; other object oriented development\nASP, Java, PHP, Ruby\nMachine language experience\nHTML\nCSS\nBootstrap\nJavaScript\nAngular, Vue, Backbone, Ember, Meteor, Node (JavaScript Frameworks)\njQuery, React, SASS, Gulp, Grunt, Vue.js, WebPack (Javascript Libraries/Tools)\nKubernetes\nGit/GitHub (version control system for tracking changes)\nTypeScript\nScrum framework\nTest automation\nPython\nPython web frameworks (i.e. Django, Flask)\nXML\nSOAP, REST\nSQL; non-SQL development\nPaaS (Azure and Heroku)\nComprehensive verbal and written communications skills\nAbility to work with critical systems under tight time constraints\nTeam-oriented\nKEY MEASURES OF SUCCESS:\n\nProven synergetic working relationships with team members, internal clients, and vendor partners\nAbility to trace deliverables against key organization objectives and their respective requirements documentation.\nLiving the values of The Little Potato Company.\nPHYSICAL DEMANDS:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\nWhile performing the duties of this Job, the employee is regularly required to talk, hear verbal communications, and see machines, product and co-workers. The employee is frequently required to stand, walk, use hands to finger, handle, or feel and reach with hands and arms. The employee is occasionally required to sit, bend, climb or balance and stoop, kneel, crouch, crawl or twist.\nThe employee must frequently lift and/or move up to 15 pounds and occasionally lift and/or move up to 50 pounds. Exertion of physical strength to push, pull, move and lift objects up to 50 pounds from one level to another at varying heights. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.\nWORK ENVIRONMENT:\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.\nWhile performing the duties of this Job, the employee may be subject to some discomforts, such as extreme heat, cold, dust, odors, noise, and hazards, such as closeness to moving mechanical parts and exposure to powered machinery.\nLANGUAGE SKILLS:\nMust possess the ability to read, analyze and interpret business and technical documents, flow charts, budget information, procedure manuals and other instructions documents; the ability to prepare required routine reports and correspondence; ability to communicate effectively with others, using skill and diplomacy and have the ability to work with all levels of the organization.\nMATHEMATICAL SKILLS:\nMust possess the ability to add, subtract, multiply and divide, using whole numbers/decimals and the ability to apply concepts of business math and statistics to practical situations.\nREASONING ABILITIES:\nAbility to apply common sense understanding to carry out detailed instructions furnished in written, oral, or diagram format. Must possess strong knowledge, understanding and experience in various problem-solving and participatory management techniques.\nTECHNICIAL ABILITIES:\nMust possess knowledge and experience in automated systems and terminology and the ability to develop and interpret related reports using ERP, Microsoft Office, Teams and BI, spreadsheet, word processing and graphics software. Requires the ability to operate a variety of standard business machines, such as a computer and keyboard, a calculator, telephone, FAX, photocopier and so on.\nSAFE QUALITY FOODS:\nAll staff are responsible to report food safety and quality problems to personnel with authority to initiate action.\nIn the event key personnel responsible for this role are unavailable, an appropriately trained backup has been assigned to cover the duties to ensure the integrity of the SQF System.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 6
    },
    {
        "title": "Machine Learning Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=400c4aa3625fdd61&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Machine Learning Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for an experienced Machine Learning Developer who values mastery, authenticity, and positivity to help build and grow our product. As an engineer, your strong foundation in productionizing machine learning models will be essential in making long lasting improvements to our product. If you are a highly technical, hands-on, and mission-driven engineer, who has a passion for solving problems in the area of recommendation, search and e-commerce optimization then this is the role for you.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES:\nResearch, design and prototype intelligent systems with the aim of enhancing online shopper experience.\nOversee research prototypes and develop them into fully-fledged AI software that are ready to be delivered to our clients.\nParticipate in active maintenance and code reviews in a large codebase, suggesting and implementing changes as appropriate.\nKeep up-to-date with the latest papers in artificial intelligence and machine learning to propose solutions for real problems in e-commerce.\nBuild infrastructure to support the evolution of our shopper interaction toolset.\nMentor other engineers, participate in code reviews, and share knowledge.\nTroubleshoot, test, and debug to your heart’s content.\n\nABOUT YOU:\nAt least 2 years of real-world experience implementing Machine Learning software.\nProficient in Python and/or C/C++, with an interest in learning new languages\nBSc (MSc or PhD preferred) in Computer Science, Machine Learning, Artificial Intelligence, Statistics, Mathematics, Engineering, Physics, or a related discipline, with (at minimum) graduate-level courses in machine learning, or equivalent practical experience.\nStrong research experience in machine learning, preferably in one or more of the following (in no particular order): reinforcement learning, natural language processing, recommendation and/or ranking systems, deep generative models, representation learning, AI interpretability, domain generalization, meta-learning, computer vision, deep neural network architectures.\nProficient in deep learning frameworks like Tensorflow, PyTorch, etc. and scientific computing packages like NumPy. Able to implement an algorithm as described in an academic paper using these frameworks in quality code.\nStrong computer science background, with experience in object-oriented programming, systems design, data structures and algorithms.\nFamiliarity with source control (Git) and Unix systems, including shell scripting.\nGood intuition for applying AI theory to make business-oriented products with minimal guidance.\nCommunicate to introduce honesty and clarity (avoiding buzzwords and jargon) to experts in multiple disciplines. Demonstrate a mature understanding of the current possibilities and limitations of AI research.\nCurious, constantly looking for better ways to build things and excited to learn about emerging technologies.\n\nBONUS EXPERIENCE:\nOnline advertising and/or marketing analytics, behavioural targeting and/or web analytics.\nWorking in an Agile software development environment.\nUsing cloud solutions, preferably AWS.\nDistributed and/or parallel programming.\nAn active GitHub repository.\n\nABOUT GRANIFY:\nYou’ll work closely with an incredible group of the smartest, most interesting, genuinely good people around. You’ll work hard, learn quickly, and have plenty of excitement. You’ll also get a first hand view into the rapidly evolving, exciting intersection of e-commerce, machine intelligence and psychology.\n\nWith our continued growth as a company, you’ll find limitless opportunities for growth, development, and career progression.\n\nDid you know? Granify is backed by early investors in Facebook, Uber, Twitter, Airbnb, Paypal, Pinterest, Palantir and Yelp. Wouldn’t it have been great to get in at one of those companies as they were taking off...",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 7
    },
    {
        "title": "Developer III",
        "company_name": "Indotronix International Corporation",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ae_fYzx_xl8RRWzsRXTcULcTw2UNV4KekrZcrooYcDv40app-iPmLjweP9S__40UOGq7uZCOd2_9vNBbnEHf5VzBTul438nFHbnzzdT_EFlMJ5lzUyoxqdHh-QyndNdA-YqxK2Ag7DiW5KXI0oQsJwXsG0hEti-ioufHi4eyxUenhW1jVK0aVXX1h9lMRI1uUeEOZlo_NKMoiW0t9iNUN1gtr6BouuEJk9DUEB_8B757DdsSuwlNDlY5oefDbLujiADjt7a4rJyHMf2c3loTCUOidb6EX4Ub27DTYKF_KabqaFBtUdl1szQC85bNIqcnD6pyB6JYzelCVtzxL9rtcsfWKkz56QLqqXjuWBid3XsNEUebReKUBaqjF-Y3nLfknnqkMbGYovLVcab3MDU7A5dM2mwH17am3VfevAVnbH_XziVlZ_OooC1G2HzahxnZ9mH9xNcomDW8BEg1EtuqFIkMtThPaIyirScF2yLxNpwcTH1TBvB0i2TPFkluZYvcHTWl5Ot5kAyUJ7rKt86GevDHBc-UHmRN5I_U8zjt64ct5C32vssQ9KIjGvvAt27i8W9wSKOx-zOuuKclCtqNXqZ4J0sC80MkpUklUaP2vMtubmi002AwX8uKDZEfdX9mvvVPnxuK9XXdMuh4yOqoKmQwwQEySmrPeuwvvE7gktvA2joWikzA2H5ZYaE1tyhTwgTy2zM7zQfnPqxqZ_9oVMLHSoGUzqyeXwxLCrzLvFaA==&xkcb=SoBR-_M3SaYkTEX-J50PbzkdCdPP&p=8&fvj=0&vjs=3&tk=1gqq8askek56a800&jsa=9934&oc=1&sal=0",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Title: Developer III\nLocation: Edmonton, Alberta\nDuration: 12 Months Contract\n\nDescription:\nTo Enhance Client Pipeline Control and Leak Detection (SCADA) systems in support of Control Centre Operations and related business areas. The primary focus of this role is on:\n\nPlanning, organizing, directing and controlling all project and support activities, in order to deliver quality software products and services and to satisfy the business needs of the client business units, within the specified time and budget.\nWork with staff from other areas for the overall benefit of Pipeline Control Systems & Leak Detection (PCSLD) and client.\nManage and resolve client issues for defined business areas.\nMaintain and enhance existing Pipeline Control & Leak Detection products and technologies.\n\nSpecific Accountabilities\n\nParticipate in the research, design, development, and testing of new products and/or functional enhancements to existing products, and their implementation into the SCADA and/or Leak Detection systems.\nProvide technical support, troubleshooting, problem diagnosis, application testing and configuration changes, as a member of the team which takes ownership of custom-developed SCADA and Leak Detection software products.\nBe responsive, supportive, and available to other PCSLD teams in support of Control Centre Operations and other business areas.\nDemonstrate technical leadership on projects and to members of the team.\nSupport SCADA Operations through the 7X24 call-out rotation during transition of Software Solutions projects, and any critical priority development support work.\nDemonstrate commitment to the Software Solutions team and its success.\nDemonstrate an understanding of Software Development best practices, standards, and operating procedures as applicable to mission critical, SCADA and Leak Detection software development.\nPerform code reviews on developers of all experience levels, with the ability to give and take constructive feedback.\nPrepare and maintain documentation as per client standards.\nParticipate in the client Health and Safety program.\nDeliver customer requirements with consideration to overall corporate strategy.\nAssist clients with the adoption of new technologies and business processes.\nDemonstrate technical leadership on projects, project teams and product development.\nMaintain leading edge technical skills through regular technical training, industry conferences, and internal cross-training, and use that knowledge to help the entire team stay current on industry/technology trends.\n\nScope:\n\nInvolvement in design/code reviews and technology investigations required for projects involving the Software Solutions Team.\nDesign, develop, and implement SCADA and/or Leak Detection applications/products.\nProvide input and feedback on the team's Software Development Lifecycle (SDLC) and quality processes to ensure continuous improvement within the team.\nRegular communication with project managers and/or Supervisor as defined by each project's communication plan.\nFailure to deliver on high priority initiatives has potential to impact overall company performance or commitments to customers.\nContacts (Describe main contacts the job interacts with & the purpose & nature of the contacts)\nDirectly reports to the Supervisor, Software Solutions.\nConsult with the PCSLD Lead Architect and the Architecture Review Team regarding use/approval of new technologies, applications, and enterprise technology direction.\nWorking Conditions (Describe the primary conditions under which this job operates. Include physical activity and environment, dexterity, sensory requirements, risk exposure, and mental stress).\nWork is conducted primarily in an office environment.\nOccasional travel to other business units and training / technical conferences.\n\nKnowledge, Skills & Abilities\n(Describe the education, experience and skills required to perform this job).\nRelevant degree / diploma in Computer Science, Computer Engineering, or related discipline.\nFour or more years of work experience.\nStrong industry expertise in C#, Python and/or Java with an excellent track record of designing and implementing complex system software.\nSome knowledge and experience in SCADA, communication protocols, PLC/RTU/DCS data driver development and both historical and real-time data access methodologies.\nWorking knowledge of Unix and/or Linux and Windows operating systems.\nAbility to provide technical leadership to junior staff\nStrong analytical communications and problems solving skills.\nExcellent written and verbal communication skills, including good presentation skills and ability to write technical documents/specifications.\nSound organizational skills. Able to handle multiple tasks and multiple projects simultaneously in a fast-paced, priority-changing environment.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 8
    },
    {
        "title": "GIS Developer - Edmonton",
        "company_name": "Randstad",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DL1mgBEyOWwKTdt-fflRYWJGo3trZEDUBRi3gbejz7bSbolBeWktS2_65nrl63XNRt_8MvMwYzGs27-n_IWy2IDUEhkNGe4o4PjTzgXheeOJ_kyDC8FvE_DRLmOwpaImAeD8mqo8yk-Mgk6cEGyUTCvGTku0MRbiXn01oMD5wBVjIMtyXCjmyXjJbsl0J0fds3ccoXTzi0qRPdR5nbCoiGPSqbT5yDlMmEjt0hD14hU8RK_XjgMh99oJfbUe26dRHiNNwkPj49ZPJyoKYaD_mQ60mtsacS0eF4YkztkW_awbqENypdSeUFDjWklo9KTfMG6_IG31onunJOzJyBaaFMPDCQEO_rCelbnOJM94Kinj4pdBqImJCXhFCHnAitJYiO12V2l-6Yhe-JErSXcSYWmF_7FI3VJzY29UFmOsRMTXLybbVhtl4kwwGzPUHLyXHgq7V3npV5_XkRQSdYCpPfvHnFc-3Y9UxJznExh96ecgs_veS22MCvK2ICk_5XWzH2ExohxNVmPlIu0avtpE5jMXwoJk44xmrih5x5J_PtAUkFyGAp6ITXVXHhdxHnjQQkGqDzmjiQcYRejUUE6rb5ZE4YMuPsmJdqJUK4-31mMlmAwIjASDBoAsI4Ufm3j7m7a0kt4as45rKzn8g0d3v1FfT2BiFgEr54hqoFEsaTd32pT55bn3s34kRQxY1tNHUXuKEgUxpdEa6o8EzsAjxa-LrOXPoUIFQqtjUKOsr0i5VxUHe32d4UKNXxZjY1Gg6-nXrFx0Feri_m36gKcT8dOL-C5SnCjdk0krhE7jngvIgKe57mosbqP6QTHnnnpMRA-5c6vlGiux45oNiY0tkPSFR6dUf7ekQp_Us-gzghWRnPuPHFLZCh1R3hqX8BtZ3dZANS9d3QdbcLZWCWGiTIoOZNkrIr821FMDIzs4MeAKs3ImHiHoZIXibWn2ZfpjleHE6SZrZyZKARXyCrdHxIzVX4y-EkKts=&xkcb=SoDl-_M3SaYkTEX-J50ObzkdCdPP&p=9&fvj=0&vjs=3&tk=1gqq8askek56a800&jsa=9934&oc=1&sal=0",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Our large enterprise Edmonton client requires a GIS Developer for a 12 month contract with possible extension.\n\nGIS Developer will have the following skills:\n\nSignificant level of expertise with Esri ArcGIS Pro, Oracle (SQL & PL/SQL), Python and FME;\nExpertise and experience with ArcGIS Enterprise and MS SQL Server, VB6 and VB.NET;\nSome experience with VertiGIS Studio (Web, Workflow, Reports, Print).\n\nTo work on the following activities & tasks:\n\nConvert the AltaLoad system to use AEGIS (Oracle, Python, FME);\nRebuild the Geocoder component (ArcGIS);\nWork on support COE projects as GIS products are upgraded;\nWork on new COE development projects that use ArcGIS, VertiGIS Studio, FME and Python.\n\nAdvantages\n-\n\nResponsibilities\n-\n\nQualifications\n-\n\nSummary\nPlease contact our recruitment team,, with your resume\n\nThank you for your time and interest.\n\nP.S. Don’t forget that when you update your profile on Randstad.ca it helps us find you faster when we do have roles that match your skills! So even if this role isn’t for you please update your profile so we can find you!\nWe look forward to supporting you in your job search!\n\nGood luck!\n\nRandstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community.\n\nRandstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to accessibility@randstad.ca to ensure their ability to fully participate in the interview process.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 9
    },
    {
        "title": "Software Developer",
        "company_name": "Stantec",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1acc83bf469b2c34&fccid=f1582c464db8553b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Software Developer - ( 230000A5 )\nDescription\nGrow with the best. Join a smart, creative, and inspired team that works behind the scenes to support operational excellence. Our functional services teams (FSTs) provide services to 22,000 employees in over 400 locations worldwide. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger.\nYour Opportunity\nWe are currently looking for a Software Developer with strong experience developing windows applications to join our IT team within Stantec.\nYour Key Responsibilities\nUse interpersonal skills to positively contribute to team\nWrite well-designed, testable code following the coding standards\nParticipate in code reviews, document design\nIntegrate software components into a fully functional software system\nWork with team to develop software test plans and quality assurance procedures\nMaintenance of the existing application via enhancements and production defect support\nTroubleshoot and debug existing systems\nInteract with end users, peers, help desk, and management personnel to resolve issues\nQualifications\nYour Capabilities and Credentials\nExperience in C# .NET Framework 4.5 or higher\nDevelopment experience with MS SQL Server and T-SQL\nGreat communication, interpersonal skills and team player\nExcellent problem solving and analytical skills\nExperience in the following areas is preferred:\nSome exposure on Oracle database and PL SQL or PostgresSQL\nExperience of TypeScript and any modern JavaScript frameworks (Angular, React, Vue)\nExperience of Unit testing using NUnit or XUnit\nSome experience in Agile methodologies and practices\nExposure with Python, Angular, ASP .Net Core, .NET Core, and Docker is preferred\nAutomated end-to-end test experience is highly valued\nExperience of WinForms application\nEducation and Experience\nBachelor’s degree in Computing Science or equivalent required\n2 years of related work experience\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nPrimary Location : Canada-Ontario-Markham\nOther Locations : Canada-British Columbia-Victoria, Canada-Alberta-Calgary, Canada-British Columbia-Vancouver, Canada-Alberta-Edmonton, Canada-Ontario-Toronto\nOrganization : BC-1374 IT Services-Corporate-Canada\nEmployee Status : Regular\nJob Level : Individual Contributor\nTravel : No\nSchedule : Full-time\nJob Posting : Jan 20, 2023, 4:54:45 PM\nReq ID: 230000A5\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 10
    },
    {
        "title": "Developer, Business Intelligence and Reporting",
        "company_name": "AIMCo (Alberta Investment Management Corporation)",
        "application_link": "https://ca.indeed.com/rc/clk?jk=e00c3d1ba4d57d05&fccid=b6b56d398d1cc0d7&vjs=3",
        "application_details": [],
        "job_description": "Opportunity\n\nYou have the opportunity to help AIMCo make data-driven decisions to help us in our vision of ensuring prosperity, security, and opportunity across generations of Albertans. The Business Intelligence & Reporting team is comprised of a group of supportive professionals who are passionate about empowering internal clients to realize their full analytical potential.\nIn this role, you will combine your excellent client service capabilities with your passion for business intelligence and problem solving. You will be fueled by your intellectual curiosity and enable people throughout the organization to solve problems, find efficiencies, and learn new and creative methods to make more meaningful decisions based on the data you helped them understand.\nThis is a learning focused group that is eager to cross-train and raise the skill-profile of the entire team. They are always encouraging each other to come up with creative solutions for the benefit of AIMCo and our clients.\n\nResponsibilities\nProvide support services including root-cause identification, debugging, training and consultation services for any business intelligence tools or reporting related concerns\nCollaborate with stakeholders and end users to design, build and maintain innovative BI solutions resulting in new insights, work automation, process clarity and data accuracy across the business\nSupport group of Business Intelligence Champions to foster best practices\nProvide direct support and coaching to teams on best-practice uses of data, analytics & visualizations and assist users to finding the right information\nSuggest and build both static and interactive data presentations and novel ways of telling stories\nPromote self-serve reporting and enable others to use new business intelligence and reporting tools by facilitating group training sessions\nGenerate detailed designs, requirements and solutions documentation\nEnsure accuracy and integrity of data and applications through analysis, ETL modeling, coding, writing clear documentation and problem resolution\n\nIdeal Candidate Qualifications\nBachelor's degree in Computer Science, Management Information Systems or a related field\nDemonstrated interest in the field of finance through work experience, external training, or pursuit of the Chartered Financial Analyst (CFA) designation is a desirable asset\nExperience in visual design and communication best practices to tell actionable stories\nCreative thinker who understands user interface design and can apply skills to user experience design, data visualization, and graphical design\n4 plus years of development experience preferably in the financial industry\n3 plus of designing, developing and deploying business intelligence solutions using Power BI, Tableau, or other data visualization software\nAdvanced experience with SQL, Python, and other programming languages\nWorking experience with machine learning and artificial intelligence projects\nClient-focused mindset\nAdvanced written and verbal communication, experience facilitating group training sessions is a strong asset\nDemonstrates a strong commitment to AIMCo’s core values of excellence, transparency, humility, integrity and collaboration, and inspires the same in others\n\nSuccess Measures\n\nAfter three months in the role, success will be determined by your ability to integrate with the team, understand regular processes and implement at least one business intelligence project. You will also share your ideas and ask questions that help the team challenge the status quo.\nOne year later, you should be able to reflect and take pride in the number of fellow employees that you trained and allowed to reach their analytical goals. You will have developed a robust understanding of the different business units within AIMCo and collaborate with them to solve problems and better utilize existing data sets to find additional value.\n\nBenefits and Rewards\nExciting special project work and stretch assignments\nOngoing training, coaching and educational reimbursement programs\nHealth care spending account and onsite fitness facilities\n\nAbout AIMCo\n\nAlberta Investment Management Corporation, AIMCo, is one of Canada's largest and most diversified institutional investment managers with CAD $168.3 billion of assets under management, as of December 31, 2021. AIMCo invests globally on behalf of 32 pension, endowment, and government funds in the Province of Alberta.\nAt AIMCo, you'll be part of a Results-Only Work Environment™ that enables employees to choose where and when they work. An outcome-based goal-setting methodology ensures that our people leaders and employees are all focused on the same measurable goals.\n\nNext Steps\n\nWe are excited to meet you. Please submit your resume or CV to be considered for this opportunity. Applications are being reviewed on a rolling basis and we will be in touch with any questions.\nFinal candidates will be asked to undergo a security screening, which includes a credit bureau and a criminal record investigation, the results of which must be acceptable to AIMCo.\nALERT - Be on the lookout for AIMCo career opportunities advertised through third parties that request an application fee or too much information. To verify, all opportunities are posted on aimco.ca/jobs\n\nJob Reference: CA00619",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 11
    },
    {
        "title": "Talend API Developer",
        "company_name": "CGI Group, Inc.",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CmPt6JXytAhZscz-5ZOP53MMQ49Xi4hmwETo1lvmuAlQDU5jwq7CUrvc3jCEOr75kO21BiKOWD3xbAETG1bEivO5usMdcfX0DUEoyZ3ALMfGTq0pm2cwL5uGbCcBC1cEuiwb2OCvXYRwDr2-tPPh2lTM-ygTfvCALzV9bz7bDXRbayAkYwvQ6i5lAVOXlBaBLN5OcyciE4d0tLrnUlT8Auht-42SoiZeHKOYo0H2yt8Dcb-P1jTjyHazCsMDp8l7xSwwye4ZxiTAY99nxByV4tTuKiYhGN44vC0GowmaslL3EExM7qP9IRoMtLLeB3Cq-f8ZXIQb8tsaEyR8dizvbeHKOfB9wxsBFWgTRQsBeqg-QiPZkjDq24w-Lm2NLzd_jbDNjMV_2FChHFNkp3lBb54k52dNiDy7CiLeiVdfa0_FqQCH2UhRAGVLzioyFZF4tkrIZHEL8x0InTS3FY9cyLJtAFDYNLq1r2Y8A3qW4uvnUp4ixFMhvQZMJVx_bIxMqZ4wHHq0o-0z37KWe2zmTTKhDR8oEhWxJWILfLBikmPM-Nurn9oONq-GWuSJwTMzyKBVWVCWvHzbZp0Ng6Yb8gnuIWoqJtKYg=&xkcb=SoCz-_M3SaYkTE3-J50KbzkdCdPP&p=12&fvj=0&vjs=3&tk=1gqq8askek56a800&jsa=9934&oc=1&sal=0",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Position Description:\n\nReady to join an outstanding culture that cares about diversity and inclusion, and corporate social responsibility, with the freedom to innovate, influence decisions, and chart an exciting career? CGI is more than just an IT company; be part of a team that supports the local community with the ability to draw on global outstanding talent. Benefits include a share purchase program, profit sharing, wellness credits, training and development programs, and flexible work schedules and locations!\n\nCGI-Edmonton is experiencing strong client demand for data integration between clouds and on-premise. Specifically in the technology sector of data integration with Talend, there is an excellent opportunity for the candidate to contribute to the growth and take on responsibilities as a developer, analyst, or technical team leader.\n\nYour future duties and responsibilities:\nWith the Talend tool, develop and document robust Application Programming Interfaces (APIs)\nContribute expertise to support other team members in their delivery and evolution\nValidate the functional and technical specifications provided regarding data processing\nDiscover and solve data quality or data integration problems with thoroughness and creativity\nDefine and create integration and data pipeline processes to meet quality requirements\nPerform the design and integration of all the required components of a complete environment: scheduling, performance, history, etc.\nDesign and apply integrated testing and acceptance strategies\nOccasionally, write functional analyses\nDocument processes\nCollaborate in estimating operational and project efforts\nContribute to creating and applying the standards and procedures established by the team\nCarry out follow-ups with the Lead Project Manager\n\nRequired qualifications to be successful in this role:\nCollege or university degree in computer science or related field\nLevels of expertise sought: intermediate (3 years and +) and senior (10 years and +)\n2+ years experience with Talend\nRelevant experience in the development and evolution of APIs\nWeb services such as REST-JSON and/or SOAP-XML\nKnowledge of SQL, JAVA, or Python\nSkills in performance optimization (tuning), both in the tool and the DBMS\nSuperb communication skills, both oral and written\n\nDesirable Skills:\nExperience working with cloud services (e.g. developing for Azure or AWS PaaS environments)\nAPI and backend services development using Java\nGitLab and GitHub\nApplication deployment automation using (Jenkins, GitHub Actions, and/or Azure DevOps)\n\nEducational Requirement\nBachelors Degree in Computer Science or Diploma in IT with equivalent IT experience\nTalend Professional Certification\n#LI-ST3\n\nSkills:\nTalend\n\n\n\nWhat you can expect from us:\n\nInsights you can act on\n\nWhile technology is at the heart of our clients' digital transformation, we understand that people are at the heart of business success.\n\nWhen you join CGI, you become a trusted advisor, collaborating with colleagues and clients to bring forward actionable insights that deliver meaningful and sustainable outcomes. We call our employees \"members\" because they are CGI shareholders and owners and owners who enjoy working and growing together to build a company we are proud of. This has been our Dream since 1976, and it has brought us to where we are today - one of the world's largest independent providers of IT and business consulting services.\n\nAt CGI, we recognize the richness that diversity brings. We strive to create a work culture where all belong and collaborate with clients in building more inclusive communities. As an equal-opportunity employer, we want to empower all our members to succeed and grow. If you require an accommodation at any point during the recruitment process, please let us know. We will be happy to assist.\n\nReady to become part of our success story? Join CGI - where your ideas and actions make a difference.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 12
    },
    {
        "title": "21457 - Leak Detection/SCADA Developer",
        "company_name": "Raise",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Da55cD5SyBLpPH7k1CrVrulUOH2z8rmQzTVue5eMZiIUHHPnGyVifNQLN_EP-tq8_ACJUlMHs6Emhnom2PadMDOJYwr6aqwXT9ig70Aieu-8-VGffTe6iHW9dV1QW_561PFybYuXDw57DQHq-Cczcp5JRiGSHBTSZVrIMpi0yjX5dzDF8mva0JqoozYiqCuNTXi8sW6zSUfCDxrhItEpfbnD3a-5144zwLmu_-DYuzt06q9vVKkRNN_-EIsYIj56aaUbNVL7mzwMwKuoNYsd7mQVGZ2Sq0KpSdgMbdFADXTtZXT1dtXgDR7sp23lyK2d_m1LMQg3UskKQbetRw-g_XHXSFs6xLPqQRRc0DKDtiQv6SOlADZcJM_E9VYMrPyJncM1bq4ogSzkuK2a4zENxGOZsTSvk2C5tk_YkOCdBv7R374wrIcPxlSDLLwFUO6trjm5ZL-bhHznXQa5A3-hWFE0Vrb71wwIBU5ir2_ovOxp31otBG89jJxIJbR3uraQWaUqiBPJwTxNKAPwD04dkruEB7g-x0vVgRbpwQJZ90-aboXi_aCtMva3oOjf5a2to5ZUjHW9pFEk9giz1EF--knV0T_POTgoQmL_CHeI8Qd-JPdHc2agfNTtteURoVoWRkvaXXLADcEuXGjIQI5si2qGQqv9Z6wnjIyq7ld8lLa08kEVCteF973tmHLyPJUTWWrlSVFe0SEMHKWgS2Adf9MthnXgpltp3CQFoCpcBQzBit_P-DToO0Mvg2ztliLUW6oc_84KA0zSJge2ciF-eVRTNVorjAmEc=&xkcb=SoAu-_M3SaYkTE3-J50JbzkdCdPP&p=13&fvj=0&vjs=3&tk=1gqq8askek56a800&jsa=9934&oc=1&sal=0",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Our client, a Canadian multinational energy transportation company with a focus on the transportation, distribution, and generation of energy, has an immediate need for a Leak Detection/SCADA Developer. This is a contract position for one (1) year located in Edmonton, Alberta.\nDescription\nThe Leak Detection/SCADA Developer role will provide support of Control Centre Operations and related business areas.\nRole Accountabilities:\nPlanning, organizing, directing and controlling all project and support activities, in order to deliver quality software products and services and to satisfy the business needs of the client business units, within the specified time and budget.\nWork with staff from other areas for the overall benefit of Pipeline Control Systems & Leak Detection (PCSLD)\nManage and resolve client issues for defined business areas.\nMaintain and enhance existing Pipeline Control & Leak Detection products and technologies.\nParticipate in the research, design, development, and testing of new products and/or functional enhancements to existing products, and their implementation into the SCADA and/or Leak Detection systems.\nProvide technical support, troubleshooting, problem diagnosis, application testing and configuration changes, as a member of the team which takes ownership of custom-developed SCADA and Leak Detection software products.\nBe responsive, supportive, and available to other PCSLD teams in support of Control Centre Operations and other business areas.\nDemonstrate technical leadership on projects and to members of the team.\nSupport SCADA Operations through the 7X24 call-out rotation during transition of Software Solutions projects, and any critical priority development support work.\nDemonstrate commitment to the Software Solutions team and its success.\nDemonstrate an understanding of Software Development best practices, standards, and operating procedures as applicable to mission critical, SCADA and Leak Detection software development.\nPerform code reviews on developers of all experience levels, with the ability to give and take constructive feedback.\nPrepare and maintain documentation as per company standards.\nParticipate in the Health and Safety program.\nDeliver customer requirements with consideration to overall corporate strategy.\nAssist clients with the adoption of new technologies and business processes.\nDemonstrate technical leadership on projects, project teams and product development.\nMaintain leading edge technical skills through regular technical training, industry conferences, and internal cross-training, and use that knowledge to help the entire team stay current on industry/technology trends.\nScope:\nInvolvement in design/code reviews and technology investigations required for projects involving the Software Solutions Team.\nDesign, develop, and implement SCADA and/or Leak Detection applications/products.\nProvide input and feedback on the team’s Software Development Lifecycle (SDLC) and quality processes to ensure continuous improvement within the team.\nRegular communication with project managers and/or Supervisor as defined by each project’s communication plan.\nFailure to deliver on high priority initiatives has potential to impact overall company performance or commitments to customers.\nContacts (Describe main contacts the job interacts with & the purpose & nature of the contacts)\nDirectly reports to the Supervisor, Software Solutions.\nConsult with the PCSLD Lead Architect and the Architecture Review Team regarding use/approval of new technologies, applications, and enterprise technology direction.\nWorking Conditions (Describe the primary conditions under which this job operates. Include physical activity and environment, dexterity, sensory requirements, risk exposure, and mental stress).\nQualifications:\nRelevant degree / diploma in Computer Science, Computer Engineering, or related discipline.\n4+ years of work experience.\nStrong industry expertise in C#, Python and/or Java with an excellent track record of designing and implementing complex system software.\nSome knowledge and experience in SCADA, communication protocols, PLC/RTU/DCS data driver development and both historical and real-time data access methodologies.\nWorking knowledge of Unix and/or Linux and Windows operating systems.\nAbility to provide technical leadership to junior staff\nStrong analytical communications and problems solving skills.\nExcellent written and verbal communication skills, including good presentation skills and ability to write technical documents/specifications.\nSound organizational skills.\nAble to handle multiple tasks and multiple projects simultaneously in a fast-paced, priority-changing environment.\nAdditional Information:\nOccasional travel to other business units and training / technical conferences.\n\nIf you're a technical professional, you know that at RAISE an Ian Martin Group Company, we exist to connect professionals like you with meaningful work at industry-leading companies in your field. And we walk the walk, too: as a Certified B Corporation, we believe in using business as a force for good for people, our communities, and the environment.\nWe value diversity and inclusion and encourage all qualified people to apply. If we can make this easier through accommodation in the recruitment process, please contact us at hello@raiserecruiting.com\nWe encourage all qualified candidates to apply; however, only those selected for an interview will be contacted.\n\n#WES",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 13
    },
    {
        "title": "Developer III JP21457",
        "company_name": "Manpower",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AIYCD7Iz1Jfq0vSk9K5x5txVAci-3mutR-yem9NNsSUyVPZxgqVWZxZeOh2H09SjmNRi7CR0naGjJQNhYtO18WO1-ggUt2QLXYk3a_9uXhYc6uVWv5RxcBhT3Ctcyp5VExBczedk4AGalf4eoKO_qczqvDqSuTgx8OKUu26LPi-YLiW-nnJRydO_ScxicThyWaTnOEP7GdcL6F2BeCOPzx-PAT8QxFc2LcUqb1pegGk6C9LlvITKCoNBhtHyo78dPpBEyyvJZoMLKvp8KrfU5gO22k-RnrR4XOD4nWTNKXO-F9GXz04o-nTI5orKNqcbPENzqMsKe4GVuSlfZoE92b7nqtEQzbg7JhIOnn29pGj4Ba4JaoUGczIqMfwoI_NltsM2o0YItyp2RCrvhqzlqKksDA1MBWnmWn_PQSXJGKs-5ueUxRLs5xSEwp2n6q6fN4T9pbtVDeBFGGgvshhpzzxh75Rm0vPlguSGayAbxw5Q4Ta67wksL1PIEEWSfE-kEY1reS5_suViEJY76GlShMGX4FQk_jQeGiwDpJ_krBIgY3xjW7kBP4q6f41lvpxjS2UiyF2SRksc-a5hm7YvLX1sdBs0c4w9_UrBkkXjK1Rj3ENcA2GaaO5eiFTC9jLj8=&xkcb=SoCa-_M3SaYkTE3-J50IbzkdCdPP&p=14&fvj=0&vjs=3&tk=1gqq8askek56a800&jsa=9934&oc=1&sal=0",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Currently recruiting for a Leak Detection/SCADA Developer for a Major Pipeline Company\nPlanning, organizing, directing and controlling all project and support activities, in order to deliver quality software products and services and to satisfy the business needs of the client business units, within the specified time and budget.\nMaintain and enhance existing Pipeline Control & Leak Detection products and technologies.\nSpecific Accountabilities\nParticipate in the research, design, development, and testing of new products and/or functional enhancements to existing products, and their implementation into the SCADA and/or Leak Detection systems.\nProvide technical support, troubleshooting, problem diagnosis, application testing and configuration changes, as a member of the team which takes ownership of custom-developed SCADA and Leak Detection software products.\nSupport SCADA Operations through the 7X24 call-out rotation during transition of Software Solutions projects, and any critical priority development support work.\nDemonstrate an understanding of Software Development best practices, standards, and operating procedures as applicable to mission critical, SCADA and Leak Detection software development.\nPerform code reviews on developers of all experience levels, with the ability to give and take constructive feedback.\nScope\nInvolvement in design/code reviews and technology investigations required for projects involving the Software Solutions Team.\nDesign, develop, and implement SCADA and/or Leak Detection applications/products.\nProvide input and feedback on the team's Software Development Lifecycle (SDLC) and quality processes to ensure continuous improvement within the team.\nRegular communication with project managers and/or Supervisor as defined by each project's communication plan.\nFailure to deliver on high priority initiatives has potential to impact overall company performance or commitments to customers.\nConsult with the PCSLD Lead Architect and the Architecture Review Team regarding use/approval of new technologies, applications, and enterprise technology direction.\nWorking Conditions (Describe the primary conditions under which this job operates. Include physical activity and environment, dexterity, sensory requirements, risk exposure, and mental stress).\nWork is conducted primarily in an office environment.\nOccasional travel to other business units and training / technical conferences.\nKnowledge, Skills & Abilities\nRelevant degree / diploma in Computer Science, Computer Engineering, or related discipline.\nFour or more years of work experience.\nStrong industry expertise in C#, Python and/or Java with an excellent track record of designing and implementing complex system software.\nSome knowledge and experience in SCADA, communication protocols, PLC/RTU/DCS data driver development and both historical and real-time data access methodologies.\nWorking knowledge of Unix and/or Linux and Windows operating systems.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 14
    },
    {
        "title": "Software Developer – Front-End Specialist",
        "company_name": "Silvacom",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D1UCCmsbtbyUaEEOfc0v3SFW7Zdl6eZywgL01JaW6prGQivhRUCnMQCjvpqj4cwYrnV7UAUT56sksXPz72YS8keSjKIZonA3urTtMCLnH5KdYZtNl3fJraUpMCBXeApS50RKcDdEJYm7i-n5LW7T_94xBUSOBr2V7i3H5fQdMqLf4VWk4FmsAagvZKo_bYTuer99e5j1YFPMKWc8ZLcvWIe--jwGyUiPYSrFCBVe3yDK0prCnE_zHdaOuNTIude4qhIImxijIOit7OCLx4u-zYCVRpP0kx3R5gCEObnlvTbtMxw0XRKVChNswv-xkpPwnpFUicWghoeVUEIptY_IHPPgyQ7nI5KnzpwPwlYO66fIRIA_B6FryuJBSd2opriDeWjGv9b1cjZYno7XD4jQcGj7oYALjsYqY4-d8b_0M74XpLpch9Xtr2fTviPEXylJTj-PLXCEK-4ryzPXMqhuA3GC4lXKf4oE3fnqKn5B1w_LstskUbkYi_CC-y9OP4Hes8R_ndXurt555aGP1LboE0redsq3u3o7Ov6HwIrFocEjUdftPaeShd2TuQwjUzM-JptByVgSmcuQ==&xkcb=SoDo-_M3SaY-afTU750KbzkdCdPP&p=0&fvj=1&vjs=3&tk=1gqq8cdfs2b2g001&jsa=9964&oc=1&sal=0",
        "application_details": [
            "Cover letter",
            "Full-time"
        ],
        "job_description": "We are looking for an Intermediate Software Developer for our SaaS platform, Silvacom FMS™ (www.silvacomfms.com) – the most comprehensive cloud-based forest management software in the world. Working closely with our team of developers, support staff, and product managers, you will provide guidance in the application’s design, scalability and client support to help grow and scale Silvacom FMS.\nThe Product:\nSilvacom FMS (www.silvacomfms.com) is an Esri-based geospatial software solution that offers sophisticated, powerful and easy-to-use workflows. Created in 2003, Silvacom FMS is an integrated system of geospatial cloud-based forest management applications that empower forestry companies to plan harvesting activities, track operations, manage silviculture, generate georeferenced maps and much, much more. Silvacom FMS is a SaaS product of Silvacom (www.silvacom.com).\nJust like the Silvacom FMS product, our FMS team is growing, and we are looking for creative, high-performing people to join us and help solve problems in the forest management software space.\nThe Company:\nSilvacom FMS is a product of Silvacom, an award-winning company and one of Canada’s Top Small & Medium Employers and Alberta’s Top 75 Employers. At Silvacom, Corporate Social Responsibility is a part of our company fabric. We are socially accountable, to ourselves, our stakeholders, and the public.\nWe like to work-hard, play-hard and enjoy fantastic company events like:\nVideo Game Night\nBacon Breakfast\nFamily Picnic\nAwards Night\nPublic Skating\nEscape Room events\nPizza Day\nK-100 Relay Race\nHalloween Party\nChili Cook Off\nChristmas Gift Exchange\nWe also offer:\nMedical/vision/dental benefits\nFlexible Spending Account (FSA)\nCompany sponsored RRSP plan\nFresh snacks and Starbucks coffee\nWhat you will do?\nBe part of a team in a fast-paced work environment, focusing on full-stack development using the latest technologies.\nBring a positive attitude, participate on a team focused on delivering advanced, customer-focused applications.\nPerform peer code review with an eye towards automated quality assurance and control\nPlan, build, and grow web applications which meet the needs of clients\nWork independently and with other developers, designers, project managers, and other stakeholders.\nDevelop product improvements with a focus on market fit.\nCreate well formatted code in line with internal development practices.\nBe an active participant in backlog review sessions and other scrum and planning meetings while sharing best practices with colleagues.\nPerform and monitor quality assurance tests in collaboration with the Product Team.\nParticipate in after-hours activities during platform emergencies or maintenance.\nThe Ideal Candidate:\nHas the ability to develop, test and debug customized software for web applications, using modern technologies such as Angular, Java, Python, PL/SQL, Hibernate, Spring framework, Jasper Reports, ESRI (restAPI, ArcGIS server) etc.\nIs proficient with oracle databases and relational database design\nTakes initiative to troubleshoot customer service requests and resolve problems either individually, or as part of a team, in a timely and helpful fashion\nHas high attention to detail and commitment to quality\nApplies innovation and creativity when approaching challenges\nDevelops strategies to ensure production levels and quality standards are met\nTakes an active interest in the company and welcomes being challenged professionally\nExperience with ticket management systems (e.g., Jira, Freshworks)\nWill be comfortable collaborating with customers and teammates using a variety of communication techniques: email, phone, web meetings (Teams, Zoom, etc.)\nRequired Experience:\nBachelor’s degree or diploma, preferably in Computer Science or Information Technology, GIS or equivalent experience and training\n2-5 years’ software or GIS development experience (preferred)\nProficient user of MS Office applications\nSeem like a good fit?\nPlease submit your resume with cover letter in MS Word or PDF file format. Also, please indicate where you saw our ad listing. If applying, please view our privacy policy. We thank all applicants for their interest; however only those selected for interview will be contacted. No phone calls please.\nJob Type: Full-time\nSchedule:\nMonday to Friday",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 15
    },
    {
        "title": "#2023-D-0001 Software Developer - Edmonton",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AvDS0qnKC8XdVN3hPYf4Rw8MyZ0AcclMJ513gwYKX_L6dWYXA-lUfPS4BSppQFk3ZQjPlW97mzozJ_EtkEtpGjr1iaxjPt8Zb2czkH22wWyrjMJA8DXAJBsgHMfHiOhKFLERM5Z27EteSdxqF2Ulf_gTmIBV5YvMzy_-KZ36_VRqwUPrNHKQhjFz7VO103jzOzQO4Sf6ienrfTkDCDf5akkyKlG6Xy5TrUf-80plz6a0BNO0q9L6f4VV-4an64qCX3RLt-ARV5HCvWgGwMBmETuIAvz14n7nKNs6aVY1kUmeoiDxDSAH6dP0Zh59hf5UcSkHgagCthyFxCfkI57zbp6fP_CLFxLw2IN4R0PjliZrHFjB_zClbPqYRIUv-m-AgjfnYxTWkIUscooJg7KVPYttYtf72SeaJ7T3zswDCd1qmFvQsfcak6or3EmytxrqvBsL9_niqzjSMohsaz413SalbXdBvaJ2OQ0iOjk4-LaWVcKbgIYjgWXDe1bdu8hISNmhqy914M2KPKaCQqPMoGOIzvpnBHPI_-bj76NOrE-eTOBRaa-SSYsXuB88tIsKGO5fdvKJTLs71fQt4b_P9Xlvt7w3tY4nbU5g_vafqUiURq9cKie0Gu0HjjJxNuu5ODiId6dt5R4o73rb180upz&xkcb=SoAZ-_M3SaY-afzU750LbzkdCdPP&p=1&fvj=0&vjs=3&tk=1gqq8cdfs2b2g001&jsa=9964&oc=1&sal=0",
        "application_details": [],
        "job_description": "Please apply on Isarta.com\nhttps://isarta.com/jobs/?utm_source=IND&job=89429\n\nSoftware Developer\nLocation: Edmonton, AB\nWho we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you're watching, how you're watching, or whether you're in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\nINVIDI's world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\nThe goal of developing a unified video ad tech platform is a big one and the right Associate Software Developers-like you-flourish in INVIDI's creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI's developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\nAbout the role:\nAre you passionate about technology? Do you want to be part of the team that is revolutionizing TV advertising across millions of homes worldwide? If so, don't miss this opportunity to co-author software artifacts with technology experts that disrupt the advertising world by working on our industry-leading addressable advertisement solution.\nYou'll be contributing to INVIDI's SaaS solution that provides targeted advertising for online streaming platforms. In addition to this core service, you will help shape the technology powering INVIDI's overall monitoring solution that allows customers to gain insights into their campaigns.\nWe're agile, with a dedicated Scrum Master, whose only job is to make sure we have everything we need to keep focused on our tasks. We strive to choose the best tool for the job and we're looking for people who love to learn fast and get things done. We are supported by a great SRE team and prefer to use shared common tooling.\nKey Responsibilities:\nWe are a DevOps organization, so our core responsibility is the development and operation of the services making up INVIDI's SaaS platform.\nFull software development lifecycle\nDeployment and operation of services\nTeam on-call rotation required\nTroubleshoot incidents and implement adequate solutions to restore and maintain system function, supported by automated monitoring, incident managers and our support team.\nWriting and maintaining documentation\nActively participate in our Agile process, including sprint planning, backlog refinement, etc.\nActively participate in implementing continuous integration/delivery, static code analysis, and test automation.\nWork with our Talent Development Managers to build and follow a personalized skills development plan.\nYou will design, develop, deploy and operate backend services in Kotlin or Java that are scalable, durable and performant.\nYou will collaborate closely with peers and product owners in an autonomous, cross-functional team.\nYou will help other team members grow as engineers through code review, pairing, and mentoring.\nAs a part of the DevOps team, you will be on-call for the services that the team owns. You are on-call for one week, approximately once per month. While on call, you are required to be reachable by telephone and able to act upon alarm using your laptop.\nOur Requirements:\nBachelor's Degree in Computer Science or equivalent.\n5+ years of backend engineering experience\nYou are an outstanding Java/Kotlin developer who loves to develop distributed high-volume systems.\nYou care about the craft and cherish the opportunity to work with smart, supportive, and highly motivated colleagues.\nYou like to learn new things, mentor, and share knowledge with team members.\nDeep understanding of object-oriented design, data structures and analytics, and algorithms.\nDeep understanding and experience of working with database technologies such as PostgreSQL, TSQL, DynamoDB, Redis as well as Protocol Buffers.\nHighly preferred candidates also have\nWorking experience in an Agile environment: Scrum, Kanban\nIndustry knowledge of big data and distributed systems.\nExperience building RESTful web services.\nWorking experience in a DevOps environment.\nSoftware design and systems architecture experience.\nExperience with security in software development and architecture.\nExperience with the tools we use:\nInfrastructure as code: Terraform, Ansible\nAnsible\nSource control: Git, GitHub/BitBucket\nCI/CD: Jenkins, BitBucket Pipelines\nPub/Sub: Kafka, AWS Kinesis\nContainerization/Orchestration: Docker, Kubernetes, AWS ECS/EKS\nDeveloper security platforms: snyk, veracode\nObservability/Monitoring: Datadog, AWS CloudWatch, PagerDuty\nExperience building and deploying cloud-based software using AWS or GCP.\nCable or Satellite industry knowledge is a plus.\nExcellent oral and written communication skills.\nBuild tools such as Maven.\nContainerization with Docker and Kubernetes.\nDeveloping and deploying RESTful web services.\nCloud experience with GCP and AWS and their services.\nDeep understanding of:\nObject-oriented design, data structures, algorithms\nExperience writing code that adheres to a style guide.\nExperience performing peer code reviews to ensure code quality.\nStrong development skills in one or more of the following languages:\nJava/Kotlin (Highly preferred)\nPython\nBash\nGo\nJavaScript\nC#\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We're proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at via Isarta at least one week in advance of your interview.\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.\nReady to join our team? Apply today!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 16
    },
    {
        "title": "Senior Software Developer",
        "company_name": "Computronix",
        "application_link": "https://ca.indeed.com/rc/clk?jk=aec5769d88a4931b&fccid=eb819c9dd1c4141b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "About Computronix\nOur low turnover rate, challenging work, great client relationships, and teamwork create a high morale environment with plenty of opportunities to innovate, grow in your career, and never get bored!\nAs a Sr. Software Developer at Computronix, you will work in a highly dynamic, energetic, fast-changing, and fluid work environment. You will contribute technical expertise to design, develop, implement, or support Computronix software solutions.\nWe focus on database management built on an Oracle platform and are looking for full-time developers that want to innovate, collaborate, learn, develop, and find solutions to varying programming challenges\nAs a member of this team, you will...\nHave deep knowledge of multiple technologies (languages, tools, modules, and performance tuning).\nDevelop customized software for specific applications, using modern technologies such as .net, Python, Oracle SQL, and PL/SQL. Capable of working independently on most phases of software programming and require little guidance for more complex phases of development.\nDesign, code, test, and debug programs with minimal support from senior IT staff.\nMaintain and document programs in accordance with company best-practice standards.\nBe very familiar with relational database design, normalization, database links, stored procedures, triggers, views, queries, joins, etc.\nAssist in converting client requirements to designs as well as the ability to provide accurate project work estimates.\nDevelop solutions from detailed business and technical specifications.\nOwn and be involved in the planning and execution of software deployments and upgrades.\nIdentify the majority of risks associated with deployments.\nBuild out a complete design document to the full level of detail (navigation model, wireframes, workflow diagram, object model, detailed design) based on SRS requirements.\nWe value…\nA team environment that is collaborative, open, honest, and respectful.\nAsking questions, trying new things, and continually finding ways to work smarter.\nYou will receive...\nA competitive pay scale commensurate with your skills and expertise.\nA generous medical, dental, and vision benefits plan along with retirement plans.\nAn opportunity to grow both personally and professionally through our CX Academy.\nWork/life balance is something we are really committed to, not something we just talk about. We believe you should love your work and your play.\nA commitment to corporate transparency with quarterly all-company meetings.\nBeing part of a company that makes it their mission to respect, trust, and serve our clients and each other.\nWliBnalA82",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 17
    },
    {
        "title": "HMI Developer",
        "company_name": "Dexcent Inc",
        "application_link": "https://ca.indeed.com/company/Dexcent/jobs/Hmi-Developer-ef61eec7c1abdbda?fccid=2106499f949cae92&vjs=3",
        "application_details": [
            "Full-time",
            "Permanent"
        ],
        "job_description": "We are looking for HMI Developers to join our growing team at Dexcent. If you are skilled with developing operating screens using AVEVA’s OASyS XE, VB.Net and enjoy assisting clients with SCADA system migrations/implementations, this could be the right career move for you!\nAbout Dexcent\nFounded in 2006, Dexcent Inc. (Dexcent) is an engineering consulting firm that provides a range of specialized solutions for clients in a variety of industries throughout the world. Our professionals have modernized IT and OT engineering methodologies into comprehensive solutions, specializing in information analytics, cyber-security, infrastructure, and control systems engineering. As such, we pride ourselves on truly transforming industrial operations to optimize business performance and deliver bottom-line results.\nAbout the Candidate\nOur ideal candidate has:\n3+ years of industrial graphics design experience\nExperienced in graphics design for icon and bitmap creation\nVB.NET language knowledge, both in writing and debugging\nWindows Forms .NET or Java Swing experience\nKnowledge of scripting languages such as PERL, C#, Python\nKnowledge of SQL database interaction\nDiploma or Bachelor’s degree in Computer Science, graphic design, or equivalent combination of education and experience\nCompetent with MS Office tools and MS Office 365\nThe following would be preferred skills and experience, but not required:\n3+ years of related SCADA experience, AVEVA’s OASyS preferred\nKnowledge of interactive tools (Teams, Sharepoint, Outlook, Slack, One Drive, Remote Desktop)\nTechnical writing/documentation talents (end-user documentation, reports, flow diagrams, as-built drawings, etc.)\nPowershell and Command Line skills\nKnowledge of Windows abilities (working with Services, Active Directory, File Structure permissions, and shares)\nAbout the Role\nThe HMI Developer creates custom High Performance user interfaces aligned with client specifications. They work collaboratively with the client and Dexcent team members to meet project scope and timelines.\nDesign and develop High Performance HMI displays for SCADA systems (OASyS)\nLiaise with clients to develop and improve HMI display specifications and design guides\nDesign, create and edit custom bitmaps/images to be used in High Performance Interfaces\nConduct testing and participate in all testing phases (FAT, SAT, CAT)\nReport on project testing progress and resolve or escalate issues promptly\nInvestigate, troubleshoot, and resolve issues with design/code\nMaintain appearance and back-end code of all interfaces to comply with defined standards\nMigrate displays from one SCADA system to another, following the client/project design guide\nPrepare and maintain documentation as per project requirements, Dexcent and client standards\nComply with all relevant change management procedures\nAt Dexcent we recognize that people are our most important asset. We appreciate the diverse experience, knowledge, creativity, and personality that each person brings to our organization, our culture, and our success. If this sounds like the right career opportunity for you, apply today!\nJob Types: Full-time, Permanent\nBenefits:\nCasual dress\nCompany events\nDental care\nDisability insurance\nEmployee assistance program\nExtended health care\nLife insurance\nPaid time off\nProfit sharing\nWellness program\nWork from home\nSchedule:\n8 hour shift\nMonday to Friday\nExperience:\nWindows Forms: 1 year (preferred)\nVB.Net: 1 year (preferred)\nHMI development: 3 years (preferred)\nWork Location: Hybrid remote in Edmonton, AB T5S 1K6",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 18
    },
    {
        "title": "Quantitative Software Developer",
        "company_name": "Recruiting From Scratch",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4e29dfeff789f608&fccid=09e02654c2f26bbd&vjs=3",
        "application_details": [
            "$200,000–$350,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Quantitative Software Developer\nOur client is a financial sciences company, combining data analysis, invention, and rigorous inquiry to help solve the toughest challenges in investment management, insurance technology, securities, private equity, and venture capital.\nTheir team of scientists, technologists, and academics looks beyond the traditional to develop creative solutions to some of the world’s most complex economic problems.\nThey are seeking outstanding technologists with advanced mathematical and statistical abilities to join our team. Equal parts code specialists and mathematical problem solvers, our quantitative software engineers bring together technical and analytical expertise to grapple with difficult computational and data-related problems directly and implement efficient and innovative solutions. Entailing a sophisticated knowledge of algorithms, statistics, and high-performance computing, this effort has attracted ACM programming competition finalists, Top Coder contenders, and other highly technical, competitive problem solvers.\nQuantitative software engineers are responsible for bringing our wealth of ideas to fruition by:\nDesigning and implementing trading strategies;\nBuilding the tools and engines that bring our platforms and models to life!\nRequirements Include:\nAt a minimum, a bachelor's degree in computer science, applied mathematics, or another technical field from a top university.\nStrong programming skills utilizing technologies such as numpy, scipy, or scikit learn.\nExperience with scientific computing and algorithm development.\nA background or interest in building large-scale, real-time, and distributed applications is desired.\nExperience developing high-performance, multi-threaded applications using several programming languages including C++.\nKnowledge of scripting languages such as Python.\nWhile we analyze the data-rich domain of finance, financial experience is not a requirement.\nYou will enjoy the following benefits:\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\nSalary: Base: $200-500k\nWho is Recruiting from Scratch:\n\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 19
    },
    {
        "title": "Senior Software Developer",
        "company_name": "TELUS",
        "application_link": "https://ca.indeed.com/rc/clk?jk=f6e6f42468b2710b&fccid=1a93caa31afcad42&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Location: Edmonton, AB, CA Winnipeg, MB, CA Calgary, AB, CA Vancouver, British Columbia, CA Toronto, ON, CA Halifax, Nova Scotia, CA Regina, SK, CA\nReq ID: 32325\nJobs by Category: Operations\nJob Function: Engineering & Development\nStatus: Full Time\nSchedule: Regular\nDescription\nJoin our team\n\nBecome part of a future friendly national team, one that embraces change and initiates opportunity, has a passion for growth, believes in spirited teamwork, and has the courage to innovate. Our success is based as much on your dedication and hard work as it is on the innovative television, internet, voice, data and wireless products and solutions we offer.\n\nHere’s the impact you’ll make and what we’ll accomplish together\n\nAs part of our Smart Cities and Home Services team, you will imagine, create, support and test innovative smart cities and live streaming services for TELUS. This is an opportunity for you to develop solutions and designs for streaming video while providing our customers with the best video streaming experiences. We’re stretching the boundaries of what is possible, and supporting and enabling local communities to expand their audiences.\n\nHere's how\n\nProvide leadership and architectural support for CI/CD pipeline and software development practices for a small team of developers\nCreate, test, and support new systems and services that you help create, operating in a dev-ops team.\nBring familiarity with building and using containers and other cloud-native tools\nDevelop new architectures and technologies to deliver the best viewing experience for our customers.\nDevelop and maintain technical documentation and architecture\nApply best practices of software development in different frameworks and troubleshoot integration issues\nAutomate service testing to ensure reliable and repeatable results.\nEnsure a high level of code quality and integrity in software development projects\nWork with Project Managers and Network Planners to ensure the successful delivery of projects\nAn understanding of the importance of automation and continuous integration and deployment\nQualifications\n\nWhat you bring\n\n5+ years of software development experience utilizing CI/CD practices and agile methodologies\nExtensive experience with cloud-native tools and cloud environments (GCP and AWS)\nCapable of mentoring developers and sharing your knowledge\nStrong troubleshooting methodology\nAn interest in video streaming technologies\nInsatiable curiosity for problem solving, technology and innovation\nDesire to learn and take on new challenges\nAbility to collaborate with diverse groups and technical teams\nStrong verbal and written communication skills\nHaving a creative approach to problem solving and an ability to work independently in an environment with high levels of ambiguity\nAbility to manage key deliverables as part of an extended project team\nExcellent interpersonal skills, talented at developing and fostering positive relationships with other team members\nBachelors in Computer Science, Engineering or related discipline\n\nGreat-to-haves\n\nPython, Java, C#\nMySQL, MongoDB or equivalent databases\nDocker, Kubernetes, Istio, Ansible\nGitHub, AzureDevops, BitBucket, or equivalent source control repositories\nGithub Workflows, ArgoCD, Google CloudBuild, Helm or equivalent CI-CD pipeline tools\nAdaptive bitrate streaming including HLS, DASH, and CDN technologies\nVideo analytics powered by machine learning technologies\nFFHJOBS",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 20
    },
    {
        "title": "Fullstack Dev",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=e1b12c5bd930092f&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Description\nOur Client is seeking up to 17 Full Stack developers to join product teams for service innovation and digital transformation projects. Duties include leading technical discovery, collaborating with frontend designers, advising product owners, solution development and supporting ongoing documentation / maintenance / QA efforts.\n\nSkills\nJavascript, Python, C#, Laravel, Angular, React\n\nType\nContract\n\nExperience Required/Mandatory Skills\nExperience working as a Full Stack Developer in a cross-functional team delivering products/assignment deliverables.\nExperience working on production applications using modern application frameworks and frontend JavaScript frameworks with one or more of the following:\nPython/Django\nC#/ASP.NET core\nPHP/Laravel\nRuby on Rails\nExpressJS\nFrontend frameworks (Vue.js, Angular and/or React)\n\nNice To Have Skills\nExperience adapting to developing on unfamiliar technology stacks and contributing to projects with active codebases.\nExperience creating digital products using human-centred, service design and user research.\nExperience incrementally transforming existing legacy systems into modern digital services across multiple releases.\n\nLocation\nEdmonton\n\nWork Environment\n1 year with 1 possible 2-year extension\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 21
    },
    {
        "title": "Web Analyst / Developer",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1cb2bac06e1f5914&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract",
            "Remote"
        ],
        "job_description": "Description\nOur Client is looking for an experienced Systems Analyst to support multiple projects. The successful candidate will be responsible for supporting the existing code base, providing operational support, and developing enhancements to the system. The resource be a fast learner with an aptitude for understanding and maintaining complex systems\n\n\nSkills\n.NET, SQL, API, Agile\n\nType\nContract\n\nExperience Required/Mandatory Skills\nCompletion of a 4-year Computer Science or Engineering degree, or a 2-year Computer Engineering/System Technology diploma.\nFive (5) years of professional experience in application analysis, design, development, and optimization.\nFour (4) years of experience working with web front end languages, IE Javascript/Typescript, HTML, CSS, and at least one popular JS framework (React, Angular, Vue).\nFour (4) years of experience working with web back end object oriented languages such as Python, .NET, nodeJS, Java, etc.\nFour (4) years of experience working with SQL and/or NoSQL databases.\nDemonstrated experience building performant web APIs and a delightful UX.\nStrong communication skills. The ability to explain complex technical issues to both your peers and your stakeholders.\n\n\nNice To Have Skills\nExperience with Agile product delivery.\nExperience with cloud hosting providers (eg. Azure, AWS).\nExperience working with CI/CD Pipelines.\nExperience with TDD methodologies a plus.\n\n\nLocation\nEdmonton/Remote\n\nWork Environment\n6 months with optional extensions\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 22
    },
    {
        "title": "Job No. 22 – Developer/Software Engineer",
        "company_name": "Invenit Engineering Inc.",
        "application_link": "https://ca.indeed.com/company/Invenit-Engineering-Inc./jobs/No-Developer-Software-Engineer-dcd9d3e2adafa186?fccid=e1ec119ec41701ad&vjs=3",
        "application_details": [
            "$50,000–$90,000 a year",
            "Full-time"
        ],
        "job_description": "The ideal candidate will have a passion for building world-class software and a track record of success creating highly scalable software systems. You will need strong software development skills, excellent interpersonal communication, and can quickly iterate through versions of software to optimize solutions.\nEducation and Experience\nB. Sc. or M.Sc. in Computing Science or Engineering disciplinesOr equivalent experience and evidence of exceptional ability.\n3-5 years of relevant experience\nAPEGA Membership (if applicable)\nRequirements\nMust have:\nFull-stack and Desktop Developer\nExperience in .NET Framework, package management, and dependency injection\nGood unit testing and integration testing practices\nExperience in Software Architecture\nExperience with Visual Studio development in .NET\nFluent in GIT source code control (experience with GitLab preferred)\nBasic understanding of mechanical concepts\nExcellent interpersonal communication skills\nFamiliarity with embedded systems\nOwning assignments and taking full accountability for overall team success\nFull-stack and Desktop Developer\nExperience in .NET Framework, package management, and dependency injection\nGood unit testing and integration testing practices\nExperience in Software Architecture\nExperience with Visual Studio development in .NET\nFluent in GIT source code control (experience with GitLab preferred)\nBasic understanding of mechanical concepts\nExcellent interpersonal communication skills\nFamiliarity with embedded systems\nOwning assignments and taking full accountability for overall team success\nNice to have:\nDatabase experience (MySQL, SQL Server) and good knowledge in query optimization\n.NET Core Blazor, angular, python\nPCB design and Firmware / embedded system development\nResponsibilities\nDevelopment of data processing/display and customer interface software, custom UI component creation\nAssist with development of firmware to collect and store data from embedded sensors\nCreate documentation and product training materials\nPromote software engineering best practices via code reviews, building tools and documentation\nLeverage your existing skills while learning and implementing new, open-source technologies as the company grows\nJob Type: Full-time\nSalary: $50,000.00-$90,000.00 per year\nBenefits:\nDental care\nDisability insurance\nExtended health care\nLife insurance\nOn-site parking\nPaid time off\nProfit sharing\nVision care\nFlexible Language Requirement:\nFrench not required\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nEdmonton, AB T6E 5P3: reliably commute or plan to relocate before starting work (required)\nWork Location: Hybrid remote in Edmonton, AB T6E 5P3",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 23
    },
    {
        "title": "GIS Full stack developer",
        "company_name": "Fujitsu",
        "application_link": "https://ca.indeed.com/rc/clk?jk=17df0485402a2651&fccid=0d771a787e6e10bd&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "As a leader in digital transformation and a pioneer in innovation, Fujitsu Canada offers a complete portfolio of IT services to support our customers in their journey to create value, improve their customer experience or increase operational efficiency, including helping them on their journey to cloud computing. At Fujitsu, you are part of our family and culture. We offer you:\n\nLocal, personalized career support with the kind of advancement opportunities and projects that only a global company can provide\nA training program tailored to your career plan and goals\nWork-life balance, because we believe that your success depends on balance\nThe opportunity to work remotely with distributed, multicultural teams working for some of our local customers, our North American remote delivery center or our internal projects\nRespect and equality: Fujitsu has been selected for the third year in a row by the Human Rights Campaign as one of the best companies to work for LGBTQ equity.\nFujitsu's organizational model includes several North American centers of excellence, including the Geomatics Center of Excellence (GCE). The latter covers all of Fujitsu's North American offices and carries out projects around the world, largely from Quebec. With more than 30 years of history, our GCE now has close to 100 geomatics specialists working exclusively on geomatics development projects, and we are still growing. For those interested, some opportunities even allow you to relocate at our expense, or to travel and experience other languages and cultures.\nThe following full-time, permanent position within CEG is open to any candidate located in Canada. Are you passionate about geomatics solutions? Are you willing to share your geomatics knowledge with other geomatics enthusiasts? Do you enjoy learning about new geomatics technologies? Do you envy people who have the opportunity to participate in different types of innovative geomatics projects? If so, then this position may be for you.\nHere, CEG is helping its client make several important transformations to achieve its goal of becoming \"the most efficient Class 1 railroad on the continent.\" Over the past sev\neral years, approximately 20 Fujitsu professionals have been actively involved in the development and implementation of several large-scale strategic geomatics projects.\nUnder the supervision of the Project Manager, the Full Stack GIS Developer designs and develops applications to support the business needs of various internal projects, in particular applications available in connected and disconnected mode.\nRequirements\nBachelor’s degree in computer science\n3-5 years of experience\nStrong expertise in JavaScript\nExperience in JavaScript frameworks such as Angular JS, React or Amber\nExperience in Server-side languages such as Python, Ruby, Java, PHP, or .Net\nKnowledge of SQL, Oracle, PostgreSQL\nKnowledge of Python\nFamiliarity with DevOps tools\nExperience in API Building and API integration\n#LI-KP1",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 24
    },
    {
        "title": "Application Developer, Digital Solutions",
        "company_name": "Stantec",
        "application_link": "https://ca.indeed.com/rc/clk?jk=99e53c96e447de4d&fccid=f1582c464db8553b&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Application Developer, Digital Solutions - ( 230000QD )\nDescription\nStantec Digital Solutions is a unique cloud-based product and consulting team. We pride ourselves on being customer obsessed and highly focused on Digital Science & Engineering transformation. As a company of 26,000 Scientists & Engineers we have a large internal and growing external customer base consisting of highly technical staff.\nYour Opportunity\nThis position requires the candidate to have the ability to creatively leverage new and innovative technologies to successfully implement cloud solutions for our clients. The candidate will work with the development team locally and globally as part of a growing group of engineering technologists.\nYour primary focus will be responding and working with the lead developer of a project or team and learning the codebase. At Stantec, we need a Mid to Senior Cloud Application Developer who can process the needs of a user/consumer to adapt software for computer programs, draft new applications, develop and tests source code, and trouble shoots software applications.\nYour Key Responsibilities\nWillingness to experiment & learn\nAbility to leverage new technologies to create innovative solutions to engineering related projects and tasks\nWork independently and with team members to develop new SaaS, Web and Mobile Solutions in a variety of platforms using Scrum and Agile practices\nImplement technical project work using DevSecOps workflows\nProvide application or site-wide performance optimization and capacity planning\nResearch, evaluate and recommend software and technology packages\nCoordinate with development team members using fit for purpose project methodologies\nAttend daily development stand up meetings to share and learn lean work practices\nQualifications\nYour Capabilities and Credentials\nSolid understanding of new and existing development platforms and environments\nStrong understanding of coding structures, patterns, and database principals\nExperience in emerging web languages, microservice architectures and frameworks\nExperience with Microsoft Azure Cloud Services and Azure Devops is a plus\nStrong programming Experience with C#, .NET Technologies\nExperience with Java, JavaScript, HTML, CSS, Vue, Angular\nExperience with SQL Server, SSMS, Report Builder, PostgreSQL, Mongo DB, Cosmos DB\nProficient understanding of version control, testing, workflow, and document tools (GIT, DevOps, Jira, Confluence, SonarQube)\nEngineering Experience and broad knowledge across major engineering disciplines is a plus\nExperience with Python is a plus\n5 years of experience programming, database development, cloud environments\nEducation and Experience\nMinimum acceptable levels of education include and experience:\nBachelor’s in Computer Science or a related field\nMicrosoft Azure Certifications\nMinimum of 5 years of coding experience\nTypical office environment working with computers and remaining sedentary and looking at a screen for long periods of time. Office environment may also be restricted to the applicant’s home office. Home offices must provide ergonomically suited setups to give the employee proper comfort and posture for extended periods of time.\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\nPrimary Location : Canada-Alberta-Edmonton\nOther Locations : Canada-Nova Scotia-Dartmouth, Canada-British Columbia-Vancouver, Canada-Ontario-Ottawa, Canada-Ontario-Toronto\nOrganization : BC-1299 Innovation-Digital Solutions-Canada\nEmployee Status : Regular\nJob Level : Individual Contributor\nTravel : No\nSchedule : Full-time\nJob Posting : Feb 21, 2023, 1:25:04 PM\nReq ID: 230000QD\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 25
    },
    {
        "title": "Intermediate Full Stack Developer",
        "company_name": "48Hour Discovery",
        "application_link": "https://ca.indeed.com/company/48Hour-Discovery/jobs/Intermediate-Full-Stack-Developer-b723ee0105ac8885?fccid=bdc3a61227558668&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Founded in 2017, 48Hour Discovery (48HD) is a Canadian biotechnology company with headquarters in Edmonton, AB and satellite sites in San Diego, California and Seoul, South Korea. The 48HD genetically-encoded platform technology offers rapid discovery of pharmaceutical leads in the peptide / macrocycle therapeutic space to major pharmaceutical companies (example: https://tinyurl.com/yyvv626v). We are seeking an entry level Full Stack Web Developer to become a contributor to our data and project management platform.\nAs the Full Stack Web Developer, your responsibilities include, but are not limited to, database development and maintenance, creation of data management, analytics and visualization applications, and maintenance of existing web applications.\nDuties & Responsibilities:\n● Design, develop and maintain user-friendly website\n● Confer with teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions\n● Direct input and feedback on user experience and design interactions, and help inform technical decisions\n● Build, test and deploy new features for modern web applications\n● Clear communication with stakeholders on expectations and timelines\n● Write clean and well documented code\n● Evaluate code to ensure it meets industry standards, is valid, is properly structured and is compatible with browsers, devices, or operating systems\n● Adhere to security policies to encrypt all data on electronic devices, such as laptops, desktops, and USB drives, to prevent unauthorized access, data loss or confidentiality breaches\n● Identify problems uncovered by testing or customer feedback and correct problems or refer problems to appropriate personnel for correction\nRequired Skills & Experience\nYou will need to be highly proficient with the following technologies and practices.\n● Hands-on full stack web development experience\n● Experience with Python web frameworks, such as Django and Flask\n● Proficiency with object oriented programming and design such as Python\n● Solid database skills in a relational database (MySQL)\n● Experience and in-depth knowledge with Linux-based development\n● Experience with AWS environment is a must\n● Experience using git for version control\n● Ability to balance competing priorities in a dynamic and fast-paced environment\n● Proficiency with fundamental front-end languages such as HTML, CSS, etc\n● Proficiency with JavaScript frameworks such as jQuery\n● Efficient written and verbal communication skills with the ability to present to a wide range of audiences\n● Excellent attention to detail, analytical and organizational skills\nJob Type: Full-time\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nEdmonton, AB: reliably commute or plan to relocate before starting work (required)\nWork Location: One location",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 26
    },
    {
        "title": "ETL Analyst / Developer",
        "company_name": "Vantix Systems Inc",
        "application_link": "https://ca.indeed.com/rc/clk?jk=9a77282c4b80c057&fccid=696ed17e5535043f&vjs=3",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "Description\nOur client requires an experienced and versatile Senior ETL Analyst / Developer to support a strategic Enterprise Resource Planning (ERP) program to replace its legacy Records Management System (RMS). Responsibilities will focus on development of a data pipeline to extract, load, and transform (ELT) legacy data from NicheRMS version 5 to NicheRMS UA. Additional responsibilities include cleansing of the legacy data and transformation of structured and unstructured data which has been customized in the legacy RMS.\nThe successful candidate must have prior experience developing a data pipeline to migrate data, including implementation planning and post-implementation support, with a strong track record of successful delivery working with minimal direction in an ambiguous environment.\nLocation is HYBRID. 1 day per week on site in Edmonton, Alberta.\n\n\nSkills\nETL, .NET\n\nType\nContract\n\nExperience Required/Mandatory Skills\nDegree in Information Technology, Management Information Systems, Computer Science or similar post-secondary education\n10+ Years of experience as a Data Engineer, Software Developer, and/or Database Administrator (DBA)\nExpert knowledge of data types, data objects, and Entity Relationship Diagrams\nExpert knowledge of SQL\nExperience developing data pipelines\nExperience with data migration, data transformation, and data cleansing of structured and unstructured data\nExcellent written and verbal communication skills\n\n\nNice To Have Skills\nExpert knowledge of programming and scripting languages such as C#, Java, Python, R, Ruby, and Scala\nKnowledge of data security is an asset\nExperience in large ERP implementations with a focus on records management and/or financial software\nExperience with NicheRMS is an asset\n\n\nLocation\nEdmonton\n\nWork Environment\n1 Year plus option years\n\nHourly Rate\nNegotiable",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 27
    },
    {
        "title": "22-083- Automation Web Developer",
        "company_name": "Raise",
        "application_link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Da55cD5SyBLpPH7k1CrVrulUOH2z8rmQzTVue5eMZiIUHHPnGyVifNivyuI3DKZo4uRXphZw5cA74loApfzbpEfgY34dpAH7ov2BfyrpLM_AgRvEbveLKobtxTc81fgio7yQPXagz6IJplykFWht3mps8FIq8FU51oS_Bal-X55DKDcA14kDel8ifpAF2oUCcNHCzMr7vObmCDSiCMj8jLQIXVgGb5S3m0d1WI4vrPziLXp5gGt5lNgfUJkxqONrMf_K5XBB_3ucK69EEIJyDQOibAILdBntiA6Yv9kVNpzEouJnn5fdP4qqD_Xoqr4I7lp0WzKpAnxrD9Wc_zXle2o_0SncvmmpKh9-1qN_uXnOLqWmBwJxh_-w46F7qo_KPLEwEh-lFH9Gf7Sn06A0rbJ8cR_ObQB7Z1I0cJydv29MKXMHv2aES-EPXhKtQURyloF3-zXP_dD6NUhom2834Gy7LpDqZgIjtBAHChrlPq2z5CdeYuJhJP78_33pc5oPOAItxIXT6ECXh4PWH9L882STf7-D--OL8mOjzf1eoMAdJusRc1SlWtFevJ72_TEb6_uQO3QWAyZc45eY2yzuuI-JsZiVzMCWLJqK7yzKAH30YuhvyQ8RszxR4sWxXEpVZYx9CXikPca0wvusuyG8BWrLw0fWLZ0pVcD2oGTEq816MEXlJ_gYNEfB3fZw3kPyqLWYV-pi6xFvvlV18SA9ZyspFMKA1j5zeMo989RnEZiGcA_-sDhqSlXBx3LS8k7eZaIoxig9JkaVDFEQyl6CUm&xkcb=SoBN-_M3SaY-aZTU750JbzkdCdPP&p=13&fvj=0&vjs=3&tk=1gqq8cdfs2b2g001&jsa=9964&oc=1&sal=0",
        "application_details": [
            "Fixed term contract"
        ],
        "job_description": "We are currently requesting resumes for the following position: Automation Web Developer\nResume Due Date: March 6th 2023 (5:00PM EST)\nNumber of Vacancies: 1\nDuration: 1 year\nLocation: 800 Kipling Avenue, Toronto\nHours: up to 35 hours per week\n\nJob Overview\nDevelop data automation tools between different platforms and applications.\nDevelop Graphical User Interfaces for web-based applications.\nDevelop back-end requirements to connect to developed GUIs.\nDeploy web-based applications on Azure cloud services.\nDevelop and deploy MS Power Apps and Power BI dashboards, and create Microsoft Power Automate flows.\nDevelop data automation macros among various Excel files using VBA macros.\nOther duties as required.\nQualifications\nExperienced in python-Django framework is required.\nExperienced in C#, .NET programming languages such as ASP.NET, XML/HTML 5/CSS, Bootstrap, and jQuery/JavaScript, SLDC, CI/CD, Deployment, Multi-tenant Architecture, & Docker.\nExperienced in web API development for web-based applications.\nExperienced in development and deployment of web services to connect applications (e.g. AS9) to Azure services.\nExperienced in database design and development using SQL Azure, Azure SQLite, and Microsoft SQL server.\nExperienced in working with various component of Azure platform and web app deployment on Azure.\nExperienced in RPA applications, such as UI-Path and UI-Flows.\nExperienced in version control tools such as VSS and Git.\nExperienced in VBA programming.\nBachelor’s degree in computer science, engineering, science, or related programs is required.\n\n#NUC #MON",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 28
    },
    {
        "title": "Software QA Manager",
        "company_name": "Willowglen Systems Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=5d83c5dd3fcf3694&fccid=39acf37d544c82a2&vjs=3",
        "application_details": [],
        "job_description": "Location: Edmonton AB / Calgary AB\nOur Company\nWillowglen Systems is an innovative company delivering industrial automation solutions for the last 50 years. Our products are developed and supported by our team of developers, data scientists, mathematicians, and engineers. Willowglen Systems has a global customer base and is chiefly involved in the metro-rail, oil and gas, pipelines, electricity distribution, and water distribution sectors – in locations including North America, South America, Asia, and the Middle East.\nAt Willowglen Systems, we pride ourselves on our innovative solutions and the meaningful impact we have on mission-critical industries.\nAbout the Role\nWillowglen Systems is looking for a Software QA Manager to join our talented team. As a member of the Quality Assurance Team, the QA Manager is involved in aligning long-term solutions for testing/testability including road maps, tools, framework & approach. The QA Manager interacts with the software team to structure solutions that result in the solution being efficient and that can be easily tested. They take ownership of each product solution from a testing perspective and recommend best practices or adjustments to proposed product architecture while applying good engineering methodologies and practices.\nThe QA Manager will be responsible for contributing to the design of solutions and establishing testing parameters and methodology in delivering integrated enterprise SCADA solutions for Willowglen System clients implementing our SCADA product in key market segments such as MetroRail, Oil and Gas, Pipelines, and Power. The ideal candidate will have the ability to understand the customer perspective with respect to their operational business use-needs within their industrial technical system implementation environment.\nScope\nQA team management and administration\nTechnical lead for the QA team\nDeveloping and implementing the technical QA roadmap\nIncreasing testing efficiencies, developing processes and methodologies, and enhancing test processes to test web applications\nMentoring and assisting your colleagues\nEnsure processes and standards are followed\nHelp maintain a focus on producing high-quality products in an innovative culture. QA is a full partner in the software development process.\nKey Responsibilities\nTeam management including performance management, hiring, training and development, etc.\nCollaboration with project teams to align long term solutions for testing/testability including road maps, tools, framework and approach\nAnalyze and define testing processes to fill the gaps between current processes and industry-standard best practices\nProvide guidance, training, and mentoring to colleagues regarding the implementation of testing automation processes and best practices as needed\nDevelop automatic test tools and formulate KPIs to highlight automation\nDevelop and implement testing strategies for cybersecurity and machine learning applications\nPerform additional testing activities as required based on customer deliverables\nRequired Qualifications\nTeam management experience\n5+ years of experience using GitLab, Maven, Jenkins, Docker\n5+ years of experience working with automation tools and frameworks, such as Selenium, Cucumber, IntelliJ, Karate, Appium,\nExperience with developing test plans and tools for new software products\nBachelor's Degree and at least 5 years of experience in QA\nObject-oriented programming experience required.\nExperience in Java, Python, CSS, JavaScript, C++, PHP, etc.\nAdvanced knowledge of MySQL or similar\nExperience with bug tracking/workflow management tools (preferably JIRA)\nExperience in testing cyber security and machine learning applications is considered an asset\nAre you up for the challenge? Join Our Team https://www.youtube.com/watch?v=_JWHLsToaxE\nOur Mission\nWillowglen’s mission is to be a global leader in delivering visionary, customer-driven industrial automation solutions.\nOur Values\nRespectful - We take the time to listen and understand each other, and this fosters feelings of mutual trust, safety, camaraderie, and well-being.\nAgile - We are a customer-centric, responsive, and collaborative organization. We are quick to learn, adapt and respond to changing circumstances.\nInnovative - We value and support innovation thereby allowing people to be innovative. We are always striving to deliver superior solutions.\nOur Benefits\nExtended Health and Dental Benefits\nEmployee Assistance Program\nRRSP matching\nHealth Spending Account\nPaid Volunteering Time\nRemote/Hybrid work policy\nFlexible schedule options\nMonthly corporate lunches\nGreat Place to Work Certified\nOpportunities for training and career growth\nContinuing education and professional certification reimbursement\nOpen and inclusive work environment\nWillowglen Systems Inc. is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills, and experiences within our workforce. We thank all the applicants for their interest in this position; however, only those selected for an interview will be contacted by our recruitment team.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 29
    },
    {
        "title": "Data Quality & Integration Analyst (FT)",
        "company_name": "Effortless Admin Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4717528b90695581&fccid=86324db8ad149a2f&vjs=3",
        "application_details": [
            "Cover letter",
            "Full-time"
        ],
        "job_description": "Data Quality & Integration Analyst\nEffortless Admin Profile:\nEffortless Admin is Canada’s leading benefits administration software and service company. Our platform is fully web-based and provides employers with an elegant way of managing employee benefits. We are an expanding organization looking for motivated individuals who want to be part of our growth trajectory.\nFull-Time, On-Site:\nThe Data Quality & Integration Analyst position is a full-time permanent position with a competitive compensation and benefits package, based on-site in Edmonton, AB.\nThis Role Is Important:\nThis role requires taking ownership of a large and diverse number of complex data integrations. The successful candidate will join a high-performing team of experts in a dynamic and growing company. This role offers crucial support to our internal developers, client service team, and a wide range of integrated partner platforms, including insurance carriers, specialty benefit providers, and HRIS/Payroll platforms.\nIdeal Candidates:\nThe ideal candidates must:\nMust love technology\nMust be keen to immerse themselves in the data and the details of our business\nMust enjoy working with others on proactive problem-solving and solution-building.\nWritten and verbal communication skills are a must to ensure efficient issue resolution and because this role will necessarily support non-technical team members and partner representatives.\n\nWhat’s in it For You:\nJoin a collaborative team with over a century of collective experience in data quality management and analysis\nWork in a leading technology company during its major growth phase\nSolve complicated and challenging data problems while learning from the best minds in employee benefits\nSupport a wide variety of clients and stakeholders across Canada\nBe part of ushering in the future of employee benefits technology\nA flexible company with personality and heart\nCompetitive compensation and robust benefits package\n\nJob Description | (Some of) What You’ll be Doing:\nDeveloping transferable skills in data integration implementation and data quality analysis\nHaving customer-facing conversations independently on a regular basis, and being able to articulate data quality nuances and issues to the customer so that the customer can understand the root cause and any resolution necessary\nTaking ownership of all integration tasks with employers and insurance carriers\nLearning new tools and technologies as Effortless Admin evolves its technology stack and adopts the latest methodologies and practices in the cloud\nCreating value for Effortless Admin’s customers by ensuring high-quality, high-trust data\nFurthering your abilities as a subject matter expert in employee benefits data\nWorking independently in completing data quality and data integration tasks\nContributing meaningfully to process improvements for the team\n\nApplicant Requirements:\nEagerness to learn, a detail-oriented mindset\nExperience with the principles of data analysis and data quality\nAbility to query and manipulate relational databases with SQL\nEffective written and verbal communication skills\nA passion for creative and collaborative problem solving\nAbility to share data quality analysis results with customers (via Excel and other tools)\nAbility to adapt to changing technology and employee benefits environments\n\nPreferred Qualifications:\nBachelor’s degree in a STEM or quantitative field, or equivalent technical experience\nExperience with value-based care models\nExperience in an agile environment\nAdvanced SQL skills or familiarity with other languages such as Python\nExperience using collaboration tools such as Asana and Jira\nExperience analyzing employee benefits data (claims and/or employee records)\n\nApply Now!\nWe welcome anyone eager to contribute to the best benefits administration solution in the industry. If this position interests you and you meet the above requirements, please submit your resume and cover letter to: careers@effortlessadmin.com.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 30
    },
    {
        "title": "Manager of Software Development (.Net) - RBCx Ventures (Dr. Bill)- Remote- Canada",
        "company_name": "Royal Bank of Canada",
        "application_link": "https://ca.indeed.com/rc/clk?jk=286ebe32b8821505&fccid=537b899e30af3338&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Come Work with Us!\n\nAt RBC, our culture is deeply supportive and rich in opportunity and reward. You will help our clients thrive and our communities prosper, empowered by a spirit of shared purpose.\n\nWhether you’re helping clients find new opportunities, developing new technology, or providing expert advice to internal partners, you will be doing work that matters in the world, in an environment built on teamwork, service, responsibility, diversity, and integrity.\nJob Title\nManager of Software Development (.Net) - RBCx Ventures (Dr. Bill)- Remote- Canada\nJob Description\nWhat is the opportunity?\nThis role is 100% remote in Canada only\nRBCx pursues big, bold ideas and leverages RBC’s extensive experience, networks, and capital to help shape what’s next. Our four pillars – Banking, Capital, Platform, and Ventures – combine to support tech businesses of all sizes and stages, making us the go-to backer of Canadian innovation. Our people are our most valuable assets, which is why we invest deeply in making sure RBCx isn’t just a place to work, but a place to belong. We’re currently looking for ambitious trailblazers and curious minds who want to help grow the next generation of Canadian tech companies. If that’s you, we can’t wait to connect.\nAbout Dr. Bill\nDr. Bill is an RBCx Ventures company that is working to take the pain out of medical billing and get doctors paid accurately. We are a high-growth company that currently serves 3,000+ doctors across 3 provinces. You’ll join as an employee of RBC and get all the perks of working for a big company, but with a start-up mindset and the agility to move quickly.\nWhat will you do\nManage a team of skilled .NET developers and ship high-quality code based on product requirements\nContribute to the architectural design of key components of the .NET application\nLead & participate in code reviews, architectural planning, and delivery meetings\nProvide leadership and expert counsel in establishing and implementing standards, guidelines, and best practices\nEffectively contribute suggestions and new ideas to improve our platform.\nDesign, develop, maintain and deploy well-tested services\nWrite high-quality, well-tested code while understanding business needs\nWhat do you need to succeed?\nMust-have:\n4+ years of solid hands-on experience with C#, .NET Framework, .NET Core, MVC, Rest, relational databases\n2+ years of leading, managing, or mentoring technical teams\nOversee multiple complex tasks, seeking to reduce complexity through architectural thinking, and handling multiple conflicting priorities effectively\nLimited direction required and began to reduce ambiguity for direct reports\nExperience in Unit/Integration testing\nExperience with JavaScript/HTML/CSS\nParticipate in code reviews, architectural planning, and delivery meetings\nYou’re a team player, and enjoy collaborating with the product, design, and engineering teams to solve problems\nYou learn new concepts quickly (industry, business, and technical)\nYou have excellent written and verbal communication skills\nYou care deeply about application security and understand the importance of protecting sensitive user data\nNice-to-Have\nExperience with ORM Solutions (i.e., Entity Framework/NHibernate)\nPost-secondary degree or diploma in computer engineering or equivalent training/experience\nExperience with compliance standards, e.g., ISO 27001 or SOC 2\nExperience building apps in a cloud environment (i.e. Docker/Kubernetes)\nExperience with Python and Rust\nFamiliarity with Open API Specification\nWhat’s in it for you?\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\nA comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable\nLeaders who support your development through coaching and managing opportunities\nAbility to make a difference and lasting impact\nWork in a dynamic, collaborative, progressive, and high-performing team\nA world-class training program in financial services\nFlexible work/life balance options\nOpportunities to do challenging work\n#LI-Remote\nJob Summary\nAddress:\nTORONTO, Ontario, Canada\nCity:\nCAN-ON-TORONTO\nCountry:\nCanada\nWork hours/week:\n37.5\nEmployment Type:\nFull time\nPlatform:\nTechnology and Operations\nJob Type:\nRegular\nPay Type:\nSalaried\nPosted Date:\n2023-02-03-08:00\nApplication Deadline:\n2023-03-31-07:00\nInclusion and Equal Opportunity Employment\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at rbc.com/careers.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 31
    },
    {
        "title": "Senior Software Developer",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fb07b31602c28b79&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Senior Software Developer\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for a Senior Software Developer who values mastery, authenticity, and positivity to help build and grow our product. While focusing on backend development, with our small, agile team you'll get a chance to design, build, and improve each part of our tech stack, while providing guidance and technical direction.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\n\nImproving our backend infrastructure\nExpanding the capabilities of our system\nEvolve our core platform including our data collection and decision engine, which collects and processes terabytes of shopper behavioral data of tens of millions of online shoppers each month.\nHelp shape the architecture and infrastructure decisions and operations that drive our applications and allows batch and streaming data pipelines that move data around our ecosystem as we continue to scale.\nBuild infrastructure to support the evolution of our shopper interaction toolset.\nMentor other engineers, participate in code reviews, and share knowledge.\n\nABOUT YOU\nExperience building distributed and scalable client-server architectures.\nUnderstanding of scalable client-server architectures.\nStrong SQL experience and experience with ETL methodologies\nExperience with enterprise server-side web apps\nBachelor's degree in computer science, engineering, or equivalent degree / experience.\nSource control (Git) and familiarity with Unix command line\nExperience with championing Agile principles within a dev team\nPassionate about mentoring junior engineers\nTeam-focused and people-centric, able to give feedback as well as receive it.\nCurious, constantly looking for better ways to build things and excited to learn about emerging technologies.\n\nBONUS\niOS and Android app or library development experience (ideally in Swift and Kotlin)\nIntegrating with analytics packages such as Google Analytics and Omniture\nCloud Technologies such as Amazon Web Services\nRuby / Ruby on Rails, SQL, Redis, Python, Hadoop, and/or Spark\nUnderstanding of machine learning\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 32
    },
    {
        "title": "Data Quality & Integration Analyst",
        "company_name": "Effortless Admin Inc.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fd0da5b55e4dad95&fccid=86324db8ad149a2f&vjs=3",
        "application_details": [
            "Cover letter",
            "Full-time",
            "Permanent"
        ],
        "job_description": "Data Quality & Integration Analyst\n\nEffortless Admin Profile\nEffortless Admin is Canada’s leading benefits administration software and service company. Our platform is fully web-based and provides employers an elegant way of managing employee benefits. We are an expanding organization looking for motivated individuals who want to be part of our growth trajectory.\n\nFull Time | On Site\nThe Data Quality & Integration Analyst position is a full-time permanent position with a competitive compensation and benefits package, based on-site in Edmonton, AB.\n\nThis Role Is Important\nThis role requires taking ownership of a large and diverse number of complex data integrations. The successful candidate will join a high-performing team of experts in a dynamic and growing company. This role offers crucial support to our internal developers, client service team, and a wide range of integrated partner platforms, including insurance carriers, specialty benefit providers, and HRIS/Payroll platforms.\n\nIdeal Candidates\nThe ideal candidates must: (1) love technology, (2) be keen to immerse themselves in the data and the details of our business and (3) enjoy working with others on proactive problem solving and solution building. Written and verbal communication skills are a must to ensure efficient issue resolution and because this role will necessarily support non-technical team members and partner representatives.\n\nWhat’s in it For You\nJoin a collaborative team with over a century of collective experience in data quality management and analysis\nWork in a leading technology company during its major growth phase\nSolve complicated and challenging data problems while learning from the best minds in employee benefits\nSupport a wide variety of clients and stakeholders across Canada\nBe part of ushering in the future of employee benefits technology\nA flexible company with personality and heart\nCompetitive compensation and robust benefits package\n\nJob Description | (Some of) What You’ll be Doing\nDeveloping transferable skills in data integration implementation and data quality analysis\nHaving customer facing conversations independently on a regular basis, and be able to articulate data quality nuances and issues to the customer so that the customer can understand the root cause and any resolution necessary\nTaking ownership of all integration tasks with employers and insurance carriers\nLearning new tools and technologies as Effortless Admin evolves its technology stack and adopts the latest methodologies and practices in the cloud\nCreating value for Effortless Admin’s customers by ensuring high quality, high trust data\nFurthering your abilities as a subject matter expert in employee benefits data\nWorking independently in completing data quality and data integration tasks\nContributing meaningfully to process improvements for the team\n\nApplicant Requirements\nEagerness to learn, a detail-oriented mindset\nExperience with the principles of data analysis and data quality\nAbility to query and manipulate relational databases with SQL\nEffective written and verbal communication skills\nA passion for creative and collaborative problem solving\nAbility to share data quality analysis results with customers (via Excel and other tools)\nAbility to adapt to changing technology and employee benefits environments\nPreferred Qualifications\nBachelor’s degree in a STEM or quantitative field, or equivalent technical experience\nExperience with value-based care models\nExperience in an agile environment\nAdvanced SQL skills or familiarity with other languages such as Python\nExperience using collaboration tools such as Asana and Jira\nExperience analyzing employee benefits data (claims and/or employee records)\n\nApply Now!\nWe welcome anyone eager to contribute to the best benefits administration solution in the industry. If this position interests you and you meet the above requirements, please submit your resume and cover letter to: careers@effortlessadmin.com.\n\nFor more information, please contact:\nMelanie Ross, Human Resources Advisor\nEffortless Admin\n#240, 4936 - 87 Street\nEdmonton, AB\nT6E 5W3\n1.780.920.5683",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 33
    },
    {
        "title": "Senior Data Scientist",
        "company_name": "Granify",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4c088257e8e7f9e6&fccid=38c6cd539770f252&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Senior Data Scientist\n\nGranify is a rapidly growing technology company at the intersection of e-commerce, machine intelligence, and psychology. We’ve received investment from top investors, built a world-class team and a world-class product, and in the last year alone we generated over $650 million in incremental sales for many of the world's largest retailers!\n\nWe’re searching for an experienced Senior Data Scientist (5+ years of experience) who values mastery, authenticity, and positivity to help build and grow our product. As a key member of our Data Science team, you will work with and analyze vast amounts of behaviour and transaction data, and design and implement algorithms which predict e-commerce shopper actions and needs. This includes - but goes well beyond - recommendations. This is an amazing opportunity to design algorithms which will be responsible for helping and influencing real shoppers across the world in real-time! We have access to and act on millions of shopper sessions per day. If you are a highly technical, hands-on, and mission-driven person who has a passion for solving problems in the area of ML/AI and e-commerce optimization, then this is the role for you.\n\nThis is a full-time position. We are centrally located in Edmonton, but remote applications will also be considered.\n\nRESPONSIBILITIES\nDevelop new and improve existing ML models that guide our interactions with shoppers\nHelp design and create ML/AI based tools to interact with shoppers\nEvaluate performance statistics at an extremely detailed level and present insights and recommendations to teammates.\nAnalyze, interpret and use machine learning and data mining algorithms on the enormous amount of behavioural and transactional data\nRecommend new experiments supported by your findings and research\nDissect online stores’ shoppers data to identify opportunities to increase conversion, order value, lifetime value, and customer delight\nWrite code to implement your experiments\nWork closely with our developers and engineers to bring your new experiments to life\nSolve a wide variety of complex problems as they arise that will often require significant analysis of our data, research and deep thinking\nParticipate in brainstorming sessions with your teammates to determine opportunities for improvement and experiments\nResearch, design and prototype intelligent systems with the aim of enhancing online shopper experience.\nKeep up-to-date with the latest papers in artificial intelligence and machine learning to propose solutions for real problems in e-commerce.\nHelp to build infrastructure to support the evolution of our shopper interaction toolset\nCollaborate with other DS team members, mentor junior DS, participate in code reviews, and share knowledge.\nParticipate in active maintenance and code reviews in a large codebase, suggesting and implementing changes as appropriate.\nTroubleshoot, test, and debug to your heart’s content.\n\nABOUT YOU\nBSc (Msc/Phd preferred) in Computer Science, Machine Learning, Artificial Intelligence, Statistics, Mathematics, Engineering, Physics, or a related discipline, with (at minimum) graduate-level courses in machine learning, or equivalent practical experience.\nAt least 5+ years of real-world experience implementing Machine Learning models\nComfortable jumping into an existing ML modelling code base\nProficient in at least one programming language, preferably Python (focus on ML)\nDemonstrated ability to apply statistical or data mining techniques to solve real problems\nAbility to organize, interpret, and analyze large amounts of data\nAdvanced skills and experience in machine learning and data mining\nStrong research experience in machine learning, preferably in one or more of the following (in no particular order):\nUnsupervised and Supervised Learning\nReinforcement learning\nRecommender and/or ranking systems\nDeep learning and deep generative models\nComputer vision\nNLP\nIntimately familiarity with the DS workflow:\nData gathering and cleaning\nFeature engineering\nModel design, coding, hyperparameter tuning and validations\nProficient in deep learning frameworks like Tensorflow, PyTorch, etc. and scientific computing packages like NumPy. Able to implement an algorithm as described in an academic paper using these frameworks in quality code.\nKnowledge of various ML and statistical tools and libraries (e.g. TensorFlow, sciPy, R, and similar)\nGood intuition for applying ML/AI theory to make business-oriented products with minimal guidance.\n\nBONUS EXPERIENCE\nExperienced using shopper data\nWorked with ‘Big data’\nHands-on Knowledge of distributed computing frameworks (e.g. Spark, AWS, Flink)\nExperience in online advertising/marketing analytics, behavioral targeting or web analytics\nExperience with distributed databases\n\nOUR TECH STACK\nWe are using AWS cloud and the ML stack includes Python, TensorFlow, Spark, DataBricks and Hadoop. We have dedicated Data Engineers and Software Developers who provide support and tools needed for research and help with implementation of research outcomes.\n\nABOUT GRANIFY\nGranify merges machine intelligence and digital psychology to automatically increase sales for retailers. This is the future and it’s an exceptionally interesting world to delve into every day! Our mission is to provide the ultimate experience for every shopper at any given point in time and, in doing so, completely redefine the trillion-dollar e-commerce market. We hope you can help us achieve this ambitious mission!\n\nGranify is backed by early investors in Tesla, Facebook, SpaceX, AirBnB, Pinterest, Palantir, Alibaba, and Yelp and won Top E-Commerce Solution and Top Digital Startup at the DAA Awards!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 34
    },
    {
        "title": "Software Engineer",
        "company_name": "University of Alberta",
        "application_link": "https://ca.indeed.com/rc/clk?jk=fac20f8727915379&fccid=09ac3ce4d9d271d1&vjs=3",
        "application_details": [
            "$54,702–$74,295 a year",
            "Cover letter",
            "Full-time"
        ],
        "job_description": "SCI Computing Science\nCompetition No. -\nS113945967D3\n\nPosting Date -\nJan 27, 2022\n\nClosing Date -\nWill remain open until filled.\n\n\nPosition Type -\nFull Time - Grant Funded\n\nSalary Range -\n$54,702 to $74,295 per year\n\nGrade -\n08\n\nHours -\n37.5\n\n\nThis competition is open to all applicants however internal candidates and applicants who were former employees of the University of Alberta in the past 18 months will be given priority consideration before external candidates. Please indicate your internal status using the \"Advertisement\" drop down menu when applying.\nThis one year plus a day position with the possibility of extension offers a comprehensive benefits package which can be viewed at: Faculty & Staff Benefits.\nThe Chatbot research team lead by Dr. Osmar R. Zaïane at the Alberta Machine Intelligence Institute at the University of Alberta is seeking a full-time software developer to join an exciting project in order to build an end-to-end AI open-ended chatbot system for the elderly. The project titled ANA (Automated Nursing Agent) will require implementing state-of-the-art natural language understanding (NLU), natural language generation (NLG), and rule-based systems to cater to specific tasks the chatbot system is targeting. The successful candidate will mainly work in collaboration with graduate students in the research team implementing and incorporating their algorithms within the chatbot. This project is funded by the Alberta Machine Intelligence Institute (AMII). Our lab has a track record of publishing multiple papers at reputed NLP conferences like ACL, NAACL, and EMNLP.\nJob Description\nWe are looking for a talented and motivated software developer, willing to learn and preferably with an understanding of AI and chatbots to help us build an end-to-end AI chatbot system that will be released in production as a web server and an android application. The successful candidate will be responsible for implementing various machine learning and AI models for NLP response generation and general classification, integrating them in a web-server, and deploying them to production. We are using a Django web framework, MySQL database, python for server-side programming, and Pytorch for NLU and NLG models. Several AI models are needed to be integrated at the back-end that caters to different tasks like natural language understanding and generation, open-ended dialogue systems, and task-oriented rule-based systems. There is a need to efficiently and concurrently run these AI models during inference to improve the response time of the chatbot. Users will speak to the chatbot via a speech-to-text module or type questions, comments, and requests to the chatbot via the web interface. The ideal candidate will be passionate about artificial intelligence and system building and stay up-to-date with the latest developments in the field.\nDuties:\nWork with the research team to implement different AI models\nIntegrate different AI models together in the back-end\nImprove response time of chatbot system by implementing multiprocessing techniques at the back end\nImprove upon the existing web-interface by implementing user-centered design techniques\nWrite high quality, production code adhering to the principles of software design and development\nBuild a MySQL database on the server for storing the knowledge base and interactive sessions with users\nWrite tests and documentation for different components of the chatbot system and fix bugs wherever necessary\nImprove and optimize server-side processing of the application\nDeploy an application to production via Continuous integration and continuous deployment\nCommunicate about issues in the application with the research team\nQualifications:\nMinimum Bachelor’s Degree in Computer Science, Computer Engineering; Master’s Degree Preferred\nMust have experience with Python and Javascript. C++ is a bonus\nMust have experience with web-server frameworks like Django\nMust have experience with Linux servers, and MySQL and SparQL Databases\nMust have experience with Pytorch\nMust have knowledge of Machine learning and NLP concepts\nMust have knowledge of containarization (how to dockerize applications)\nExperience with Chatbots particularly with RASA is a plus\nExperience developing graphical user interfaces (GUI) preferred\nMust have experience with auxiliary development tools such as modern IDEs, code repositories, and Unix command line\nSalary: Will be commensurate with experience and based on a standard scale from the University of Alberta.\nPlease submit a cover letter, CV, and 2-5 references to chenyangh+programmer@ualberta.ca\nWe are looking for someone to start as soon as possible. The review of applications will continue until a suitable candidate is found.\nWe thank all applicants for their interest; however, only those individuals selected for an interview will be contacted.\nThe University of Alberta is committed to an equitable, diverse, and inclusive workforce. We welcome applications from all qualified persons. We encourage women; First Nations, Métis and Inuit persons; members of visible minority groups; persons with disabilities; persons of any sexual orientation or gender identity and expression; and all those who may contribute to the further diversification of ideas and the University to apply.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 35
    },
    {
        "title": "#2022-D-0071 Software Development Lead",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/rc/clk?jk=ca41b44ffa48c053&fccid=fcb062bb2c1e5a23&vjs=3",
        "application_details": [],
        "job_description": "Who we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you’re watching, how you're watching, or whether you’re in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\n\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\n\nINVIDI’s world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\n\nThe goal of developing a unified video ad tech platform is a big one and the right developers-like you-flourish in INVIDI’s creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI’s developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\n\nThe Opportunity:\nWe are seeking a Senior Software Delivery Lead, who is responsible for providing technical leadership, vision, direction, and mentoring of the software development team. This individual will also be hands-on with technical development and design. This position is on the software development leadership track that is designed for someone who has deep and practical software development skills and career leadership aspirations.\n\nKey Responsibilities:\nDevelop strategies and implementation plans that support both short and long-term objectives of the company.\nLead the software development teams and initiatives to ensure delivery of high-quality software or Software-as-a-Service offerings that meets the customer's needs while incorporating best practices.\nContinually motivate strong engineering teams comprised of onsite and remote employees.\nActively participate in the overall technical product/solution design, delivery and ongoing production support.\nWork closely with the leaders of various INVDI departments and geographies to deliver against product and technical roadmaps as well as ensure strong operational strategic alignment.\nWork to constantly challenge and improve existing application platforms and processes\nFoster innovation and creativity.\nFacilitate decision-making, impediment resolution, and consensus among team members.\nParticipate, and lead as required, in departmental administrative oversight processes such as budget preparation and implementation, personnel supervision and performance management, value alignment, and other areas as required.\nDetermine and design application architecture.\nOur Requirements:\nBachelor’s Degree in Computer Science or related technical discipline or equivalent practical experience.\nHigh-caliber, energetic leader with 7 plus years’ experience, including extensive hands-on software engineering experience.\nExperience leading software development teams, managing priorities, setting expectations, and delivering on commitments.\nTrack record of leading high performance software development teams.\nExtensive experience with design and development of complex distributed systems.\n\nSkills and Qualifications:\nExcellent interpersonal skills and judgement.\nStrategic thinker that can also execute on tactics.\nPractical knowledge of agile methodology and DevOps.\nAbility to handle multiple tasks under tight deadlines in a fast-changing environment.\nProven ability to develop a deep understanding of software in assigned stacks, interactions between and across systems, and rapid assessment of business processes that affect technology solutions.\nSoftware development skills in Java, Kotlin, C++, C# or Python, database design, and experience with cloud technologies (AWS/GCP)\nGood understanding of Architectural principles in Software Development\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\n\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at HR@INVIDI.com at least one week in advance of your interview.\n\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 36
    },
    {
        "title": "Enterprise Application Software Developer - Optik TV",
        "company_name": "TELUS",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4bed66200d0bd7b1&fccid=1a93caa31afcad42&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Location: Edmonton, AB, CA Vancouver, British Columbia, CA Toronto, ON, CA Halifax, Nova Scotia, CA Calgary, AB, CA Regina, SK, CA Victoria, British Columbia, CA\nReq ID: 30143\nJobs by Category: Technology Solutions\nJob Function: Engineering & Development\nStatus: Full Time\nSchedule: Regular\nDescription\n\nReady to create innovative solutions and best practices?\n\nJoin our team\n\nAt TELUS we are shaping the future of video content delivery, developing consistent, reliable and high quality applications to support our quality entertainment services. Our goal is excellence, simplicity and reliability. We are constantly iterating, solving problems, and working together to maintain a best in class TV experience.\n\nHere’s the impact you’ll make and what we’ll accomplish together\n\nThe successful candidate will join the Content Management DevOps team, to play a key role as a developer and provide operational support for applications supporting various middlewares and platforms. In this position you will be challenged to bring an operational mindset to product development, and drive process improvements. Your insight will be critical to driving architecture and design decisions, for continued improvement of our in house developed application. We are a fast-paced job in an evolving environment, so flexibility, strong work ethic and ability to adapt will be the key to your success.\n\nHere's how\n\nPlay a key role as a developer, to support the continued development of our video provisioning application.\nCollaborate with architects, designers, business system analysts, application analysts, operation teams and testing specialists to deliver fully automated Application Lifecycle Management system\nDeploys, configures, manages, and performs ongoing maintenance of technical infrastructure including all DevOps tooling used by Application Services\nAssists the development team with the preparation of releases for production. This may include assisting in the automation of performance tests, validation of infrastructure requirements, and guiding the team with respect to system decisions.\nProvide superior technical consultation to members of Content Management Team as well as other TELUS business units, on complex and critical service troubles to manage the restoration of our application on a 24x7 basis.\n\nQualifications\n\nYou're the missing piece of the puzzle\n\nRequired knowledge and experience with the following:\n\nFull stack development experience with good object oriented programming experience. Must have experience with Java stack and JavaScript frameworks.\nExperience working with both relational and non-relational database management systems.\nExperience in creating and leveraging APIs, that are both in-house or 3rd party provided.\nExperience with popular DevOps tools such as Ansible, Puppet or Chef.\nHands-on familiarity with testing methodologies and quality control.\nAbility to translate business requirements into technical implementations.\nAble to work within an existing framework and improve it wherever it is required as well as code optimization where applicable.\nExperience with virtualization, storage and basic networking understanding.\nStrong Troubleshooting Methodology\nExcellent interpersonal skills, talented at developing and fostering positive relationships with other team members\nBachelors Computer Science or Computer/Electrical Engineering Degree\n\nGreat-to-haves\n\nAdditional experience with any of the following will be considered an asset:\n\nExperience with cloud-native tools and cloud environments (GCP, AWS, etc.)\nAdvanced virtualization experience with VMware, KVM, Xen, Hyper\nIntermediate level Windows/Linux admin\nC/C#, .NET Core, Python, PHP\nGit, TFS, or equivalent\nFFHJOBS",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 37
    },
    {
        "title": "Lead Software Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=4093668606c68d06&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Lead Software Developer – Parallels Core Team\n\nPush the boundaries of tech. In your sweatpants.\n\nWe’re looking for an experienced Lead Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll prepare the design and architecture of components for the Parallels Desktop family of software, including the world’s best desktop virtualization solution, Parallels Desktop for Mac. You’ll be on the Core team, responsible for virtual processors, guest memory, and interrupt and time services.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nPrepare the design and architecture of components for the Parallels virtualization platform.\nResearch and apply innovative technologies for new features development.\nInvestigate sophisticated issues and virtualization platform maintenance.\nCoordinate cross-team implementation of complex features.\nSupport education for yourself and your teammates; proactively share knowledge.\nYOU:\n5+ years of experience with and deep knowledge of Virtualization technology, e.g., hypervisors and emulators.\n5+ years of experience in modern computer architectures, e.g., x86 and ARM.\n5+ years of experience with device emulation technology.\nIntermediate experience with low-level system programming, e.g., kernel modules and drivers for Windows, Linux, and MacOS.\nExperience and knowledge of Virtualization technology, e.g., hypervisors and emulators.\nHigh analytical, reverse engineering, and software profiling skills.\nKnowledge of JIRA and GIT tools.\nKnowledge of C and C++ programming languages.\nBasic knowledge of scripting, automation, and software testing.\nAbility and willingness to both learn and teach.\nThe following are not required, but definitely nice to have:\nKnowledge of Python.\nPrevious exposure to compilator, binary translator and JIT technology.\nFamiliarity with networking and client server software development.\nUS:\nParallels is an award-winning productivity solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 38
    },
    {
        "title": "#2023-D-0002 Senior Software Developer",
        "company_name": "Invidi Technologies Corporation",
        "application_link": "https://ca.indeed.com/rc/clk?jk=1d18ef0ab86400fc&fccid=fcb062bb2c1e5a23&vjs=3",
        "application_details": [],
        "job_description": "Senior Software Developer\nLocation: Edmonton, AB\n\nWho we are:\nINVIDI Technologies is the world's leading developer of software transforming television all over the world. Our two-time Emmy® Award-winning technology is widely deployed by cable, satellite, and telco operators. We provide a device-agnostic solution delivering ads to the right household no matter what program or network you’re watching, how you're watching, or whether you’re in front of your TV, laptop, cell phone or any other device. INVIDI created the multi-billion-dollar addressable television business that today is growing rapidly globally.\n\nINVIDI is right at the heart of the very exciting and fast-paced world of commercial television; companies benefiting from our software include DirecTV and Dish Network, networks such as CBS/Viacom and A&E, advertising agencies such as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.\n\nINVIDI’s world-class technology solutions are known for their flexibility and adaptability. These traits allow INVIDI partners to transform their video content delivery network, revamping legacy systems without significant capital or hardware investments. Our clients count on us to provide superior capabilities, excellent service, and ease of use.\n\nThe goal of developing a unified video ad tech platform is a big one and the right Associate Software Developers-like you-flourish in INVIDI’s creative, inspiring, and supportive culture. It is a demanding, high-energy, and fast-paced environment. INVIDI’s developers are self-motivated quick studies, can-do individuals who embrace the challenge of solving difficult and complex problems.\n\nAbout the role:\nAre you passionate about technology? Do you want to be part of the team that is revolutionizing TV advertising across millions of homes worldwide? If so, don't miss this opportunity to co-author software artifacts with technology experts that disrupt the advertising world by working on our industry-leading addressable advertisement solution.\n\nYou’ll be contributing to INVIDI’s SaaS solution that provides targeted advertising for online streaming platforms. In addition to this core service, you will help shape the technology powering INVIDI’s overall monitoring solution that allows customers to gain insights into their campaigns.\n\nWe’re agile, with a dedicated Scrum Master, whose only job is to make sure we have everything we need to keep focused on our tasks. We strive to choose the best tool for the job and we're looking for people who love to learn fast and get things done. We are supported by a great SRE team and prefer to use shared common tooling.\n\nKey Responsibilities:\nWe are a DevOps organization, so our core responsibility is the development and operation of the services making up INVIDI's SaaS platform.\nFull software development lifecycle\nDeployment and operation of services\nTeam on-call rotation required\nTroubleshoot incidents and implement adequate solutions to restore and maintain system function, supported by automated monitoring, incident managers and our support team.\nWriting and maintaining documentation\nActively participate in our Agile process, including sprint planning, backlog refinement, etc.\nActively participate in implementing continuous integration/delivery, static code analysis, and test automation.\nWork with our Talent Development Managers to build and follow a personalized skills development plan.\nYou will design, develop, deploy and operate backend services in Kotlin or Java that are scalable, durable and performant.\nYou will collaborate closely with peers and product owners in an autonomous, cross-functional team.\nYou will help other team members grow as engineers through code review, pairing, and mentoring.\nAs a part of the DevOps team, you will be on-call for the services that the team owns. You are on-call for one week, approximately once per month. While on call, you are required to be reachable by telephone and able to act upon alarm using your laptop.\n\nOur Requirements:\nBachelor's Degree in Computer Science or equivalent.\n5+ years of backend engineering experience\nYou are an outstanding Java/Kotlin developer who loves to develop distributed high-volume systems.\nYou care about the craft and cherish the opportunity to work with smart, supportive, and highly motivated colleagues.\nYou like to learn new things, mentor, and share knowledge with team members.\nDeep understanding of object-oriented design, data structures and analytics, and algorithms.\nDeep understanding and experience of working with database technologies such as PostgreSQL, TSQL, DynamoDB, Redis as well as Protocol Buffers.\n\nHighly preferred candidates also have\nWorking experience in an Agile environment: Scrum, Kanban\nIndustry knowledge of big data and distributed systems.\nExperience building RESTful web services.\nWorking experience in a DevOps environment.\nSoftware design and systems architecture experience.\nExperience with security in software development and architecture.\nExperience with the tools we use:\nInfrastructure as code: Terraform, Ansible\nAnsible\nSource control: Git, GitHub/BitBucket\nCI/CD: Jenkins, BitBucket Pipelines\nPub/Sub: Kafka, AWS Kinesis\nContainerization/Orchestration: Docker, Kubernetes, AWS ECS/EKS\nDeveloper security platforms: snyk, veracode\nObservability/Monitoring: Datadog, AWS CloudWatch, PagerDuty\nExperience building and deploying cloud-based software using AWS or GCP.\nCable or Satellite industry knowledge is a plus.\nExcellent oral and written communication skills.\nBuild tools such as Maven.\nContainerization with Docker and Kubernetes.\nDeveloping and deploying RESTful web services.\nCloud experience with GCP and AWS and their services.\nDeep understanding of:\nObject-oriented design, data structures, algorithms\nExperience writing code that adheres to a style guide.\nExperience performing peer code reviews to ensure code quality.\nStrong development skills in one or more of the following languages:\nJava/Kotlin (Highly preferred)\nPython\nBash\nGo\nJavaScript\nC#\n\n\nINVIDI offers competitive benefits and total rewards:\nPaid Time Off (PTO) Vacation\nCompany Holidays\nMedical & Prescription\nDental & Vision\nRRSP, STD, LTD, AD&D and Life\nCorporate Discounts\nTuition Reimbursement Program\nEmployee Referral Bonus Program\n\nPhysical requirements:\nINVIDI is a conscious, clean, well-organized, and supportive office environment.\nProlonged periods of sitting at a desk and working on a computer are normal.\n\nEqual Opportunities and Accommodations Statement:\nINVIDI is deeply committed to building a workplace and global community where inclusion is not only valued but prioritized. We’re proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, family status, marital status, sexual orientation, national origin, genetics, neurodiversity, disability, age, or veteran status, or any other non-merit based or legally protected grounds.\n\nINVIDI is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact Human Resources by email at HR@INVIDI.com at least one week in advance of your interview.\n\nNote:\nAll candidates must pass compliance background screening and drug testing.\nVisa sponsorship is not available for this position; you must be legally authorized to work in Canada.\nINVIDI has reopened its offices on a flexible hybrid model.\n\nReady to join our team? Apply today!",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 39
    },
    {
        "title": "Hydrotechnical / Hydropower Engineer",
        "company_name": "Boreal Water Resources Ltd.",
        "application_link": "https://ca.indeed.com/company/Boreal-Water-Resources-Ltd./jobs/Hydrotechnical-4cea6db976cf0aba?fccid=cac586913f404e2c&vjs=3",
        "application_details": [
            "Full-time",
            "Part-time",
            "Remote"
        ],
        "job_description": "Founded in 2017, Boreal Water Resources Ltd. (Boreal) is a specialist engineering design and project management firm focused on hydrological assessment, hydraulic design and renewable energy development. Our client base includes independent power producers, mining companies, municipalities, land developers, First Nations and non-governmental organizations. Our passion is rivers, lakes and coastal areas and we strive to provide effective, responsible solutions for water resources problems of all magnitudes and complexities.\nTHE OPPORTUNITY\nWe are actively seeking an experienced and enthusiastic Intermediate Hydrotechnical / Hydropower Engineer. Location of employment is flexible, although preference will be given to candidates based in Edmonton, Calgary or Vancouver. The successful candidate will work on a variety of river engineering, hydrology and hydropower assignments, which may include:\nHydropower design and operation.\nPower and energy analysis for run-of-river, storage and pumped storage hydro projects.\nPeak flow analysis, flood hazard and inundation studies.\nHydraulic design of infrastructure, such as intakes, weirs, pipes/penstocks, diversions, culverts or erosion protection.\nCreek restoration and bank stabilization.\nHydrodynamic/CFD modeling of effluent discharges, hydraulic structures, and natural channels.\nDam safety reviews, consequence classification, and related documentation.\nWater balance modeling for residential or industrial developments.\nHydrological and environmental data collection and analysis, including instream flow measurement water quality and bathymetric survey.\nDilution and contaminant plume modeling.\nPreparation of comprehensive watershed studies and project baseline assessments.\nResearch into novel hydrometric monitoring instrumentation, methodologies and techniques.\nBoreal is a small, growing company and our staff participate in all aspects of the company’s operations and future growth strategy. As such, the successful candidate will participate in and/or lead the following activities:\nIndependently lead projects, including field programs.\nIdentification of new business opportunities, including preparation of proposals, work plans and cost estimates.\nManagement of contractors and sub-consultants, including preparation of contractual documents.\nDevelopment and implementation of Boreal’s corporate safety and quality programs.\nBuild relationships with clients and represent Boreal at industry events and conferences.\nPreparation of applications for funding opportunities, both for Boreal innovations and clients’ projects.\nManagement of regulatory applications and other submissions, including negotiation of key conditions of approvals and authorizations.\nProfessional sign-off of designs and studies, as well as professional review of the work of others.\nResearch and development activities for novel technologies and/or techniques that can be applied to our work.\nExact work assignments will depend on the qualifications and interests of the successful candidate, as well as Boreal’s active project workload.\nYOUR QUALIFICATIONS\nOur ideal candidate will have the following qualifications and competencies:\nDegree in Civil or Environmental Engineering with a specialization in Hydrotechnical Engineering.\n4 to 10 years of relevant experience.\nRegistration (or eligible for registration) as a Professional Engineer with APEGA, EGBC or APEY.\nSound understanding of hydrological principles and hydraulic design theory.\nDemonstrated experience in the tasks noted above.\nUnderstanding of hydropower development, design, and operations.\nExperience with hydromechanical and/or electromechanical systems.\nAbility to independently lead projects and take professional responsibility for deliverables.\nExperience with standard business software.\nExcellent communication, technical writing and presentation skills.\nComfortable working outdoors in remote environments.\nA strong command of the English language, both oral and written.\nPreferably, you would also have experience/competency in several of the following:\nFluvial-geomorphological processes and models.\nInstrumentation used for hydrometric, bathymetric or meteorological data collection.\nRenewable power technologies, such as wind, solar or battery storage.\nGrid interconnection processes and procedures.\nExperience with some of the following software: o AutoCAD / Civil 3D o Hydrological models: HEC-HMS, Raven, GoldSim o Hydraulic models: HEC-RAS, FLOW-3D, ANSYS, Simsen, Bentley Hammer, HY-8 o GIS platforms (QGIS, ArcGIS), including mapping, web maps, and analysis o Data management platforms, such as Aquarius Time Series. o Data analysis using Python or R.\nSafety certifications such as the following: Standard First Aid / Wilderness First Aid; Pleasure Craft Operator / Small Vessel Operator Proficiency; MED A3 / SDV-BS; Swiftwater Rescue.\nIn addition, you must be self-motivated, an independent problem-solver and attentive to details. You will have enough flexibility in your schedule to be able to respond to project demands as they come about.\nExceptional candidates whose qualifications deviate from the above will be considered on a case-by-case basis.\nWHAT WE OFFER\nBoreal is offering competitive remuneration and a flexible working arrangement that can be tailored to suit your lifestyle. You will gain exposure to a variety of projects and industries and will be able to participate in future direction of a vibrant, young company.\nFor the right candidate, Boreal can accommodate a part-time work schedule or remote assignment.\nWe appreciate all applications received for this competition. However, only candidates selected for an interview will be contacted. Applications received may be used to fill future opportunities with Boreal Water Resources Ltd.\nJob Types: Full-time, Part-time\nPart-time hours: 32-40 per week\nSchedule:\nMonday to Friday\nEducation:\nBachelor's Degree (preferred)\nExperience:\nHydrotechnical: 3 years (required)\nWork Location: Hybrid remote in Edmonton, AB",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 40
    },
    {
        "title": "Senior Software Developer - Optik TV",
        "company_name": "TELUS",
        "application_link": "https://ca.indeed.com/rc/clk?jk=d44db30abcfdbb08&fccid=1a93caa31afcad42&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "Location: Edmonton, AB, CA Halifax, Nova Scotia, CA Winnipeg, MB, CA Calgary, AB, CA Regina, SK, CA Toronto, ON, CA\nReq ID: 32327\nJobs by Category: Technology Solutions\nJob Function: Engineering & Development\nStatus: Full Time\nSchedule: Regular\nDescription\n\nJoin our team and what we'll accomplish together\n\nWith the convergence of innovative home and mobile networking technologies including fibre and 5G, smart home solutions, mobile devices, automation, cloud computing, and over-the-top capabilities, our customers’ homes look very different in today’s digital world. Every day, TELUS’ engineering and development teams are envisioning what the future holds and building the technologies to simplify our customers’ lives, provide services at the touch of a button, and create immersive entertainment experiences.\n\nAs a software developer on the Cloud PVR and Live Software development team, you will play a key role as a developer and provide operational support for applications supporting various middlewares and platforms. In this position you will be challenged to bring an operational mindset to product development, and drive process improvements. Your insight will be critical to driving architecture and design decisions, for continued improvement of our in house developed application. We are a fast-paced job in an evolving environment, so flexibility, strong work ethic and ability to adapt will be the key to your success.\nHere's How\n\nPlaying a key role as a developer to support the continued development of our microservices-based architecture and cloud native applications you will:\nCollaborate with architects, designers, business system analysts, application analysts, operation teams and testing specialists to deliver fully automated Application Lifecycle Management system\nDeploy, configure, manage, and perform ongoing maintenance of technical infrastructure including all DevOps tooling used by Application Services\nAssist the development team with the preparation of releases for production. This may include assisting in the automation of performance tests, validation of infrastructure requirements, and guiding the team with respect to system decisions.\nProvide superior technical consultation to members of Cloud PVR and Live Software development team as well as other TELUS business units, on complex and critical service troubles to manage the restoration of our application on a 24x7 basis.\n\nQualifications\n\nWhat you bring\n\nExcellent knowledge and experience with Java stack, Spring Boot, server-side languages - specifically Java (8+ years) Experience working with both relational and non-relational database management systems\nExperience in creating and leveraging APIs and RESTful services, that are both in-house and/or 3rd party provided\nExperience with Kubernetes, docker and cloud architectures(GCP/AWS/Azure) and DevOps tools such as Cloudbuild, Jenkins, Harness\nStrong troubleshooting skills with hands-on familiarity with testing methodologies and quality control\nAbility to translate business requirements into technical implementations\nExperience with virtualization, storage and basic networking understanding\nExcellent interpersonal skills, talented at developing and fostering positive relationships with other team members\nBachelors Computer Science or Computer/Electrical Engineering Degree\n\nGreat-to-haves\n\nAdditional experience with any of the following will be considered an asset:\nIntermediate level Windows/Linux admin\nJava, C/C#, .NET Core, Python, PHP\nGit, TFS, or equivalent\nFFHJOBS",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 41
    },
    {
        "title": "Lead OS Integration Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=9459e5cdcfad45c7&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Push the boundaries of tech. In your sweatpants.\n\nWe’re looking for an experienced Lead OS Integration Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll design and develop cross-platform integration solutions for the Parallels products family.\nOS Integration is the department that drives Parallels Desktop exciting and innovative features like Coherence, Shared Clipboard, Drag-and-drop, Shared Folders, Shared Profile, and many smaller features. Most of our efforts are put into Windows on Mac scenarios, we dig deep into those operating systems, providing the most user-experience facing features. However, there are many other essential features we provide for Linux and other operating system integration scenarios as well.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDesign and develop cross-platform integration solutions for Parallels products family\nHelp support existing features and improve legacy code base\nWork with different teams driving new features\n\nYOU:\n\n4+ years of programming in modern C++\nExperience creating Windows/Linux/macOS drivers and services for custom devices\nUnderstanding OS architecture principles, frameworks, internals\nUnderstanding of OOP, design patterns\nStrong experience with multithreaded programming aspects\nDesire to research and develop cross-platform and platform-tight, cross-architecture, cross-team solutions\nResponsible, self-driven, proactive, result oriented, team player\nGood written and spoken English\n\nThe following are not required, but definitely nice to have:\n\nObjective-C and macOS frameworks (AppKit/Foundation/etc.)\nLinux kernel device drivers\nLinux low-level GUI (X11, Wayland)\nWin32 low-level API (User/GDI/Shell/Winsock/Services/MSI/etc.)\nWindows kernel driver development (Installable File Systems)\nQt framework: Core, Network, XML, Widgets\nExperience of basic automatic with Python/shell scripts\nExperience in client-server application development\n\nUS:\n\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\n\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\n\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 42
    },
    {
        "title": "Software Technical Lead - SafeTrace Tx",
        "company_name": "Haemonetics Corp.",
        "application_link": "https://ca.indeed.com/rc/clk?jk=c1a476ebe44942c9&fccid=932481fa2e1b1ff5&vjs=3",
        "application_details": [
            "Full-time"
        ],
        "job_description": "We are constantly looking to add to our core talent. If you are seeking a career that is challenging and rewarding, a work environment that is diverse and dynamic, look no further — Haemonetics is your employer of choice.\nJob Details\nResponsibilities/Essential Duties\n\nDuties are listed in order of greatest importance:\nResponsibility: Responsible for all technical aspects of the product (technical debts, features/improvements, architecture.)\nTechnical Stack: Keeps team and product up to date with technology and trends.\nInnovation: Research new tools and technologies to further innovation. Works with Sales, Marketing and R&D to generate future pipeline plans and drive technologies to support.\nDesign and Code Reviews: Reviews design and code for team which will include both internal and external partnerships. Especially focuses on high value changes based on impact or significant scope.\nDevelopment: Chief architect and designer for the platform and may coding and prototyping large and/or complex features. Works closely with other technical leaders across Haemonetics to drive new interconnected features as well as advancing the foundational technology across multiple platforms.\nTalent Management: Mentors developers through example and direct feedback to develop future technical leadership for Haemonetics.\nCybersecurity: Designs to ensure robust and protected applications especially for systems including PHI and PII. Works closely with various cybersecurity leaders across Haemonetics to drive best practices into products.\nRelease and Support: Manages a CI/CD pipeline for major and minor releases and patches.\nSupervisory: Position requires leading internal and external developers directly and indirectly.\nTravel: If not Boston-based, then 10 - 25%. If Boston-based, 10-20% to Boston HQ, 5-10% to customer and/or partner sites, etc.\n\nRequired Knowledge, Skills, & Capabilities\nExperience in design/architecture (Strong)\nExperience with multiple technologies and platforms at both the enterprise and consumer level (Strong)\nTechnical skills (Strong) across the platforms include:\nCoding in Java, C#, .NET, JavaScript/TypeScript, web frameworks (Angular-preferred), scripting languages (Lua, Python).\nDatabase skills (Oracle, SQL Server)\nCloud technologies (Amazon AWS)\nInfrastructure (cloud platforms, networking, cybersecurity, high-availability, scalability)\nBuilding/managing a CI/CD pipeline and DevOps (Intermediate)\nExperience in HL7 (Preferred)\n\nQualifications/Education\nBachelor's Degree: BA/BS in Computer Science or a relevant discipline (Required)\nMaster’s Degree: MS in Computer Science or a relevant discipline (Preferred)\n9+ Years: Software development / testing / support experience (Required)\n4+ years: Regulated Healthcare or Medical Device Experience (Preferred)\nAmazon AWS Training/Certification (Preferred)\nEEO Policy Statement",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 43
    },
    {
        "title": "Senior Software Engineer 3D",
        "company_name": "Recruiting From Scratch",
        "application_link": "https://ca.indeed.com/rc/clk?jk=2e411bd1aef32ee3&fccid=09e02654c2f26bbd&vjs=3",
        "application_details": [
            "$150,000–$200,000 a year",
            "Full-time",
            "Remote"
        ],
        "job_description": "Who is Recruiting from Scratch:\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.\nIf you are a fit, the team will reach out to you about this role or any others that may be a fit for our clients.\nOur Client\nOur client is a stealth-mode metal 3D printing startup founded on the belief that transforming the way things are made is essential to making the world a better place. Their advanced technology stack lies at the intersection of hardware, software, and data science, creating the foundation for the world’s first fully autonomous and scalable manufacturing system. Their core team hails from several of the world’s most innovative companies such as SpaceX, Hyperloop, and Blue Origin, and they have secured significant funding from several of Silicon Valley’s top venture capital firms.\nWe are actively looking for a highly passionate and self-motivated individual that can excel in a dynamic work environment and will play a critical role in developing software for a variety of functions within our advanced metal 3D printing systems. XX. Ultimately, your solutions will enable the first production scale, high quality, and fully automated metal 3D printing factory. As a crucial member of the engineering team, you will be responsible for driving the pace of innovation, maximizing development speed, and maintain a standard of excellence within the entire engineering team.\nResponsibilities :\nDesign and develop the print preparation software pipeline for an advanced production-scale metal 3D printing system, including automating CAD import, geometry processing, slicing, and toolpath planning.\nWork with back-end software developers to architect the software interface to the metal 3D printing hardware layer.\nDevelop software required to implement production automation solutions in the front-end geometry processing pipeline.\nDevelop software to implement algorithms for geometry deformation, procedural geometry generation, and space-filling operations.\nWork with computational geometry engineers and simulation engineers to integrate physics-based and data-driven models into the software simulation pipeline.\nIntegrate 2D and 3D meshing techniques into the physical simulation software pipeline.\nDevelop, unit test, and deploy functional, scalable, robust, and maintainable software.\nBasic Qualifications:\n5+ years of professional experience in software development using C++, Rust, Java, Python, or similar.\n1+ years of experience developing software for geometry processing such as but not limited to visual effects, animation, video games, or graphics industries.\nAble to provide legal proof of identity and authorization to work in the United States, which applies to U.S. citizens and non-U.S. citizens alike.\nPreferred Skills and Experience:\nBS, MS or PhD in computer science, applied mathematics, or related field highly preferred.\nExperience interfacing with CAD and CAM software APIs.\nExperience with 2D and 3D meshing techniques.\nKnowledge of MATLAB.\nExperience with cloud computing.\nExperience with optimization techniques.\nCreative thinker able to apply first-principles reasoning to solve complex problems.\nExcellent verbal and written communication skills.\nLocation\nWe are now located in Hawthorne in a 20,000 square foot, state of the art facility featuring large open spaces for team collaboration, R&D, and production, as well as easy access to the 405, 105, and 110 freeways. Our facility is in the heart of LA’s vibrant emerging tech eco-system alongside many other high growth start-ups and enterprises.\nBenefits/Salary\nWe have an inclusive and diverse culture that values collaboration, learning, and making deliberate data-driven decisions.\nWe offer a competitive compensation package that includes significant equity in the company, as well as a full suite of additional benefits including premium health care (medical, dental, and vision) and life insurance, paid vacation, and holidays.\nOur work environment includes casual dress, flexible work hours, a fully stocked kitchenette, free parking, daily paid-for lunches, and regular catered team-building events.\nFreeform is an Equal Opportunity Employer that values diversity; employment with Freeform is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.\nBase salary: $150-200k",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 44
    },
    {
        "title": "Lead Direct3D Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=7fe679513838d8e9&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Remote"
        ],
        "job_description": "3D Graphics Developer - Direct3D\nWe’re looking for an experienced 3D Graphics (Direct3D) Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll develop cutting edge graphics virtualization technology with our Parallels team.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDevelop graphics virtualization technology with primary focus on Direct3D API\nDevelop and support graphics drivers for Windows platform\nDevelop and support Direct3D API mediation/translation layer\nInvestigate third-party applications issues to find graphics emulation deficiencies\nAnalyze performance of third-party applications with respect to graphics API usage\nYOU:\n5+ years of experience in C/C++ development with basic Objective-C knowledge and familiarity with Python is ideal\nDeep knowledge of Direct3D 9/10/11/12 and Apple Metal graphics APIs\n4+ years of experience developing graphics application for Windows and MacOS platforms\n4+ years of experience in 3D Graphics debugging using tools like PIX, RenderDoc or the like\nWilling and able to take over existing code base, including legacy code\nWilling and able to routinely investigate third-party applications issues\nThe following are not required, but definitely nice to have:\nGraphics virtualization or Graphics API translation experience\nBlackbox debugging skills for 3D graphics applications\nSome practice of using Git and/or Jira\nUS:\nParallels is an award-winning productivity solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 45
    },
    {
        "title": "Senior Direct3D Software Developer",
        "company_name": "COREL CORPORATION USA",
        "application_link": "https://ca.indeed.com/rc/clk?jk=e88082e30fe6225f&fccid=4d9aaa630f41a058&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "We’re looking for an experienced 3D Graphics Direct3D Software Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll develop cutting edge graphics virtualization technology with our Parallels team.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDevelop graphics virtualization technology with primary focus on Direct3D API\nDevelop and support graphics drivers for Windows platform\nDevelop and support Direct3D API mediation/translation layer\nInvestigate third-party applications issues to find graphics emulation deficiencies\nAnalyze performance of third-party applications with respect to graphics API usage\nYOU:\n5+ years of experience in C/C++ development with basic Objective-C knowledge and familiarity with Python is ideal\nDeep knowledge of Direct3D 9/10/11/12 and Apple Metal graphics APIs\n4+ years of experience developing graphics application for Windows and MacOS platforms\n4+ years of experience in 3D Graphics debugging using tools like PIX, RenderDoc or the like\nWilling and able to take over existing code base, including legacy code\nWilling and able to routinely investigate third-party applications issues\nThe following are not required, but definitely nice to have:\nGraphics virtualization or Graphics API translation experience\nBlackbox debugging skills for 3D graphics applications\nSome practice of using Git and/or Jira\nUS:\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 46
    },
    {
        "title": "Senior OS Integration Developer",
        "company_name": "Alludo",
        "application_link": "https://ca.indeed.com/rc/clk?jk=5cc4bc3f5efe07ba&fccid=ddc31b1b98dec63b&vjs=3",
        "application_details": [
            "Full-time",
            "Remote"
        ],
        "job_description": "Senior C++ Developer : OS Integration - Parallels\nWe’re looking for an experienced C++ Developer to help us change the way the world works, with anytime, anywhere, any-device productivity. Here, you’ll design and develop cross-platform integration solutions for the Parallels products family.\nOS Integration is the department that drives Parallels Desktop exciting and innovative features like Coherence, Shared Clipboard, Drag-and-drop, Shared Folders, Shared Profile, and many smaller features. Most of our efforts are put into Windows on Mac scenarios, we dig deep into those operating systems, providing the most user-experience facing features. However, there are many other essential features we provide for Linux and other operating system integration scenarios as well.\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\nThis is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\nWe want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\nIt’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\nSound good so far? Awesome. Let’s talk more about the role and see if we’re destined to be together.\nTHE ROLE:\nDesign and develop cross-platform integration solutions for Parallels products family\nHelp support existing features and improve legacy code base\nYOU:\n2+ years of programming in modern C++\nUnderstanding OS architecture principles, frameworks, internals\nUnderstanding of OOP, design patterns\nGood experience with multithreaded programming aspects\nDesire to research and develop cross-platform and platform-tight, cross-architecture, cross-team solutions\nResponsible, self-driven, proactive, result oriented, team player\nGood written English as minimum, spoken English as a plus\nThe following are not required, but definitely nice to have:\nObjective-C and macOS frameworks (AppKit/Foundation/etc.)\nLinux kernel device drivers\nLinux low-level GUI (X11, Wayland)\nWin32 low-level API (User/GDI/Shell/Winsock/Services/MSI/etc.)\nWindows kernel driver development (Installable File Systems)\nQt framework: Core, Network, XML, Widgets\nExperience of basic automatic with Python/shell scripts\nExperience in client-server application development\nUS:\nParallels is an award-winning solution that helps users leverage the best technology out there, whether it’s Windows, Mac, Chrome OS, iOS, Android, or the cloud.\nWe have millions of users and decades of innovation under our belts.\nWe offer a fully remote workspace – and we mean it. There is no pressure to work in an office whatsoever.\nWe have flexible work arrangements and locations to suit your style.\nHours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\nOur team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\nAbout Alludo\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential.",
        "status": {
            "name": "status...",
            "color": "white",
            "progression": 0
        },
        "id": 47
    }
]